[
	{
		"page": 2,
		"trademark": "JAI MAA",
		"details": "3819572    28/04/2018 RAMAN GOYAL TRADING AS JAI MAA INDUSTRY D-59, FOCAL POINT, MAND I GOBINDGARH-147301 (PB.) PROPRIETORSHIP Address for service in India/Attorney address: MAHTTA & CO 43-B/3, UDHAM SINGH NAGAR, LUDHIANA. 141001 (PUNJAB) Used Since :05/10/2000 DELHI Advertising, Business Administ ration and Management of wholesale & Reta il outlets; Trading, Marketing, Online  Marketing, Import & Exports relating to  Steel Tubes, Bar Steel, Sheet Steel, St eel Strips, Steel Wi re, Steel Building  Material, Stainless Steel, Pipes,  Galvanized Steel Pipes, Steel  Pipes & Tubes; Pipes, Flexible Pipes, Gal vanized for Pipes,  Rubber Coupling for Pipes, In sulation Material for Pipes. 3857"
	},
	{
		"page": 7,
		"trademark": "NASA Care Life",
		"details": "3914970    13/08/2018 NASA CARE LIFE (PROP. NARESH) 205, 2ND FLOOR, DAYAL MARKET, ALIPUR, DELHI-110036 PROPRIETOR Address for service in India/Attorney address: PRASHANT DANGI 216, TRANSFARMER WALI GALI, V.P.O. , TIKRI KHURD, NARELA, DELHI-110040 Proposed to be Used DELHI Advertising, Business Management, Business administration, office fu nction under class 35 3862"
	},
	{
		"page": 10,
		"trademark": "SWASTIK DYESTUFF INDUSTRIES",
		"details": "4005472    23/11/2018 PIYUSH JINDAL M/S SIYA RAM DYES & CHEMICAL CO.AT- PLOT NO  - 439, NEAR RAILWAY CROSSING NARELA, DELHI-110040 PROPRIETOR Address for service in India/Attorney address: SAI ASSOCIATES F-175, 30 FUTA ROAD, KHAJURI KHASS DELHI 110094 Proposed to be Used DELHI WHOLESALE AND RETAIL AGENY OF DIRECT DYES, REACTIVE DYES, SU LPHUR DYES, PIGM ENT DYES, ACID  DYES,VAT DYES IN CLASS-35 3865"
	},
	{
		"page": 11,
		"trademark": "SANICARE PHARMACEUTICALS",
		"details": "4038216    26/12/2018 MR. ASHISH PANDEY VILLAGE- RAJPUR, POST- NAGLA RAM SUNDER, JASWANT NAGAR,ETAWAH,UTTAR PRADESH-206245 INDIVIDUAL Address for service in India/Attorney address: GIRI & COMPANY A-212C/306, TIRUPATI PLAZA GALI NO.1, SHAKARPUR, DELHI-92 Proposed to be Used DELHI ADVERTISING, BUSINESS MANAG EMENT, BUSINESS ADMINISTRAT ION, OFFICE FUNCTIONS. 3866"
	},
	{
		"page": 14,
		"trademark": "The Koncept Prive",
		"details": "4102916    28/02/2019 KONCEPT RETAIL SERVICES PRIVATE LIMTED A10, Third Floor, Sanskriti Bhawan, Aruna Asif Al i Marg, Qutab Institutional Area, New Delhi 110067 Service Provider Address for service in India/Attorney address: ANGAD SINGH DUGAL 8A Panchsheel Marg, Chanakyapuri, New Delhi – 110 021 Proposed to be Used DELHI Retail services; retail servi ces for cosmetics and perfumes 3869"
	},
	{
		"page": 16,
		"trademark": "Gulaq",
		"details": "4103958    01/03/2019 ESTEE FINANCIAL SERVICES PRIVATE LIMITED 7TH FLOOR, BLOCK-I, VATIKA BUSINESS PARK, SOHNA ROAD, SECTOR-49, GURGAON-122001. SERVICE PROVIDERS Address for service in India/Attorney address: CORPORATE LAWS PRACTICE E-2001, IREO UPTOWN, SECTOR-66, GURGAON-122101. Proposed to be Used DELHI ADVERTISING INCLUDING TELEVISION,  TELECOMMUNICATION, PR INT, RADIO, ONLINE AND  OFFLINE ADV ERTISING  INCLUDING ONLINE RETAIL MARKE TING, WEB INDEXING FOR COMMERC IAL AND ADVERTISING PURPOSES,  PRESENTATION OF GOODS ON COMMUNI CATION MEDIA FOR RETAIL  PURPOSES, SEARCH ENGINE OPTIMIZATION  FOR SALES PROMOTION, PROVISION OF AN ONLINE  MARKETPLACE FOR BUYERS  AND SELLERS OF GOODS AND  SERVICES ENABLING CUSTOMERS TO CONVENIENTLY VIEW AND PURCHASE THOSE GOODS; SUCH SERVICES MAY  BE PROVIDED BY RETAIL STOR ES, WHOLESALE OUTLETS , THROUGH VENDING M ACHINES, MAIL ORDER  CATALOGUES OR BY MEANS OF ELECTRONIC MEDIA,  FOR EXAMPLE, THROUGH WE B SITES OR TELEVISION  SHOPPING PROGRAMMES, FINANCIAL AUDITING AND  CORPORATE COMMUNICATION SERVICE; BUSINESS  MANAGEMENT, BUSINESS ADMINISTRATION AND OFFICE FUNCTIONS. 3871"
	},
	{
		"page": 18,
		"trademark": "ALANKKAR GALLERIA",
		"details": "4122048    19/03/2019 DR. SEEMA SINGH Flat 102; Second floor; Pragatisheel  Apartment, Sector 9 Rohini, Delhi AN INDIVIDUAL Address for service in India/Attorney address: KANIKA JAIN LegalRaasta Technologies Pvt. Ltd, B- 300 Saraswati Vihar Pitampura Delhi -110034 Proposed to be Used DELHI Retail of Textile goods 3873"
	},
	{
		"page": 22,
		"trademark": "ELECTRONICA",
		"details": "4167499    05/05/2019 ELECTRONICA INDIA LIMITED 4, FAIRLIE PLACE, KOLKATA-700001, WEST BENGAL, INDIA. BODY INCORPORATE Address for service in India/Attorney address: SOUMYAJIT MISHRA 30/Q, HOSPITAL RD EAST, (1349 PURB ACHAL MAIN RD) GARFA, KOLKATA 78 WB Used Since :01/04/1975 KOLKATA ADVERTISING, BUSINESS MANAG EMENT, BUSINESS ADMINISTRATION, TRADI NG, OFFICE FUNCTIONS IN RELATION  TO ELECTRIC DISCHARGE MACHINES,  WIRE ELECTRIC DISCHARGE MACHINES,  METAL CUTTING MACHINES AND/OR  ITS ALLIED PRODUCTS UNDER CLASS 35 3877"
	},
	{
		"page": 26,
		"trademark": "POPSTAR",
		"details": "4202372    10/06/2019 JAGDAMBAY CYCLES PVT. LTD. INDUSTRIAL AREA-C, SARPANCH COLONY, V.P. O. JASPAL BANGAR, LUDHIANA-141122 (PB.) A COMPANY INCORPORATED UNDER THE COMPANIES ACT Address for service in India/Attorney address: MAHTTA & CO 43-B/3, UDHAM SINGH NAGAR, LUDHIANA. 141001 (PUNJAB) Used Since :01/04/2015 DELHI Advertising, Business Administrati on & Management of wholesale  & Retail outlets; Trading,  Marketing & Online Marketing  relating to Bicycle & its Parts. 3881"
	},
	{
		"page": 33,
		"trademark": "MAHHEERA",
		"details": "4248280    27/07/2019 SOUVIK BHATTACHARIYA PARTNER OF MAHHEERA 415, EAST BANKIM PALLY, DHAKAPARA, P.O.+P.S. MADHAMGRAM, DIST. 24 PGS (N), KOLKATA - 129 PARTNERSHIP FIRM Address for service in India/Attorney address: S. CHATTERJEE & ASSOCIATES 349/3,INDIRA GANDHI ROAD, KONNAGAR,HOOGHLY,PIN 712 235,WEST BENGAL,INDIA. Used Since :18/12/2018 KOLKATA ONLINE SELLING OF GARMENTS  LIKE LADIES GARMENTS, MEN'S G ARMENTS, ELECTRONICS, MOBILE  ACCESSORIES, MOBILE GADGETS,  JEWELLERY, HOME AND KITCHEN APPL IANCES, HOME DECOR, MEN'S AND  WOMEN'S ACCESSORIES, MEN'S AND WOMEN'S WATCHE S, UMBRELLA, KID'S WEAR, MEN'S AND WOMEN'S  FOOTWEAR, BLANKETS, BED  SHEET, PILLOW COVER,  WOOLLEN WEAR, LADIES  HANDBAGS, RAKHI, BAG PACKS,  TOYS, BATHROOM FITTINGS, STATIONARY ITEMS, HARDWARE & T OOLS & BABY PRO DUCTS, BEAUTY AND  PERSONAL CARE, GROCERY AND FMCG 3888"
	},
	{
		"page": 41,
		"trademark": "Zeno Care",
		"details": "4430839    05/02/2020 WORKCELL SOLUTIONS PRIVATE LIMITED E-214-215, Eastern Business District, Neptune  Magnet Mall, LBS, Bhandup (W), Mumbai - 400078 Company Address for service in India/Attorney address: AASIM MEHDI SYED A-24/7, Road No.6, Parksite Colony, Vikhroli (W) Mumbai 400079 Proposed to be Used MUMBAI Advertising distribution, mar keting, wholesale and retail services of medici nal and pharmaceutical preparations, sanitary  preparation and wellness products  such as skin care, facial care,  personal care, food  and nutrition, retail sale of medicinal  and pharmaceutical goods incl uding on the inte rnet, excluding oxyg en concentrators. 3896"
	},
	{
		"page": 42,
		"trademark": "ShreeWorks",
		"details": "4439125    12/02/2020 GANESH NAIR Gat 21 Taleranwadi Khachi kesnand 412207 online selling Individual Proposed to be Used MUMBAI Online Marketing Of prod ucts and business services 3897"
	},
	{
		"page": 44,
		"trademark": "Maahi's",
		"details": "4442788    15/02/2020 PATEL NIKUNJKUMAR KANTIBHAI 44 Radhanagar Soc, New Sama Road, Vemali EME Vadodara Whole seller and Distributor of Spices and snacks Proprietor Proposed to be Used AHMEDABAD Wholesale services in relation to  foodstuffs, Wholesale  services relating to candy, Procur ement of goods on behalf of  other businesses, Wholesale services  relating to Chotolate, Whol esaler, Distributor Agent and  supplier of Spices, ready  made Snacks Packets (No Manufacturing) 3899"
	},
	{
		"page": 49,
		"trademark": "Deluxia",
		"details": "4513197    28/05/2020 SURESH VELJI GOTHI C-202, Poornima Vasant Utsav, Thakur Village, Ne ar Thakur College, Kandivali East, Mumbai - 400101 Individual Address for service in India/Attorney address: NADAR VENNILA C-102, Calypso, Bloomfield, Amit Enterprises Housing,Nr. Gold  Gym, NH-4, Mumbai-Bangalore Hi ghway,Sinhagad Road, Ambegaon  (BK), Pune-411 046  Proposed to be Used MUMBAI Computerized online retail store  services, Retail services featuring a  wide variety of consumer goods. 3904"
	},
	{
		"page": 50,
		"trademark": "JRG",
		"details": "4515684    31/05/2020 J R GROUP IN FRONT OF KOOL HOME APPARTMENT ,DALDAL SEONI ROAD,MOWA,RAIPUR 492007 Unregistered Proposed to be Used MUMBAI TRADING OF EARTHM OVING EQUIPMENT 3905"
	},
	{
		"page": 52,
		"trademark": "Bring IT to Life",
		"details": "4528929    12/06/2020 RAJESHWARI BHATTACHARYYA D-2 902, JUNIPER BUILDING, NEELKANTH GREE NS, MULLA BAUG, MANPADA, THANE (WEST) 400610 Proposed to be Used MUMBAI SERVICES RELATED TO BUSINESS CONSULTANCY FOR  INFORMATION TECHNOLOGY AND MARKETING RESEARCH  AND STUDIES FOR INFORMATION TECHNOLOGY 3907"
	},
	{
		"page": 54,
		"trademark": "BSS",
		"details": "4535854    18/06/2020 HUNGER INC HOSPITALITY PRIVATE LIMITED The Bombay Canteen, Process House, Kamala Mills, S.B. Marg, Lower Parel, Mumbai - 400013 Company Address for service in India/Attorney address: ABHISHEK MALHOTRA C 2/39, Safdarjung Develpment Area, New Delhi, 110016 Used Since :06/08/2018 MUMBAI Advertising, business manage ment, business administ ration, offi ce functions. 3909"
	},
	{
		"page": 59,
		"trademark": "WINPAR",
		"details": "4574393    18/07/2020 RAM NIWAS 3-V-44, Kudi Bhagatasani Housin g Board, Jodhpur, Rajasthan (342005) Proprietor of WINLIFE REMEDIES Address for service in India/Attorney address: MADHURI BHAGWANI 282-A, Sindhi-Colony, Rajapark, Jaipur Proposed to be Used AHMEDABAD ADVERTISING, BUSINESS M ANAGEMENT, BUSINESS ADMINIS TRATION, OFFICE FUNCTIONS, TRADING, IMPORT,  EXPORT OF ALL KINDS OF MEDICINE S, PHARMACEUTICAL PRO DUCTS AND ALL OTHER  SERVICES INCLUDED IN  CLASS-35 3914"
	},
	{
		"page": 70,
		"trademark": "KARVEER",
		"details": "4643410    06/09/2020 KARVEER CREATION C.S. No. 1716, Sushrisha Sadan Apartment, 7th Lane, Ra jarampuri, Kolhapur-416008, Maharashtra State, India Partnership Firm Address for service in India/Attorney address: ADV. TUSHAR KALE Witskeeper Incorporat ion, 129 Shukrawar Peth, B-1, Bhagyaprakalpa Used Since :05/05/1973 MUMBAI Business Management; Business Ad ministration; Office Func tions, In Particular Relating To Establ ishment And Operation  Of Licensing/Franchising; Organisat ional And Professional Bu siness Consultancy For  Franchisees An d Licensees;  Business Consultancy Relating To The Esta blishment And Operation Of  Franchises, Retail Servi ces, Trading, Marketing,  Import - Export, Wholesal ing, Advertising & Distribution Services In Re lation To Selling Of  Clothing, Leather And  Imitations Of Leather Fabrics, Readymade Garments, Accesso ries, Cosmetics And Goods And Providing Online Retail  Site For The Same 3925"
	},
	{
		"page": 75,
		"trademark": "FROSTY BADAM",
		"details": "4652036    11/09/2020 AMAR TILES SURVEY NO. 72, YEWALEWADI, KONDHWA B UDRUK, PUNE - 411048, MAHARASHTRA, INDIA PARTNERSHIP FIRM Address for service in India/Attorney address: SANDESH GOPAL ALHAT ROOM NO. B/6, SONANI NAGAR CHS, BEHIND PENINSULA  HOTEL, OPP GANESH TEMPLE, NEAR METRO STATION,  SAKINAKA, MUMBAI - 400072 Proposed to be Used MUMBAI ADVERTISING, BUSINESS M ANAGEMENT, BUSINESS ADMINIS TRATIONS, OFFICE FUNCTIO NS, PROMOTION, SALES,  MARKETING, ONLINE MARKETING 3930"
	},
	{
		"page": 77,
		"trademark": "SWARA GOLD",
		"details": "4652546    12/09/2020 GAURAV SANGHVI PROPRIETOR OF GAURAV TRADERS JEEN ROAD BADNAWAR 454660 NO Address for service in India/Attorney address: SHRI SAI ASSOCIATES 415, Onam Plaza, Old Palasia INDORE Proposed to be Used MUMBAI Advertising, marketing, sales  promotion, services of enabling customers to convenient ly view and purchase goods  provided by retail stores and  wholesale outlet related to Tea. 3932"
	},
	{
		"page": 79,
		"trademark": "KIRANA CHARZER",
		"details": "4654186    14/09/2020 M/S. CHARZERA TECH PRIVATE LIMITED NO.33/5 CHURCH ROAD, NARAYANA REDDY  LAYOUT, KONAPPANA AGRAHARA, BA NGALORE -560100, KARNATAKA,  INDIA PRIVATE LIMITED Address for service in India/Attorney address: LE INTELLIGENSIA NO.38/13, DESIGAR ST REET, VADAPALANI, CHENNAI Proposed to be Used CHENNAI WHOLESALE, RETAIL, IMPO RT, EXPORT, ONLINE SALE S AND SHOWROOM SALES OF CHARGING STATIONS FOR  ELECTRIC VEHICLES, MOBILE APPL ICATION SOFTWARE, SOFT WARE FOR SATE LLITE NAVIGATION SYSTEMS,  BATTERY CHARGING DEVICES FOR MOTOR VEHICLES, AUTOMOBILE SEAT  COVERS, AUTOMOB ILE TYRES,  AUTOMOBILE HORNS, AUTOMOBILE CHAI NS, AUTOMOBILE WINDSCREENS,  AUTOMOBILE BODI ES, AUTOMOBILE  BUMPERS, AUTOMOBILE SEATS, BRAKES FOR AUTOMOB ILES, GEARBOXES FOR AUT OMOBILES, TIRES FOR  AUTOMOBILE WHEELS, ARMR ESTS FOR AUTOMOBILE SEATS 3934"
	},
	{
		"page": 83,
		"trademark": "AMBICAFRESH",
		"details": "4661518    18/09/2020 MR. SAMEER KUNCOLIENKAR Ambica, BF1, Phase2, Malbhat, Margao, Goa-403601 Single Firm Address for service in India/Attorney address: LAW PROTECTOR Dhumal Nivas, Behind Kamla Nehru Hospital, Near Ba rane School, 104, Mangalwar peth, Pune - 411 011 Proposed to be Used MUMBAI FRANCHISE OF FOOD CHAIN 3938"
	},
	{
		"page": 92,
		"trademark": "GOGUD",
		"details": "4675037    26/09/2020 RAJ KUMAR TEKRIWAL trading as ;Divya Ambe Enterprises No.161, 1st Floor, Khader Sheriff Garden, 4th Cros s, Lalbagh Road, Bangalore – 560 027 (Karnataka) SERVICE PROVIDER Sole Proprietor Address for service in India/Attorney address: S.P.SINGH ADVOCATE D-322, THIRD FLOOR, RAJNIGANDHA APARTMENT, MAIN  G.T. ROAD, SAHIBAB AD, GHAZIABAD-201005, UP Proposed to be Used CHENNAI Retail & wholesale services re lating to flowers; online mar keting; computerized online reta il store services; online retail  store & department store retail services re lating to clothing, Men & Women apparels , cosmetics, gifts, handbags, jewelry,  luggage, toys, art materials, b aked goods, fabrics, foodstuffs , footwear, smartphones, smar t watches, Home Furnishing,  Bed sheet, Quilt, Pillow, Rain Coat, Um brella, Caps, Utensils, Food items - Gr ains and Packaged foods, Hardware and  Electricals; Online whole sale store services featuring statio nery supplies; retail services provided by department stores;  Sample distribution; distribu tion of samples; distribution  of goods for advertising  purposes; dist ribution and  dissemination of advertising mate rial; Business advice relating to  franchising; Advisory servi ces relating to the operation  of franchises; Business management advi sory services relating to  franchising; Business mana gement assistance in the  field of franchising; Busin ess management services relating to franchising;  Business advisory services relating to the  establishment and operation of franchises; Providing assistance in the field  of business management and product  commercialization within the fram ework of a franchise contract. 3947"
	},
	{
		"page": 96,
		"trademark": "INARI",
		"details": "4685758    03/10/2020 SAHIL THADANI S/O. SH. ISHWAR KUMAR J-89, GURU KRIPA, AP ARTMENT, ASHOK CHOW K, ADARSH NAGAR, JAWAHAR NAG AR, JAIPUR- 302004 RAJASTHAN Individual Address for service in India/Agents address: G. D. BANSAL & ASSOCIATES. M-118-B, MAHESH COLONY,  LAXMI MANDIR PHATAK, JAIP UR - 302 015. (RAJASTHAN) Proposed to be Used AHMEDABAD Wholesale services, Retail services,  Distribution of advertising  materials, online retail st ore services, Mail order retail  services. 3951"
	},
	{
		"page": 107,
		"trademark": "Nilkanth Gems",
		"details": "4714858    23/10/2020 KETANBHAI B. DHOLAKIA (HUF) AN INDIAN NATIONAL  KARTA OF KETAN BALWANTRAI DHOLAKIA HUF BHAGWATI CHOWK, MANEKPARA, AMRELI - 365601 Hindu Undivided Family Address for service in India/Agents address: DHRUVALKUMAR D. BALADHA DDB & Co.,605, Sanskar Height s, Nr. Umiya Circle, 150 Feet Ring Road, Rajkot-360004. Proposed to be Used AHMEDABAD SERVICE RELATED TO WHOLESALE,  RETAIL, IMPORT AND SHOWROOM OF GOLD JEWELL ERY, DIAMOND  JEWELLERY, PLATINUM JEWELLERY, SILVER JEWELL ERY, IMITATION JE WELLERY, JEWELLERY, AND JEWELLERY  MADE FROM SILVER IN CLASS 35. 3962"
	},
	{
		"page": 115,
		"trademark": "FATE OF THE PLANET",
		"details": "4724987    30/10/2020 MR. S. R. YUGADEEP M/S. FATE OF THE PLANET 30-327, OLD SAFILGUDA , SECUNDERABAD, HYDERABAD, TELANGANA Pin : 500056 proprietorship concern Address for service in India/Attorney address: KAUSTUBH ATHALYE 301 Mangalya CHS NEAR SBI BANK Gokhale Road Thane West Proposed to be Used CHENNAI E COMMERECE & ONLINE RETAIL STORE SERVICES; E CO MMERECE / RETAIL SERVICES CONNECTED TO PAPER,  CARDBOARD AND GOODS MADE FROM THESE MATERIAL S; STATIONERY,  FURNITURE,MI RRORS,PICTURE  FRAMES;GOODS OF  WOOD, CORK, REED, CANE, WICKER; HOUSEHOL D OR KITCHEN UTENSI LS AND CONTAINERS;  COMBS AND SPONGES; BRUSHES; ARTICLES FOR CL EANING PURPOSES; GL ASSWARE, PORCELAIN AND  EARTHENWARE; RAW FIBROUS  TEXTILE MATERIALS; TEXTILES AND TEXTILE GOODS; CLOTHING; FOOTWEAR;  ARTIFICIAL FLOWERS; F RUIT DRINKS AND FRUIT JUICES; SYRUPS  AND OTHER PREPARATIONS FOR MAKING  BEVERAGES; AGRICULTURAL, HORTICUL TURAL AND FORESTRY PRODUCTS;  FRESH FRUITS AND VEGETABLES;  SEEDS; NATURAL PLANTS AND FLOWERS; COFFEE; TEA; CO COA; SUGAR; RICE; TAP IOCA; SAGO; ARTIFICIAL  COFFEE; FLOUR AND PREPARATIO NS MADE FROM CEREAL S, BREAD, PASTRY AND CO NFECTIONERY; HONEY,  TREACLE; YEAST, BAKING POWDER;  SALT, MUSTARD;VINEGAR,  SAUCES, (CONDIMENTS);  SPICES; PR ESERVED,  DRIED AND COOKED FRUITS AND VEGETABL ES; JELLIES; JAMS; FRUIT SAUCES;  MILK AND MILK PRODUCTS; EDIBLE  OILS AND FATS; GAMES AND PLAYTHINGS; DECORATIONS FOR CHRISTMAS TREES; CARPETS, RUGS, MATS AND  MATTING, LINOLEUM AND OTHER MATE RIALS FOR COVERING EXI STING FLOORS; WALL  HANGINGS(NON-TEXTILE) 3970"
	},
	{
		"page": 119,
		"trademark": "EXTRA SURE",
		"details": "4729180    03/11/2020 M. D. HYGIENE PVT. LTD. BLOCK NO. 959, NEAR RAMOJI FOOD , KIM MANDVI ROAD, VILLAGE TADK ESHWAR, MANDVI, SURAT-394170,  GUJARAT. A COMPANY INCORPORATED UNDER TH E INDIAN COMPANIES ACT, 2013 Address for service in India/Attorney address: KAUSHIKCHANDRA AMBALAL BAROT COPYHART, 11 SHUKAN FLAT, NEAR KUM KUM SCHO OL, UTTAMNAGAR, MANINAGAR, AHMEDABAD 380008  (GUJARAT) INDIA. Used Since :27/01/2019 AHMEDABAD RETAIL OR WHOLESALE SERVICES FOR  SANITARY PADS, BABY DIAP ERS, SANITARY NAPKINS , SANITARY TAMPONS,  SANITARY TOWELS, SANIT ARY PREPARATIONS FOR PERSONAL HYGIENE,  OTHER THAN TOILET RIES, SANITARY  PREPARATIONS FOR VETERINARY  PURPOSES, SANITARY  PREPARATIONS FOR MEDICAL  PURPOSES, MEDICATED  PRE-MOISTENED WIPES, ADULT DIAPERS. 3974"
	},
	{
		"page": 130,
		"trademark": "Saf G",
		"details": "4746314    17/11/2020 MOHAMMED SHAFI P K PALAKKAVALAPPIL HOUSE,CHEK ANOOR,MUDUR,VATTAMKULAM-679578 Individual Address for service in India/Attorney address: ISMAIL ARIF CHITTENGADAN Room no. 60/3874,2nd Floor,Salim Building,Nea r Kalyan Kendra,Chintha Valappu,Calicut,Kerala Proposed to be Used CHENNAI WHOLE SALING,RETAILING,  IMPORTING AND EXPORTING OF ALL KIND S OF ELECTRONIC,ELECTRICAL AND IT  GDGETS, APPLIANCES,PHONES AND  SMART PHONES AND SMART WTCHES, CCTV, HOME AP PLIANCES AND  ACCESSORIES THEREOF. subject to the mark should be use as represented. 3985"
	},
	{
		"page": 132,
		"trademark": "SHREE GOVIND SHRINGAR KENDRA",
		"details": "4749888    19/11/2020 SANJEEV KUMAR S/O  SHRI HARISH CHAND WARD NO.-2,POLICE THANE KE PEECHE, GOVI ND COLONY,KHATUSHYAMJI SIKAR-332602 RAJASTHAN Individual Address for service in India/Agents address: G. D. BANSAL & ASSOCIATES. M-118-B, MAHESH COLONY,  LAXMI MANDIR PHATAK, JAIP UR - 302 015. (RAJASTHAN) Proposed to be Used AHMEDABAD WHOLESALE SERVICES,RETAIL SERVICES,DISTRIBUTION  OF ADVERTISING MATERIALS,ONLINE RETAIL STORE  SERVICES 3987"
	},
	{
		"page": 133,
		"trademark": "AMEYA",
		"details": "4751489    21/11/2020 KALYAN JEWELLERS INDIA LIMITED TC 32/204/2 Sitaram Mill Road, Punkunnam, Trissur, 680002 Body Incorporate Address for service in India/Attorney address: ALTACIT GLOBAL SHED NO. C2-A, THIRU-VI-KA INDUSTRIA L ESTATE, GUINDY, CHENNAI - 600 032. Used Since :15/10/2020 CHENNAI Retail stores; Retail and Wholesale dist ribution, Import, Export of jeweller y, precious stones,  Platinum, Diamond  Jewellery, pearl Jewellery, Go ld Jewellery, Silver, Rough Precious Stones,  Jewellery of precious stones, Gemstones;  Goods made of precious metals,  stones & alloys, Advertising se rvices relating to jewellery 3988"
	},
	{
		"page": 136,
		"trademark": "NOVEX WARE",
		"details": "4758817    27/11/2020 NOVEX CERAMIC VAGADIYA ROAD, THANGADH, GUJARAT PARTNERSHIP FIRM Address for service in India/Attorney address: NAVDEEP & ASSOCIATES B - 13, NEW YOGESHWAR SOCIETY, NR. PARAS PRABHU SO CIETY, OPP. VISHAL NAGAR, ISANPUR, AHMEDABAD -  382443, GUJARAT Proposed to be Used AHMEDABAD SERVICES RELATED TO SHOWROOM OF WHOLESALER, RETAILER, IMPORTER, EXPORTER, DISTRIBUTOR,  MARKETING OF SANITARYWARE PR ODUCTS, WATER SUPPLY, CERAMIC  PRODUCTS INCLUDED IN CLASS 35 3991"
	},
	{
		"page": 138,
		"trademark": "LLOYD",
		"details": "4767368    03/12/2020 E.LAND WORLD LTD. (A KOREAN COMPANY ORGANISED AND  EXISTING UNDER THE LAWS OF REPUBLIC OF KOREA) (SOUTH KOREA). 77, Seogang-ro, Mapo-gu, Seoul, Korea, Republic of Korea (South Korea). Service Provider Address for service in India/Agents address: D. SEN & CO 6, OLD POST OFFICE STREET, GROUND FLOOR, KOLKATA 700 001. Proposed to be Used KOLKATA RETAIL STORE SERVICES FEATURING ACCESSORIES OF PR ECIOUS METAL, RETAIL  STORE SERVICES FEATURING  CLOCKS, RETAIL STORE SERVICES FEAT URING WATCH, RETAIL STORE SERVIC ES FEATURING CL OTHING, RETAIL  STORE SERVICES FEATURING SHOES, RETAIL STORE SERVICES FEATURING CAPS (HEADWEAR), RETAIL STORE  SERVICES FEATURING SUNGLASSES THIS IS SUBJECT TO ASSOCIATION WITH RE GISTERED/PENDING RE GISTRATION NO. 2942917 , 2942915. 3993"
	},
	{
		"page": 140,
		"trademark": "VELLY SYNTHETICS",
		"details": "4784855    17/12/2020 VELLY SYNTHETICS 201, 2ND FLOOR, KUBERJI PLAZA, RING ROAD, SURAT-395002, GUJARAT Partnership Firm Address for service in India/Attorney address: TMC INTELLECTUAL SERVICES B-501, Prestige Manor, Opp. Regent  Residency, Near Pratham Circle, Madhuvan Circle  Lane, Pal, Surat-395009 Used Since :01/04/2008 AHMEDABAD Import, export, wholesale, retail  and online services feat uring textiles and substitutes for  textiles, cloth, embroidery, lace,   saree fall (a length of matching fabric  sown onto the bottom-inside edge of a sar i); organization of  exhibitions and events  for commercial or ad vertising purposes. THIS IS SUBJECT TO ASSOCIATION WITH  REGISTERED/PENDING  REGISTRATIO N NO..3172873.. 3995"
	},
	{
		"page": 141,
		"trademark": "STUTI",
		"details": "4790095    22/12/2020 JIGNESHBHAI HARGOVIND HINGALADIA 154, ASHA NAGAR, BEHIND HARI NAGAR, UDHANA SURAT - 394210, GUJARAT Individual Address for service in India/Attorney address: TMC INTELLECTUAL SERVICES First Floor, Aaradhna Building, Near Karnataka  Bank,Hiramodi Sheri, Udhna Darwaja, Surat - 395002 Used Since :01/04/2005 AHMEDABAD Wholesale, retail, import, export  and online services featuring food  and beverages; the bringing  together, for the benefit of  others, of a variety of goods, excludin g the transport thereof, en abling customers to conven iently view and purchase  those goods; organizati on of exhibitions and events for  commercial or advertising purposes. 3996"
	},
	{
		"page": 148,
		"trademark": "MALHAR",
		"details": "4794067    24/12/2020 DASRATHBHAI PRABHUBHAI PATEL 36-A, SHOP NO. 10-11, MALH AR COMPLEX, DUMAS ROAD, IC HHANATH, SURAT- 395007, GUJARAT Proprietor of MALHAR TRADING Address for service in India/Attorney address: UPENDRA PATEL UPENDRA PATEL & ASSOCIATES, 63/A, 6TH FLOOR, MAHE R PARK-A, ATHWAGATE, NAN PURA, SURAT - 395 001 -  GUJARAT Used Since :27/09/2006 AHMEDABAD RETAIL AND WHOLESALE SERVICES  FOR GRAINS, PLUSES, DRY  FRUITS, TINNED AND DR IED PRODUCTS, BAKERY  PRODUCTS, ESSENTIAL OILS, NAMKE EN, SOAPS, DETERGENTS, COSMET ICS, TOILETRIES, GROCERIES AND  PROVISIONAL ITEMS 4003"
	},
	{
		"page": 152,
		"trademark": "A&Z",
		"details": "4799733    29/12/2020 ASMITABEN JITENDRABHAI DHAMELIYA 114, 1ST FLOOR, AVLONE BUSINESS HUB, NEAR ANKUR  SCHOOL, AMBATALAVADI-VED ROAD, KATARGAM, SURAT- 395008, GUJARAT Individual Address for service in India/Attorney address: TMC INTELLECTUAL SERVICES B-501, Prestige Manor, Opp. Regent  Residency, Near Pratham Circle, Madhuvan Circle  Lane, Pal, Surat-395009 Proposed to be Used AHMEDABAD Import, export, wholesale, retail  and online services featuring yar ns and threads for textile use,  textiles and substitutes for   textiles, cloth, ready-to-wear clothi ng, sarees, dresses, women's wear, dupatta  (scarf), stoles, headwear, footwear,  embroidery, lace, elastic ribbons, saree fa ll (a length of matching fabric sown onto the bottom-inside edge of a sari);  organization of exhibitions and events  for commercial or advertising purposes. 4007"
	},
	{
		"page": 154,
		"trademark": "SANSKAR",
		"details": "4802398    31/12/2020 SANSKAR TEX PRINTS PRIVATE LIMITED SHOP NO-5005 PANEL-19 PASSAGE NO-1 RRTM VILLAGE: S AROLI TALUKA: CHORASI, SURAT-395010 GUJARAT INDIA A COMPANY INCORPORATED UNDER THE COMPANIES ACT Address for service in India/Attorney address: TMC INTELLECTUAL SERVICES B-501, Prestige Manor, Opp. Regent  Residency, Near Pratham Circle, Madhuvan Circle  Lane, Pal, Surat-395009 Used Since :31/07/2014 AHMEDABAD Import, export, wholesale, retail  and online services featuring yar ns and threads for textile use,  textiles and substitutes for   textiles, cloth, ready-to-wear clothi ng, sarees, dresses, women's wear, dupatta  (scarf), stoles, headwear, footwear,  embroidery, lace, elastic ribbons, saree fa ll (a length of matching fabric sown onto the bottom-inside edge of a sari);  organization of exhibitions and events  for commercial or advertising purposes. THIS IS SUBJECT TO ASSOCIATION WITH  REGISTERED/PENDING  REGISTRATIO N NO..3422582. 4009"
	},
	{
		"page": 166,
		"trademark": "VAIBHAV LIFESTYLE LTD",
		"details": "4814338    09/01/2021 VAIBHAV LIFESTYLE LIMITED K-6B, Fateh Tiba, Adarsh Nagar, Jaipur-302004, Rajasthan COMPANY Address for service in India/Attorney address: MAYUR SANGHI 301, II FLOOR, EMPIRE REGENCY, A19, PANCHSHEEL COLONY, AJMER  ROAD, JAIPUR-302019 Proposed to be Used AHMEDABAD ADVERTISING; BUSINESS MANAGEMENT; BUSINESS  ADMINISTRATION; OFFI CE FUNCTIONS; BUSINESS  INTERMEDIARY SERV ICES FOR THE SALE AND PURCHASE OF G OODS AND SERVICES; AUCTION SERVICES;  CLASSIFIED ADVERTISING SERVICES;  MAIL ORDER SALES; RETAIL STORE SERVICES; RETAIL SALE SERVICES  PROVIDED BY MEANS OF A GLO BAL COMPUTER NETWORK; SALES  PROMOTION FOR OTHERS; BUSINESS  INFORMATION SERVICES ; RETAIL DEPARTMENT STORES; RETAIL  ON-LINE DEPARTMENT STORES; RETAIL  CONVENIENCE STORES; RETAIL ON-LINE CONVENIENCE ST ORES; COMPUTERIZED ON-L INE ORDERING FEATURING  GENERAL MERCHANDISE AND GENERAL CONS UMER GOODS; PROVIDING AN ON -LINE COMMERCIAL INFORMATION  DIRECTORY; PROVIDING A SEARCHABLE DATABASE IN THE  FIELD OF BUSINESS INFORM ATION AVAILABLE VIA A  GLOBAL COMPUTER NETWORK; DISSE MINATION OF ADVERTISING FOR OTHE RS VIA AN ON-LINE ELECTRONIC  COMMUNICATIONS NETWORK; PROV IDING A SEARCHABLE ON-LINE DATABASE  FEATURING GOODS AND SERVICES  OF OTHERS; PROVIDING A SEARCHABLE ON-LINE ADVERTISI NG GUIDE FEATURING THE GOODS AND SERVICES OF  OTHER ON-LINE VENDORS; DATABASE MANAGEMENT SERVICES; COMPUTER SERVICES, NAMELY, PROVIDING  DIRECTORIES FOR TELEPHONE NUMBERS, BUSINESS  ADDRESSES, ELECTRONIC MA IL ADDRESSES, NETWORK  HOME PAGE ADDRESSES,  ADDRESSES AND TELEPHONE NUMBER OF PEOP LE, PLACES, AND ORGANIZATIONS;  DATA STORAGE AND RETRIEVAL SERVICES FOR TRANS MITTING, DISPLAYING  AND STORING TRANSACTION,  IDENTIFICATION AND FINANCIAL INFORM ATION; ON-LINE RETAIL AND WHOLESA LE DISTRIBUTORSH IP SERVICES  FEATURING GENERAL ME RCHANDISE AND GENERAL CONSUMER GOOD S; AUTOMATED AND COMPUTERIZED  TRADING SERVICES; ON-LINE TRADING SERVICES; INFO RMATION SERVICES, NAMELY,  PROVIDING INFORMATION  ABOUT RETAIL PRODUCTS TO CUSTOMERS , FEATURING THE AVAILABILITY OF  SPECIFIC PRODUCTS OF INTEREST  TO THEM; ONLINE BUSINESS INFO RMATION SERVICES, NAME LY ANALYZING AN INDIVI DUAL\"S PREFERENCES AND  PROVIDING PRODUCT REVIEWS AND  RECOMMENDATIONS; AUCTIONEERING; AUTOMATED AND COMPUTERIZED  TRADING OF GOODS AND SERVICES FOR OTHERS PROVIDED OVER A GLO BAL COMMUNICATION INFORMATION  NETWORK. THIS IS SUBJECT TO ASSOCIATION WITH REGI STERED/PENDING REGIST RATION NO..4814336, 4814337. THE  GOODS/SERVICES FOR SALE /CONDUCT IN THE STATES OF Rajasthan.. 4021"
	},
	{
		"page": 170,
		"trademark": "Digital Shoppy",
		"details": "4817442    12/01/2021 DIGITAL SHOPPY NEWCOM LIMITED FLAT NO106, FRIZBI DATTA APARTMENTS, YELLAREDDYGUDA, HYDERABAD- 500073, TELANGANA, INDIA. Limited Company Address for service in India/Attorney address: PUVVULA VINAY KUMAR Eeva IP & IT Services Pvt Ltd, 1st Floor, HIG 139, Bh arat Nagar Colony, Moosapet, Hyderabad - 500018, Telangana Used Since :26/04/2018 CHENNAI E-COMMERCE, RETAILS BUSINESS OF CONSUMER ELECTR ONICS AND HEALTH CARE PRODUCTS INCLUDED IN  CLASS 35. 4025"
	},
	{
		"page": 171,
		"trademark": "FRESHOPPE",
		"details": "4818254    13/01/2021 MR.SIDDIQUE O H Gonnikopp Road,Virajpet Town,Kodagu District,Karnataka SOLE PROPRIETOR Address for service in India/Attorney address: V.U. BINDHU, T.R. TARA, ADVOCATES, NO. 152, IV FLOOR, THAMBU CHETTY STREET, PARRYS, CHENNAI - 600 001. Proposed to be Used CHENNAI ONLINE BUSINESS /E-COMME RCE PLATFORM ,BUSINESS AD MINISTRATION AND MANAGEMENT 4026"
	},
	{
		"page": 179,
		"trademark": "Foot Star",
		"details": "4821048    15/01/2021 V RETAIL PRIVATE LIMITED SILPA SUMMIT, Ground Floor, Plot No. 187, in Sy.No. 50  (P), Behind MAX Store,  Gachibowli, Hyderabad–500032 Body Incorporate Address for service in India/Attorney address: MAKYAM KALPANA NAVEEN C/O.I-WIN IP SERVICES, Flat No.202,  SriSivaRamakrishna Mansion, Above  SBI BANK, Kamalaprasana Nagar,Allwyn  Colony,Kukatpally, Hyderabad-72,Telangana, Used Since :18/07/2014 CHENNAI Business and commercial administration, sales administration, online and retail trad ing, Advertisement, showroom  services related to footgear and headgears. 4034"
	},
	{
		"page": 180,
		"trademark": "Doggiliciouus Meals",
		"details": "4822064    16/01/2021 DOGGIELLICIOUS LLP I - 604, Rohan Jharoka, Kempapura main rd, Yamlur, Bangalore, 560037 Limited Liability Partnership(LLP) Address for service in India/Agents address: GIGI JOSEPH K J 48, Opp. Kendriya Sadan,100 Ft Road, Koramangala,Bangalore-560034. Used Since :04/04/2017 CHENNAI On-line retail store services featuring  foodstuffs,Advertising; Bu siness management; Busin ess administration; Office  functions 4035"
	},
	{
		"page": 182,
		"trademark": "PARIIMAL BIOTECH",
		"details": "4822381    16/01/2021 PARIMALA.S PROP. OF PARIIMAL BIOTECH TAMBARAM EAST, CHENNAI-59 PROP. Address for service in India/Attorney address: TMR SOLUTIONS M-10, ANUPAM BHAWAN COMMERCIAL COMPLEX, AZADPUR, DELHI-110033. Proposed to be Used CHENNAI TRADING OF MEDICI NAL AND PHARMACEUTICAL PREPARATIONS. The mark should be  used as a whole. 4037"
	},
	{
		"page": 185,
		"trademark": "VINEESHA PHARMA",
		"details": "4823375    16/01/2021 SUNKESULA MASTHAN VALI #11-175-2, GOURAV HOMES, 7th CROSS,  K.K. COLONY ANANTAPUR • 515001 AN INDIVIDUAL Address for service in India/Attorney address: M.R.VINOTH PRABHU No.27, Putheri Karai Street, Velachery, Chennai-600042. Proposed to be Used CHENNAI MARKETING, DISTRIBUTION, ADVERTISING, OFFICE FUNCTIONS , RETAILING RELATED TO PHARMACEUTICAL &  MEDICINAL PREPARATIONS accepted only for the services MARKET ING, DISTRIBUTION, ADVER TISING, OFFICE FUNCTIONS, RETAILING RELATED  TO PHARMACEUTICAL & MEDICINAL  PREPARATIONS for the state of  Andhra Pradesh  and TELANGANA. 4040"
	},
	{
		"page": 203,
		"trademark": "GBOYS",
		"details": "4835828    26/01/2021 A.JITENDRA SINGH S/O DHANNA RAM PROPRIETOR OF M/S N.P EXPORTS #9, Dhairye Complex, 1st Floor, J.M Lane , 2nd Cross, Balepet, Bangalore – 560 053. N.P Exports Address for service in India/Attorney address: N SATISH REDDY #22, 4th Cross, Rajiv Gandhi Road, Naidu La yout, Jaraganahalli, J.P Nagar 6th Phas e, Bangalore - 560 078, Karnataka, India. Used Since :03/04/2017 CHENNAI Advertising, Business Management, Business  Administration, Office Functions, Online Mar keting with respect to Trading,  Wholesaling, Retailing, Exporting and impo rting of Ready-Made Clothing/Garments. accepted for the states of South India. 4058"
	},
	{
		"page": 207,
		"trademark": "Enrich OD",
		"details": "4837983    28/01/2021 LIFE N-RICH PHARMA PRIVATE LIMITED D.NO. 32-2-71/A, K.M AGRAHARAM VILLAGE,  PUTTUR, CHITTOOR-517571,  ANDHRA PRADESH, INDIA AN INDIAN NATIONAL Address for service in India/Attorney address: ADHI LEGAL SOLUTIONS OLD NO:4/2,NEW NO:9/2, ARMENIAN STREET,  2ND FLOOR, PARRYS, CHENNAI-600 001, INDIA Proposed to be Used CHENNAI WHOLESALE, RETAIL SALE, MARKETING , ONLINE WHOLESALES STOR E, ONLINE RETAIL SALES STORE, IMPORT AND  EXPORT FOR PHARMACEUTICAL AND VETERINARY PREPARAT IONS; SANITARY PREPARATIONS FOR MEDICAL  PURPOSES; DIETETIC SUBSTANCES ADAP TED FOR MEDICAL USE,  FOOD FOR BABIES; PLAS TERS, MATERIALS FOR  DRESSINGS; MATERIAL FOR STOPPING TEETH, DENTAL  WAX; DISINFECTANTS; PREPARATIONS FOR DESTROYING  VERMIN; FUNGICIDES, HERBICIDES 4062"
	},
	{
		"page": 208,
		"trademark": "Omeerich D",
		"details": "4837984    28/01/2021 LIFE N-RICH PHARMA PRIVATE LIMITED D.NO. 32-2-71/A, K.M AGRAHARAM VILLAGE,  PUTTUR, CHITTOOR-517571,  ANDHRA PRADESH, INDIA AN INDIAN NATIONAL Address for service in India/Attorney address: ADHI LEGAL SOLUTIONS OLD NO:4/2,NEW NO:9/2, ARMENIAN STREET,  2ND FLOOR, PARRYS, CHENNAI-600 001, INDIA Proposed to be Used CHENNAI WHOLESALE, RETAIL SALE, MARKETING , ONLINE WHOLESALES STOR E, ONLINE RETAIL SALES STORE, IMPORT AND  EXPORT FOR PHARMACEUTICAL AND VETERINARY PREPARAT IONS; SANITARY PREPARATIONS FOR MEDICAL  PURPOSES; DIETETIC SUBSTANCES ADAP TED FOR MEDICAL USE,  FOOD FOR BABIES; PLAS TERS, MATERIALS FOR  DRESSINGS; MATERIAL FOR STOPPING TEETH, DENTAL  WAX; DISINFECTANTS; PREPARATIONS FOR DESTROYING  VERMIN; FUNGICIDES, HERBICIDES 4063"
	},
	{
		"page": 209,
		"trademark": "Richmont Lc",
		"details": "4837986    28/01/2021 LIFE N-RICH PHARMA PRIVATE LIMITED D.NO. 32-2-71/A, K.M AGRAHARAM VILLAGE,  PUTTUR, CHITTOOR-517571,  ANDHRA PRADESH, INDIA AN INDIAN NATIONAL Address for service in India/Attorney address: ADHI LEGAL SOLUTIONS OLD NO:4/2,NEW NO:9/2, ARMENIAN STREET,  2ND FLOOR, PARRYS, CHENNAI-600 001, INDIA Proposed to be Used CHENNAI WHOLESALE, RETAIL SALE, MARKETING , ONLINE WHOLESALES STOR E, ONLINE RETAIL SALES STORE, IMPORT AND  EXPORT FOR PHARMACEUTICAL AND VETERINARY PREPARAT IONS; SANITARY PREPARATIONS FOR MEDICAL  PURPOSES; DIETETIC SUBSTANCES ADAP TED FOR MEDICAL USE,  FOOD FOR BABIES; PLAS TERS, MATERIALS FOR  DRESSINGS; MATERIAL FOR STOPPING TEETH, DENTAL  WAX; DISINFECTANTS; PREPARATIONS FOR DESTROYING  VERMIN; FUNGICIDES, HERBICIDES 4064"
	},
	{
		"page": 212,
		"trademark": "STAPLE STATION",
		"details": "4840221    29/01/2021 M/S. STAPLE STATION H.No:12-1558/A/7, SYEDALIGUDA, MURADNAGA& ASIFNA GAR, HUMAYUNNAGAR, HYDERABAD, 5OOO28, INDIA REGISTERED PARTNERSHIP FIRM Address for service in India/Attorney address: ALI HYDER IMAM 403, imams.ca, MAH Manor, (besides masab tank bus stop ), Banjara Hills road, Masab Tank, Hyderabad - 500028. Used Since :18/09/2020 CHENNAI TRADING OF BASMATI RICE 4067"
	},
	{
		"page": 215,
		"trademark": "CLEANHOME",
		"details": "4841251    30/01/2021 CLEANHOME HOUSEHOLD INC 13850 NE BEL RED RD, BELLEVUE, WA 98005-4520 USA AS PER THE COUNTRY LAW Address for service in India/Attorney address: N.R.SRINATH NO.38, ADITHANAR SALAI , PUDUPET, CHENNAI- 600 002 Proposed to be Used CHENNAI advertising, shop window dressing, orga nization of exh ibitions for commercial or ad vertising purposes, commercial  administration of the licensi ng of the goods and services of others, impo rt-export agency services, sales promotion for  others, personnel management consultancy, systemization  of information into comp uter databases, accounting,  sponsorship search, Online adverti sing on a computer network. 4070"
	},
	{
		"page": 216,
		"trademark": "DELIGHT BIOPHARMA PVT. LTD",
		"details": "4841890    30/01/2021 DELIGHT BIOPHARMA PVT. LTD No. 11-10-255/2, 2nd Floor, Vijayapuri Colony, Road No.2, Street  No.7, Kothapet, Saroornagar, Ranga Reddy, Telangana, India PRIVATE LIMITED Address for service in India/Attorney address: ALEXIUS IP ATTORNEYS H.No 3-6-290,G-20,AZIZ TOWERS,HIMAYAT  NAGAR,HYDERABAD-500029,TELANGANA,INDIA Used Since :10/11/2017 CHENNAI Sales and promotions, Export  and import of Medicinal and Pharmaceutical  preparations, Business management, Office  functions. 4071"
	},
	{
		"page": 217,
		"trademark": "VniQ",
		"details": "4842862    01/02/2021 NIKET MANOJBHAI GHADIYA TRADING AS M/S. VISHWAS ENTERPRISE 70 SAHJANAND BUSINESSES PARK, OPP.  PLAM HOTEL BEHIND MARUTINANDAN  RESTAURANTS SP RING ROAD,  NIKOL, AHMEDABAD, GUJARAT -382350 PROPRIETORSHIP Address for service in India/Agents address: KRUNAL VINUBHAI HIRAPARA 426-427, Town Plaza, Nr. Raspan Arcade, Opp. Andhr a Bank,New Naroda, Nikol,  Ahmedabadt-382350, Gujarat Proposed to be Used AHMEDABAD Advertising, business manage ment, business administ ration, offi ce functions 4072"
	},
	{
		"page": 220,
		"trademark": "MANIYAR",
		"details": "4846753    03/02/2021 Mr. MOHAMMED OMER Trading as M/S MANIYAR RETAIL 21-3-809, CHELAPURA, MURGHA CHOWK MASJID, KAS ARATTA, CHARMINAR, HYDERABAD - 500002, TELANGANA,  INDIA Proprietor Address for service in India/Attorney address: ALI HYDER IMAM 403, imams.ca, MAH Manor, (besides masab tank bus stop ), Banjara Hills road, Masab Tank, Hyderabad - 500028. Used Since :01/01/2019 CHENNAI TRADING, WHOLESALE AND RETAIL  OF JEWELLERY, APPARE L AND FASHION ACCESSORIES accepted for the states Andh ra Pradesh and TELANGANA. 4075"
	},
	{
		"page": 236,
		"trademark": "JOLO BY UNACADEMY",
		"details": "4852697    06/02/2021 ONO LABS PRIVATE LIMITED 45/1 RHB Colony, Mahadevpura Post, Bangalore 560048 Body Incorporate Address for service in India/Attorney address: ASHIMA CHALIA EDIPLIS COUNSELS, G1 (Ground Floor), Buil ding No. 1542/A, 28th Cross, 28th Main , Banashankari 2nd Stage Bangalore 560070  Proposed to be Used CHENNAI Advertising; business management, organi zation and administration ; office functions; Career  advancement consulting  services; Information services relating to  jobs and career opportunities; Providi ng information relati ng to employment  recruitment; Providing employment  information via a glob al computer network; Employment  hiring, recrui ting, placement,  staffing and career networking services; Career networking services;  Career counseling [e mployment advice and  information]; Employment recruiting services; Personnel management and employment consultancy;  Providing academic  course administration services relating to  on-line course registration; Providing academic cour se administration services  for academic institutions; Interviewing  services for personnel recruitment; Psych ological testing fo r the selection of  personnel; Psychometric testing  for the selection of personnel 4091"
	},
	{
		"page": 248,
		"trademark": "NEODAWN GLOBAL HEALTHCARE",
		"details": "4876323    23/02/2021 JAGDISH NAMDEV ASWANI TRADING AS  M/S. NEODAWN GLOBAL HEALTHCARE 52, F-WARD, KUBERNAGAR, AHME DABAD-382 340 GUJARAT. INDIA. A SOLE PROPRIETOR Address for service in India/Attorney address: D. C. DANI & ASSOCIATES 908, SUKH SAGAR COMPLEX, NEAR HOTEL FORTUNE LANDMARK, ASH RAM ROAD, USMANP URA, AHMEDABAD-380  013. GUJARAT. INDIA. Used Since :08/03/2013 AHMEDABAD SERVICES OF RETAIL AND WHOLESALE OUTLETS, RETAIL AND WHOLESAL E AND SEMI WHOLESALE BUSINESS AND  SERVICES OF DISTRIBUTION, MARKETI NG AND TRADING RELATING TO PHARM ACEUTICALS, MEDI CINAL, AYURVEDIC  PREPARATIONS, DIETARY SUPPLEMENTS , NUTRITIONAL SUPPLEMENTS AND CO SMETICS INCLUDED IN CLASS-35 4103"
	},
	{
		"page": 255,
		"trademark": "RK family store",
		"details": "5095505    19/08/2021 MRS. BIMLA MODI TRADING AS RADHA KESHAV TEXTILES 2-11-5 Vulli Veedhi Vizianagaram  -535001, Andhra Pradesh, India Sole proprietor Address for service in India/Agents address: ANAND AND ANAND FLAT NO. GA, AR VILLA, 31, III MAIN RO AD, GANDHI NAGAR, ADAYAR, CHENNAI 600 020 Used Since :06/01/2003 CHENNAI Retail and Wholesale and online services;  Wholesale, retail and online services f eaturing clothing; Online retail store  services featuring cosmetic and beauty  products, clothing and  accessories, Computerized online wholesale and retail  store services, Comparison shop ping services, Retail Services Relating To Co okware And Kitchen Needs, Retail Services  Relating To Cutlery, Retail services f eaturing a wide variety of consumer  goods, Retail Shop  Window Display  Arrangement Services; Demonstration Of  Goods, Customer relationship manage ment; the bringing  together, for the  benefit of others, of a variety of goods and services, enabli ng customers to conveniently  view and purchase those goods  by retail stores, wholesale outl ets, through vending m achines, mail order catalogues or by means  of electronic media,  through web sites or televi sion shopping prog rammes; Inventory management  services; Advertising; Business  management; Business administration;  Office functions; On- line ordering services; Admi nistrative processing of  computerized purchase orders; on-line and e-commerce  trading services to facilitate the sale of goods by others via a  computer network; Organization of exhibitions for commerc ial or advertising purposes;  Commercial intermediation  services; Providing bu siness information via a web site; Publicity  and sales promotion servi ces; Search engine  optimization for sales promotion; Mana gement and compilat ion of computerized datab ases; Promoting the goods and  services of others; Sales promotion customer loyalty prog rams including thro ugh discounted sales; Organisation of  customer loyalty programs for commercial, promotional or  advertising purposes;  administration of loyalty programmes  involving discounts or incentives; Business intermediary and advisory services;  auction services; classi fied advertising  services; mail order sales; retail store  services; retail sale services provided by  means of a global computer network. THIS IS SUBJECT TO ASSOCIATION WITH  REGISTERED/PENDING  REGISTRATIO N NO..4762799. 4110"
	},
	{
		"page": 257,
		"trademark": "G-FAT",
		"details": "5112004    31/08/2021 GAGANDEEP SINGH trading as ;G.M.S. SALES (INDIA) 233/180, LACHMAN NAGAR, ST. NO. 4,  MILLER GANJ, LUDHIANA (PB) Service provider PROPRIETORSHIP Address for service in India/Attorney address: MAHTTA & CO 43-B/3, UDHAM SINGH NAGAR, LUDHIANA. 141001 (PUNJAB) Used Since :01/01/2017 DELHI Advertising, Business Administ ration and Management of wholesale & Reta il outlets; Trading, Marketing, Online  Marketing, Import & Exports re lating to Cycles, Bicycl es, Cycle rims, Cycle stands, Cycl e wheels, Cycle mu dguards, Cycle  frames, Cycle brakes, Cycle chains,Cycle ti res, Cycle handlebars & Cycle tyres. 4112"
	},
	{
		"page": 270,
		"trademark": "fRut",
		"details": "5154682    30/09/2021 AADITYA PRITHVIRAJ SHAH 401,VARDHAMAN ESTATE, A WING, CH IVDA GALLI, DR. B  A ROAD, LALBAUG, PAREL, MUMBAI 400012 Proprietor Proposed to be Used MUMBAI retail services in connect ion with consumer electronic  devices such as cable and chargers for mobile phones, HDMI  cable, Earphones, Wireless ear phone and Headphones, Blueto oth speakers, sound bars (lou dspeakers), laptop chargers,  car audio, wifi speakers  and their parts thereof 4125"
	},
	{
		"page": 273,
		"trademark": "AARAM PAARAM",
		"details": "5155945    30/09/2021 RAMANAND ENTERPRISES INDIA PVT. LTD. 13-14, Baraghat Industrial Area, Vick y Factory Chouraha, Gwalior (M.P.) Private Limited Company Address for service in India/Agents address: J.P. ASSOCIATES ADVOCATE. 320 - Tulsi Vihar, Near S.B.I. Zonal Offi ce, City Centre, Gwalior -474 011 (M.P.). Proposed to be Used MUMBAI ADVERTISING; BUSINESS MANAGEMENT;  BUSINESS ADMINISTRAT ION; OFFICE  FUNCTIONS; MARKETING; RETAIL  SERVICES IN RESPECT TO SHOES, MOCCASIN, CHAPPAL, SANDAL, SLEEPERS, BELLY, L ADIES, GENTS & CHILDREN  SHOES AND SPORTS SHOES, FOOTWEAR MATERIAL MADE OF PVC, PU, EV A, LEATHER, FO OTWEAR COMPONENTS 4128"
	},
	{
		"page": 280,
		"trademark": "PARISIAN",
		"details": "5165577    08/10/2021 JITENDER YADAV 567/18, SHIVAJI NAGAR, G URGAON, HARYANA, INDIA An Indian Citizen Address for service in India/Attorney address: CIP LEGIT 8/306 DHARAMPURA BAHADURGARH 124507 HARYANA INDIA Proposed to be Used DELHI Advertising, business administra tion, wholesale and retail of sweets, namkeen , bhujiya, bread biscu its, cakes, pastries,  bakery & confectionery products, aerated dr inks, water, fruit drinks &  fruit juices, chocolate, i ce cream, snacks, foodstuffs  and beverages included in class 35. 4135"
	},
	{
		"page": 283,
		"trademark": "rluthra.com",
		"details": "5166296    08/10/2021 RAJIV K. LUTHRA 103, ASHOKA ESTATE, BARAKHAMBA ROAD, NEW DELHI - 110 001 Indian Citizen Address for service in India/Attorney address: SNEHA MANJOORAN F-97, 4th Floor, Anna Nagar (East), Chennai - 600102, Tamil Nadu.  Used Since :17/01/2010 DELHI Advertising; business management, organizati on and administrati on; office functions. 4138"
	},
	{
		"page": 284,
		"trademark": "Vikas Kejriwal Group of Companies",
		"details": "5166563    08/10/2021 VIKAS KEJRIWAL PLOT NO. 196-197, PAALM PARADISE, TALRAMGARH, GORAKHPUR, U.P-273008 Individual Address for service in India/Attorney address: AKANSHA AGRAWAL License Bazar Pvt. Ltd., 582 J, Chandraguptnagar,  Shahpur Thana, Bashar atpur, Gorakhpur, U.P-273003  Proposed to be Used DELHI ADVERTISING, BUSINESS MANAGEMEN T, BUSINESS ADMINISTRATION, OF FICE FUNCTIONS, RENTAL OF  ADVERTISING SPACE, SHOP WINDOW DRESSING, RETAILING SERVICES IN MALL, SHOPPING OUTLETS, RETAIL  OUTLETS, COMMERCIAL COMPLE XES, GYMNASIUM, SPA, HEALTH CLUBS ; RETAIL STORES, MALL MANAGEMENT,  FACILITY MANAGEMENT, SIGNAGE  MANAGEMENT, PRESENTATION OF  GOODS FOR RETAIL PURPOSES,  ORGANIZATION OF EXHIBITIONS, TRADE  FAIRS, PUBLIC RELATION SERVIC ES, PUBLICITY, SA LES PROMOTION,  INFORMATION RELATING TO MALL,  SHOPPING CENTERS AND RETAIL INDUS TRY AND ALL SERVICES INCLUDED IN  CLASS 35. 4139"
	},
	{
		"page": 288,
		"trademark": "CODE TO GIVE",
		"details": "Priority claimed from 28/09/2021; Application No. : 97049534 ;United States of America   5170270    12/10/2021 Morgan Stanley 1585 Broadway, New York, New York 10036, United States of America a corporation organized and existing  under the laws of the State of Delaware, United States of America Address for service in India/Attorney address: SUJATA CHAUDHRI IP ATTORNEYS 2106 Express Trade Towers 2, First Floor, B-36, Sector  132, Expressway, NOIDA 201301, Uttar Pradesh, India Proposed to be Used DELHI charitable services, namely, providing non-profit groups wi th information tech nology solutions an d technical support 4143"
	},
	{
		"page": 289,
		"trademark": "smartypants.in",
		"details": "5171080    12/10/2021 NOVITA HEALTHCARE PVT LTD LL-19 Gagan Arcade, Krishna Vatika Marg, Goregaon (E), Mumbai – 400 063, Maharashtra, India Private Limited Company Address for service in India/Attorney address: G.S. RIJHWANI & CO. 203, SHREE PRASAD CHAMBERS, IIND FLOOR, NEAR TSEC  ENGINEERING COLLEGE, 35TH ROAD, TPS III, BANDRA  WEST MUMBAI-400050 Used Since :26/03/2018 MUMBAI Advertising, Marketing,  Business Management, Retail, Whol esale, Online Retail, Online Wh olesale & Online  Marketing,  Digital Marketing, import & exp ort, Services related to Food & Nutraceutical Preparations, Dietary substances, Medicinal,  Ayurvedic & Pharmaceutical preparations,  Coffee, tea, cocoa and artificial coffee; rice; ta pioca and sago; flour and  preparations made from cereals; bread, p astry and confectionery; ices; sugar, ho ney, treacle; yeast,  baking-powder; salt;  mustard; vinegar, sauces (condiments); spi ces; ice, Maltodextrins for Nutritional u se other than Medical, etic food not for  medical purposes, meal replacem ents not for medical purposes 4144"
	},
	{
		"page": 295,
		"trademark": "COSMIC SHOWERS",
		"details": "5172017    13/10/2021 COSMIC SHOWERS LLP 331, Sector-31, Amarnagar, Faridabad, HARYANA-121003 Limited Liability Partnership Address for service in India/Attorney address: POOJA ARORA BG-5/14-B, PASCHIM VIHAR, NEW DELHI 110063 Used Since :31/05/2016 DELHI E-commerce, online and offline sales,  business management, business operat ions, business consul tancy advertising,  marketing, consultancy, pers onnel management/recruitment 4150"
	},
	{
		"page": 299,
		"trademark": "ECLIPSE",
		"details": "5173955    14/10/2021 HILITES LUMINARIES A 12 / 13, BHADRAN NAGAR, NEAR N. L. HIGH SCHOOL , OFF S. V. ROAD, MALAD WEST, MUMBAI- 400064 Proprietorship Firm Address for service in India/Attorney address: POOJA SHAH ARTEMIS LAW ASSOCIATES 124, A WING, Sarita Esta te, Near Toll Naka, Dahisar (East), Mumbai- 400068 Used Since :17/11/2014 MUMBAI ADVERTISING; BUSINESS  MANAGEMENT; BUSINESS ADM INISTRATION; O FFICE FUNCTIONS;  IMPORT- EXPORT  AGENCY SERVICES; ONLINE TRADING OF ELECTRONIC S AND ELECTRICAL INSTRUMEN TS, LUMINARIES, DRIVERS,  SOCKET, TRAFFIC LIGHT AP PARATUS, CAR DETECTORS, WIRING ACCESSO RIES INCLUDING  SWITCHES, SWITCH  GEARS, CUT-OUTS, PLUGS, HOLDERS, TESTERS, BELLS,  \"BUZZERS, REGULATO RS, WIRES AND CABLES,  CONNECTORS, STARTERS, CIRCUIT BO ARDS, CONDUITS, SPIKE GUARD, MCB,  TRANSFORMERS, LIGHT DIMMERS  (REGULATORS), WIRE EXTENSION BOXES, EXTENSION  CHORDS, LIGHTNING ARREST ERS, ELECTROMAGNETIC  COILS, CONDUCTORS; INTERFACE, PRINTERS, VOLTAGE  STABILIZERS; APPARATUS, A PPLIANCES, INSTALLATION  FOR LIGHTING, STEAM GENERATING, COOKING, REFRIGERATING, DRYING ALL  KIND OF FANS, VENT ILATING, LEDS,  CEILING LIGHTS, FLASHLIGHTS (TO RCHES), ELECTRIC LAMPS, LIGHT BUL BS ELECTRIC, KETTLES ELECTRIC,  KITCHEN RANGES (OVENS), MI CROWAVE OVENS (COOKING  APPARATUS), ROASTERS,  SAFETY LAMPS, DRYING  APPARATUS AND INSTALLATION, CO OKING APPARATUS AND INSTALLATI ON, BREAD TOASTERS, COFFEE  MACHINES ELECTRIC INSTALLATION FOR HEAT ING AND LIGHTING INCLUDED IN CLASS 35 4154"
	},
	{
		"page": 312,
		"trademark": "RAYBEST",
		"details": "5177860    18/10/2021 SCOT DERMA PRIVATE LIMITED FLAT NO.603, TOWER-C VICTORIA HEIGHTS,PE ER MUCHHLA ZIRAKPUR, MOHALI, PUNJAB 140603 COMPANY Address for service in India/Agents address: VISHAL ARORA # 651, TOP FLOOR, SECT OR - 8-B, CHANDIGARH. Used Since :13/08/2019 DELHI “ADVERTISING, MANAGEMENT, SALE S PROMOTION, DISTRIBUTION, M ARKETING, WHOLESALE AND RETAIL  SERVICES IN RESPECT OF HEALTHCARE , HERBAL & AYURVEDIC PRODUCTS” 4167"
	},
	{
		"page": 326,
		"trademark": "NIVEUS SOLUTIONS",
		"details": "5239133    08/12/2021 NIVEUS SOLUTIONS PRIVATE LIMITED 4th Floor, Amruth Arcade, Near Govinda Ka lyana Mantap, Udupi, Karnataka, India - 576101 PRIVATE LIMITED COMPANY Address for service in India/Attorney address: PRASANNA TIMBLE Flat No. A-1, First Floor, Rosary Commercial  Arcade, Navelim, Margao, Goa, India - 403707 Used Since :01/04/2013 CHENNAI commercial administration of the licensi ng of the goods and services of others;  commercial intermediat ion services, retail  services for computer software 4181"
	},
	{
		"page": 327,
		"trademark": "ADOSHA",
		"details": "5242878    10/12/2021 ADOSHA WELLNESS PRIVATE LIMITED Shop No-303, T/F Distt, Centre, Laxmi Nagar , Delhi, New Delhi, Delhi, India, 110092 SERVICE PROVIDER Body incorporate Address for service in India/Agents address: M.K.GUPTA TRADE MARKS CO. A-73, III FLOOR, SILVER COMPLEX, ABOVE MAHARANI  JEWELLERS, MAIN VIKAS MARG, GURU NANAK PURA, DELHI. Used Since :02/12/2021 DELHI E- COMMERCE/ MARKETING FOR Medicine /  Pharmaceuticals includes Heal th Diabetes, Health Inst ant Anti ViralAction,  Health Joint Pain, Health  noni juice, Health R evital,Detergent Powder, Dish Wash Ba r, Soap, Shampoo  and Conditioner,  Toothpaste, hair oil ,book ( Spiritual  Geeta), wallet and belt, Ki tchenware bartan, Ready made garments includes Suit,  Shirt and pant , Baby food, Dietet ic food and substances adapted for medical use, Dietary supplements. 4182"
	},
	{
		"page": 330,
		"trademark": "AquaDeals",
		"details": "5257412    22/12/2021 MILE DEEP WORKS PRIVATE LIMITED Ground Floor, STPI Incubation Centre, Collectorate Campus,  Kakinada, East Godavari, Andhra Pradesh, India, A Company Incorporated under the Company Act 2013 Address for service in India/Attorney address: RAVIPRASAD PISUPATI TEMPUS LAW ASSOCIATES, Western Pearl, 8th Floor, Hitech Ci ty Road, Beside Google Buildi ng, Kondapur, Hyderabad – 500084,  Telangana  Used Since :12/02/2017 CHENNAI Advertising, Business Administra tion, Office Functions, Servi ces Relating to Trading, Marketing, Online sale of goods  through a website 4185"
	},
	{
		"page": 334,
		"trademark": "Lyzoo",
		"details": "5290948    19/01/2022 AKSHAY TANAJI SAWANT 302, Shree Rajasthan CHS, Triveni, Plot No  24, Kondivita, A.K Road, JB Nagar, Bagha dka College, Andheri East, Mumbai 400059 Indian National Address for service in India/Attorney address: ABRISE LEGAL E 712,Crystal Plaza, New Link road, Opp. In finiti Mall, Andheri  west, Mumbai 400 053 Proposed to be Used MUMBAI Trading, Import Export, Whol esale and Retail of Househol d Goods and Kitchen Utensils 4189"
	},
	{
		"page": 336,
		"trademark": "Tekdi Exports",
		"details": "5293517    21/01/2022 JEEVAN SOPANRAO PANCHAL Telgoan Naka, Telgaon road, Near VIP Lawns, Beed Proprietor Proposed to be Used MUMBAI Import Export Agency 4191"
	},
	{
		"page": 344,
		"trademark": "EQVIP",
		"details": "5300974    27/01/2022 DIGIMINDS CAREER SOLUTIONS LIMITED 127, Neelagagan, Mandi Road, Sulta npur, Mehrauli New Delhi – 110030 A COMPANY INCORPORATED UNDE R THE COMPANIES ACT, 1956 Address for service in India/Attorney address: GYAN PRAKASH BANSAL 204 KRISHNA TOWER-2 PLOT NO-1 POCKET -7 SECTOR-12 DWARKA NEW DELHI-110075 Used Since :17/05/2021 DELHI CAREER PLACEMENT SERVICES, EMPLOYMENT PL ACEMENT SERVICES, HUMAN RESOURCES MANAGEMENT 4199"
	},
	{
		"page": 348,
		"trademark": "QMeNow",
		"details": "5302031    27/01/2022 THOMSON PRESS INDIA LIMITED F 26, First Floor, Connaught Place, New Delhi - 110001 Body incorporate Address for service in India/Attorney address: NAVEEN BHARDWAJ G-100, Second Floor, Preet Vihar, New Delhi - 110092 Proposed to be Used To be associated with: 5274598 DELHI Advertising, Business management, Organisat ion and administrati on, Office  functions 4203"
	},
	{
		"page": 349,
		"trademark": "QMeToday",
		"details": "5302038    27/01/2022 THOMSON PRESS INDIA LIMITED F 26, First Floor, Connaught Place, New Delhi - 110001 Body incorporate Address for service in India/Attorney address: NAVEEN BHARDWAJ G-100, Second Floor, Preet Vihar, New Delhi - 110092 Proposed to be Used To be associated with: 5274598 DELHI Advertising, Business management, Organisat ion and administrati on, Office  functions 4204"
	},
	{
		"page": 352,
		"trademark": "Love Ek Tarrfa",
		"details": "5303181    28/01/2022 ALT DIGITAL MEDIA ENTERTAINMENT LIMITED C-13, Balaji House, Dalia Industrial Es tate, Opp. Laxmi Indl. Estate, New Li nk Road, Andheri (West), Mumbai – 400 053 Public Limited Address for service in India/Attorney address: GRAVITAS LEGAL Office No. 102, 1st Floor, 11, Vikas  Building, G.N. Vaidya Marg, Near Horniman Circle, Fort, Mumbai - 400001 Proposed to be Used MUMBAI Advertising; business management; busi ness administration;  office functions 4207"
	},
	{
		"page": 354,
		"trademark": "UJA",
		"details": "5303299    28/01/2022 SOCIALWELL TECHNOLOGIES OPC PVT LTD Flat T-11/805, Tata Ariana, Mahalaxmi Vihar, Bhubaneswar, Odisha 751029 IN CompanyBody Incorporate Address for service in India/Agents address: GIGI JOSEPH K J 48, Opp. Kendriya Sadan,100 Ft Road, Koramangala,Bangalore-560034. Proposed to be Used KOLKATA Retail services provided by grocery stor es,Advertising; Business mana gement; Business administration; Office  functions 4209"
	},
	{
		"page": 357,
		"trademark": "PLATINUM BULLET",
		"details": "5303378    28/01/2022 MR. AKASH KAMPANI AND MR. KAMAL KAMPANI [Tradi ng as M/S. INDUSTRIAL TOOLS AND HARDWARE] Office No. 1, Ground Floor, Batliboi  House, 59/61, Nagdevi Cross Lane,  Mumbai-400 003, Maharashtra, India A partnership firm formed and existi ng under the Indian Partnership Act Address for service in India/Attorney address: ZEUSIP ADVOCATES LLP C-4, Jangpura Extension, New Delhi-110014 Proposed to be Used MUMBAI Importing, exporting, marketing and retailing of power tools an d part thereof, electrical tool s and part thereof of power  tool accessories and part thereof,  grinding tools (av part of  machine), metal working tool s and wood work ing tools and  stone working tools to be used separat ely or with power tools or electrical  tool, power hammers, hand held tools,  mechanically operated elect rical hammer, stone working machine, wood making machine, Ha nd tool, parts and  accessories thereof, covered in class  35 but excluding any automobile or ga rage tools specifi c to two wheelers. 4212"
	},
	{
		"page": 358,
		"trademark": "PLANTAFFAIRE",
		"details": "5303406    28/01/2022 AUROMA GLOBAL CONNECT PRIVATE LIMITED NO.14, MUTHIALPET, VELLAVARY STR EET, PUDUCHERRY, PO NDICHERRY - 605003 THE TRADE MARKS ACT- 1999 Address for service in India/Attorney address: NEWTON REGINALD No 6, Dhanammal Street Spurtank Road Chetpet Chennai - 600031 Proposed to be Used CHENNAI Retail services provided by grocery stor es; Provision of informati on and advisory services re lating to e-commerce;  Provision of an online marketplace for  buyers and sellers of goods and services;  Online ordering  services; Business  management of wholesale and retail outlets 4213"
	},
	{
		"page": 359,
		"trademark": "RapidHiring",
		"details": "5303431    28/01/2022 VITESSE WORKS PRIVATE LIMITED B2 5031, 4TH FLOOR, BRIGADE MEADOWS, B2 KANAK APURA ROAD, KARNATAKA, BENGALURU (URBAN)-560082 THE TRADE MARKS ACT- 1999 Address for service in India/Attorney address: NEWTON REGINALD No 6, Dhanammal Street Spurtank Road Chetpet Chennai - 600031 Proposed to be Used CHENNAI Human resources consultation. 4214"
	},
	{
		"page": 367,
		"trademark": "FRESCOMASDA",
		"details": "5303496    28/01/2022 PAPPU YADAV 296 TILANG PUR KOTALA VIHAR PHASE 2 TILANG PUR KOTLA NEW DELHI 110043 Individual Address for service in India/Attorney address: MUKESH MAHTO AND ASSOCIATES D1 30B MANSA RAM PARK UTTAM NAGAR NEW DELHI 110059 Proposed to be Used DELHI Selling of Spices & pulses 4222"
	},
	{
		"page": 371,
		"trademark": "Shiprocket Aarambh",
		"details": "5304250    29/01/2022 BIGFOOT RETAIL SOLUTIONS PRIVATE LIMITED Plot No. B, Khasra-360, M.G. Ro ad, Sultanpur, New Delhi-110030, India Company incorporated under the provisions of the Indian Companies Act Address for service in India/Attorney address: MR. RACHIT KOHLI ADV., BLOCK C-2, H.NO. 1000 A, G.F.  PALAM VIHAR, GURGAON, HARYANA 122001 Proposed to be Used To be associated with: 2738591, 4581016 DELHI ADVERTISING; BUSINESS  MANAGEMENT; BUSINESS ADM INISTRATION; O FFICE FUNCTIONS; MARKETING AND  PROMOTIONAL SERVICES; MARKETI NG AND RESEARCH SERVICE S, E-COMMERCE, RETAIL AND WHOLESALE  SERVICES; BUSINESS INTERMEDIARY  SERVICES FOR THE SALE AND PU RCHASE OF GOODS AND SERVICES;  AUCTION SERVICES; CLA SSIFIED ADVERTISING SERVICES; SALE S PROMOTION FOR OTHERS; BUSINESS  INFORMATION SERVICES; ORGANIZATION OF EXHIBITI ONS, CREATIVE, BILLING F UNCTIONS, PUBLIC RELATION;  ORGANIZATION OF SOCIAL EVENTS;  EVENTS FOR COMMERCI AL/ADVERTISING PURPOSES , AS INCLUDED IN CLASS  35. 4226"
	},
	{
		"page": 372,
		"trademark": "Shiprocket Checkout",
		"details": "5304253    29/01/2022 BIGFOOT RETAIL SOLUTIONS PRIVATE LIMITED Plot No. B, Khasra-360, M.G. Ro ad, Sultanpur, New Delhi-110030, India Company incorporated under the provisions of the Indian Companies Act Address for service in India/Attorney address: MR. RACHIT KOHLI ADV., BLOCK C-2, H.NO. 1000 A, G.F.  PALAM VIHAR, GURGAON, HARYANA 122001 Proposed to be Used To be associated with: 2738591, 4581016 DELHI ADVERTISING; BUSINESS  MANAGEMENT; BUSINESS ADM INISTRATION; O FFICE FUNCTIONS; MARKETING AND  PROMOTIONAL SERVICES; MARKETI NG AND RESEARCH SERVICE S, E-COMMERCE, RETAIL AND WHOLESALE  SERVICES; BUSINESS INTERMEDIARY  SERVICES FOR THE SALE AND PU RCHASE OF GOODS AND SERVICES;  AUCTION SERVICES; CLA SSIFIED ADVERTISING SERVICES; SALE S PROMOTION FOR OTHERS; BUSINESS  INFORMATION SERVICES; PROVIDING  AN ON-LINE COMMERCIAL INFORMATIO N DIRECTORY; DI SSEMINATION OF  ADVERTISING FOR OTHERS VIA AN ON-LINE ELECTRON IC COMMUNICATIONS  NETWORK; PROVIDING A SEARCHABLE  ON-LINE DATABASE FEATURING GOOD S AND SERVICES OF OTHERS; PROVIDING A SEARCHABLE ON-LINE  ADVERTISING GUIDE FEATURING THE GOODS AND SERVICES OF OTHER ON-LINE VENDORS; DATABASE  MANAGEMENT SERVICES, PROVIDIN G DIRECTORIES FOR TELEPHONE  NUMBERS, BUSINESS ADDRESSES,  ELECTRONIC MAIL ADDRESSES, NETWORK HOME PA GE ADDRESSES, ADDRESSES AND TELEPHONE NUMBER OF  PEOPLE, PLACES, AND ORGANIZATI ONS; DATA STORAGE AND RETRIEVA L SERVICES FOR TRANSMITTING,  DISPLAYING AND STORING TRANSACTION, IDENTIFICA TION AND FINANCIAL INFORM ATION; INFORMATION  SERVICES, NAMELY, PROVIDING IN FORMATION ABOUT RETA IL PRODUCTS TO CUSTO MERS, FEATURING THE  AVAILABILITY OF SPECIFIC PRODUCTS OF INTEREST TO THEM, AS INCLUDED IN CLASS 35. 4227"
	},
	{
		"page": 373,
		"trademark": "AGCARE",
		"details": "5304981    29/01/2022 SAFEX CHEMICALS (INDIA) LTD. 807, Crown Heights, Plot No.3 B 1, Twin Distri ct Centre, Sector -10, Rohini, New Delhi – 110 085. (A company duly incorporated under Indian Companies Act, 1956) Address for service in India/Agents address: DELHI REGISTRATION SERVICES 85/86, GADODIA MARKET, KHARI BAOLI, DELHI - 110 006 Proposed to be Used DELHI Distribution of prospectuses,  publicity leaflets, advertising  brochures, promotional leaf lets, advertising materials,  marketing , market research and market  analysis, online customer -based social media brand marketing services; trade  promotional services, wholesale and retail  services, online retail services, retail  outlets and shop relating to pesticides  and insecticides, Chemicals for use in p esticides, chemicals for u se as intermediates in the manufacture of pesticides,  chemical additives for insecticides, chemical additives to fungic ides, solvents for use in th e manufacture of insecticides,  chemicals used in agriculture, agricultural chemicals, grow ing media, fertilizers and chem icals for use in agriculture,  horticulture and forestry, seed treatme nt chemicals for agricultural use. 4228"
	},
	{
		"page": 375,
		"trademark": "FERROZEX",
		"details": "5305113    29/01/2022 BENLEX TRADING PRIVATE LIMITED A- 205, SWETA PARK CHS LTD., BAND H ROAD, RNP PARK, BHAYANDER (E), THANE – 401105, MAHARASHTRA, INDIA Body- incorporate including Private Limited Address for service in India/Attorney address: SAI ANAND SERVICE 73/3, SAI KRUPA CHS., POKHARAN ROAD NO-1, SHIVAI NAGAR, THANE (W)- 400 606, MAHARASHTRA, INDIA. Proposed to be Used MUMBAI RETAIL, WHOLESALE, IMPORT, EXPORT,  ONLINE SALES, TRADI NG, MARKETING AND ADVERTISING OF MEDICINAL  AND PHARMACEUTICALS PRODUCTS 4230"
	},
	{
		"page": 379,
		"trademark": "GATKU",
		"details": "5305736    30/01/2022 NIF PRIVATE LIMITED 119-121, (Part), Block P &T, Fazal Ganj, Kanpur 208012, Uttar Pradesh A Private Limited Company Address for service in India/Attorney address: (R)ESERVE (M)ARK 236, CHANDNI CHOWK, FATEHPURI, DELHI-110006 Proposed to be Used DELHI Advertising; Business management, organization and administrati on; Office functions 4234"
	},
	{
		"page": 380,
		"trademark": "GATKOO",
		"details": "5305737    30/01/2022 NIF PRIVATE LIMITED 119-121, (Part), Block P &T, Fazal Ganj, Kanpur 208012, Uttar Pradesh A Private Limited Company Address for service in India/Attorney address: (R)ESERVE (M)ARK 236, CHANDNI CHOWK, FATEHPURI, DELHI-110006 Proposed to be Used DELHI Advertising; Business management, organization and administrati on; Office functions 4235"
	},
	{
		"page": 381,
		"trademark": "GATKAN",
		"details": "5305738    30/01/2022 NIF PRIVATE LIMITED 119-121, (Part), Block P &T, Fazal Ganj, Kanpur 208012, Uttar Pradesh A Private Limited Company Address for service in India/Attorney address: (R)ESERVE (M)ARK 236, CHANDNI CHOWK, FATEHPURI, DELHI-110006 Proposed to be Used DELHI Advertising; Business management, organization and administrati on; Office functions 4236"
	},
	{
		"page": 387,
		"trademark": "BAHURANGA CULTURE",
		"details": "5306046    31/01/2022 KUMAR MAYANK PLOT NO 77, 3RD FLOOR, KARUNA KUNJ, SECTOR - 3 DWARKA, DELHI - 110078 (INDIA) INDIVIDUAL-SOLE PROPRIETOR Address for service in India/Attorney address: HARISH KUMAR ADV., 3685/17 BEHIND KRISHAN KRIPA MANDIR, UTTAM NAGAR, H ANSI, DISTRICT - HISAR, HARYANA (INDIA) - 125033 Proposed to be Used DELHI WHOLESALE AND RETAIL SERVIC ES IN THE FIELD OF CLOT HING, FOOTWE AR AND HEADGEAR. 4242"
	},
	{
		"page": 388,
		"trademark": "DEVAVO",
		"details": "5306160    31/01/2022 RAHUL KHILWANI 10TH FLOOR, OFFICE NO. 1005, HAWARE  INFOTECH PARK, PLOT NO. 39/3, SE CTOR 30A, VASHI, NAVI MUMBAI, THANE,  MAHARASHTRA, 400703 Sole Proprietor Address for service in India/Attorney address: GB LEGAL ASSOCIATES B 203 Sai Sagar Complex, Palm Beach Road, Plot No. 5, Sec 13, Sanpada, Navi Mumbai 400705 Proposed to be Used MUMBAI ADVERTISING, MARKETING, RETAILING, ONLINE SELLING, WHOLES ELLING, BUSINESS MANAGEMENT BUSINESS  PROMOTION OF EDIBLE OIL, OLIVE OI L FOR FOOD, PICKLES, MEAT , FISH, POULTRY; MEAT  EXTRACTS; PRESERVED,  DRIED AND COOKED FRUITS AND VEGETABL E; JELLIES, JAMS, FRUIT SAUCES;  EGGS, MILK AND MILK PRODUCTS;  FATS, SOFT DRINKS CONCE NTRATES, AERATED WATER OTHERS NO N-ALCOHOLIC BEVERAGES AND DRINKS,  PREPARATIONS FOR MAKING BE VERAGES, FRUIT JUICES, SOFT DRINKS,  AZIAN DRINKS, SPRING  WATER, NATURAL  MINERAL WATER, COFFEE, TEA, CO COA AND ARTIFICIAL COFF EE, RICE, PASTA, NO ODLES, CORNFALKES,  POPCORN, FLOUR AND PREPARATIONS  MADE FROM CEREALS, BREAD, PAST RIES AND CONFECTIONERY, EDIBLE  ICES, SUGAR, SALT, MUST ARD, VINEGAR, SAUCES [CO NDIMENTS], SPICES, BARLEY WATERS AND SQUASHES,  CRUSHES, AGRICULTURAL, HO RTICULTURAL AND FORESTRY PRODUCTS  AND GRAINS NOT INCLUDED IN OTHER  CLASSES, LIVE ANIMALS, FRESH F RUITS, VEGETABLES, NAT URAL PLANTS AND FLOWERS, FOODSTUFFS FOR  ANIMALS AND MALT 4243"
	},
	{
		"page": 390,
		"trademark": "OfficialMeterio",
		"details": "5306348    31/01/2022 NIKHIL WARD NO-10,NEAR PANCHAYAT GHAR, SAGARPUR,FARIDABAD,HARYANA-121004 THE TRADE MARK ACT - 1999 Address for service in India/Attorney address: NEWTON REGINALD No 6, Dhanammal Street Spurtank Road Chetpet Chennai - 600031 Proposed to be Used DELHI Retail services provided by grocery stor es; Provision of informati on and advisory services re lating to e-commerce;  Provision of an online marketplace for  buyers and sellers of goods and services;  Online ordering  services; Business  management of wholesale and retail outlets 4245"
	},
	{
		"page": 401,
		"trademark": "DAGULVARI",
		"details": "5307145    31/01/2022 ANIL KUMAR VILLAGE 87 JONAPUR, MEHRAULI NEW DELHI 110047, India a citizen of India Address for service in India/Attorney address: ANUPAM PANDEY N 19 C, Saket, New Delhi 17 Proposed to be Used DELHI FASHION SHOW SERVICES (ADVERTISING OR PROMOTIONAL SERVICES); ORGANISATION OF FASHION SHOWS FOR  PROMOTIONAL PURPOSES; PRODUCTION OF FASHION SHOWS FOR ADVERTISING OR PROMOTIONAL PURPOSES;  PRODUCTION; ORGANISATION AND PRESENTATION OF FASHION SHOWS FO R ADVERTISING OR  PROMOTIONAL  PURPOSES, RETAIL SERVICES; THE BRINGING TOGETHER,  FOR THE BENEFIT OF OTHERS , OF A VARIETY OF GOODS  (EXCLUDING THE TRANSPORT THEREO F), ENABLING CUSTOMERS TO CONVEN IENTLY VIEW AND  PURCHASE THOSE  GOODS; SUCH SERVICES MAY BE PROVIDED BY RETAIL  STORES, WHOLESALE OUTLE TS, THROUGH MAIL ORDER  CATALOGUES OR BY MEANS OF ELECTRONIC MEDIA. 4256"
	},
	{
		"page": 405,
		"trademark": "REDLINK",
		"details": "5307452    31/01/2022 N SUVEDHADEVI PROPRIETOR OF RV STRATEGIES 2ND FLOOR, 121, SUVEDHA ILLAM, THANDAI PERI YARNAGAR MAIN ROAD, AYANAVARAM, CHENNAI, TAMILNADU,  600023 THE TRADE MARK ACT-1999 Address for service in India/Attorney address: NEWTON REGINALD No 6, Dhanammal Street Spurtank Road Chetpet Chennai - 600031 Proposed to be Used CHENNAI Marketing services; Online ordering  services; Computerized online ordering  services; Wholesale ordering services;  Computerized online retail store services;  Goods import-export agency services; Pr ovision of an onli ne marketplace for  buyers and sellers of goods and services;  Business marketing; Provisio n of information  and advisory servi ces relating to  e-commerce; Busin ess administration; 4260"
	},
	{
		"page": 407,
		"trademark": "PATHOLUME",
		"details": "5307514    31/01/2022 MYLAB DISCOVERY SOLUTIONS PRIVATE LIMITED PLOT NO 99-B, LONAVALA INDUSTRIAL CO-OPERATIVE  ESTATE LTD, NANGARGAON, LONAVALA, PUNE – 410401  MAHARASHTRA, INDIA. A Private Limited Company incorp orated as per laws of India. Address for service in India/Attorney address: PRIYANK GUPTA Stratjuris Law Partners, Office 301, Westport, Pan Card Club Road, Baner, Pune 411045, Maharashtra, India. Proposed to be Used MUMBAI Retail services for medical apparatus;  Wholesale services for medical apparatus; Retail or  wholesale services for medical  supplies. 4262"
	},
	{
		"page": 408,
		"trademark": "PATHOLIZA",
		"details": "5307521    31/01/2022 MYLAB DISCOVERY SOLUTIONS PRIVATE LIMITED PLOT NO 99-B, LONAVALA INDUSTRIAL CO-OPERATIVE  ESTATE LTD, NANGARGAON, LONAVALA, PUNE – 410401  MAHARASHTRA, INDIA. A Private Limited Company incorp orated as per laws of India. Address for service in India/Attorney address: PRIYANK GUPTA Stratjuris Law Partners, Office 301, Westport, Pan Card Club Road, Baner, Pune 411045, Maharashtra, India. Proposed to be Used MUMBAI Retail services for medical apparatus;  Wholesale services for medical apparatus; Retail or  wholesale services for medical  supplies. 4263"
	},
	{
		"page": 409,
		"trademark": "KNOWSURE",
		"details": "5307534    31/01/2022 MYLAB DISCOVERY SOLUTIONS PRIVATE LIMITED PLOT NO 99-B, LONAVALA INDUSTRIAL CO-OPERATIVE  ESTATE LTD, NANGARGAON, LONAVALA, PUNE – 410401  MAHARASHTRA, INDIA. A Private Limited Company incorp orated as per laws of India. Address for service in India/Attorney address: PRIYANK GUPTA Stratjuris Law Partners, Office 301, Westport, Pan Card Club Road, Baner, Pune 411045, Maharashtra, India. Proposed to be Used MUMBAI Retail services for medical apparatus;  Wholesale services for medical apparatus; Retail or  wholesale services for medical  supplies. 4264"
	},
	{
		"page": 413,
		"trademark": "P-MARQ",
		"details": "5307818    01/02/2022 POLITIQUE MARQUER PRIVATE LIMITED 602, BLOCK-A, NAURANG HOUSE, 21 KG  MARG, NEW DELHI, DELHI - 110001 BODY CORPORATE Proposed to be Used DELHI Business consulting services  and Market research services 4268"
	},
	{
		"page": 415,
		"trademark": "YOUR SOCIA",
		"details": "5307960    01/02/2022 RINI GEORGE 204 Uron Suryodaya, Pai Layout, First Main, Old Madras Road,  Krishnarajapuram R S, Bengaluru, Karnataka, India, 560016 Proprietor Address for service in India/Attorney address: SNEHA MANJOORAN F-97, 4th Floor, Anna Nagar (East), Chennai - 600102, Tamil Nadu.  Proposed to be Used CHENNAI Advertising; business management, organizati on and administrati on; office functions. 4270"
	},
	{
		"page": 423,
		"trademark": "Saushit",
		"details": "5308320    01/02/2022 NARESHBHAI MANJIBHAI DIYORA 127 TO 129, SHRADDHA ROW HOUSE, NR. SARAT HANA COMMUNITY HALL, SARATHANA, SURAT. PROPRIETOR Address for service in India/Attorney address: YOGESH V. PARKHIYA & CO. 3028, THE PALADIUM MALL, YOGICHOWK, VARACHHA, SURAT-395006. Proposed to be Used To be associated with: 4974054 AHMEDABAD PROVIDING WHOLESALE, DISTRIBUTION, ON-LINE TRADING  SERVICES RELATED TO TEXTILE GOODS, READY MADE  GARMENTS, FOOTWEAR,  WATCHES, ELECTRONIC ITEM S, FURNITURE, HOME  & KITCHEN APPLIANCES, GROCERIES,  VEGETABLE, FRUIT, DRINKS , BAKERY PRODUCTS, HARDWARE  ITEMS, FURNITURE,  PVC SHEET, PLASTIC  HINGES,HOME DECOR AND HOME IMPROVEMENT PRODUCT , TOYS, SCHOOL  BAG, LUGGAGE BAG , STATIONERY,  GAMES, MEDICAL EQUIPMENTS & IN STRUMENTS, PERSONAL; HEALTH & BE AUTY CARE PRODUCTS AND COSMETICS  PRODUCTS. 4278"
	},
	{
		"page": 426,
		"trademark": "USCO",
		"details": "5308720    01/02/2022 TWIN PARTS PRIVATE LIMITED 67 BENTICK STREET, 1ST FLOOR, ROOM NO- 10, KOLKATA - 700069, WEST BENGAL, INDIA BODY INCORPORATE Address for service in India/Attorney address: IPR HOUSE.COM M/s. IPR House.com, Advocates 89/269/270, BANGUR PARK, P ARK TOWER, 4TH FLOOR, ROOM NO. 401, RISHRA - 712248,  HOOGHLY, WEST BENGAL Used Since :30/11/2016 To be associated with: 4232839 KOLKATA ADVERTISING AND MARKETING, IM PORT & EXPORT, RETAIL CHAIN OUTLET, RE TAIL AND WHOLESAL E, ONLINE SALE,  RETAIL & WHOLESALE TRADING OF PARTS FOR EX CAVATORS AND DOZERS, UNDER CARRIAGE PARTS, TRACK  ROLLERS, CARRIER ROLLERS, TOP  ROLLERS, SPROCKETS, IDLERS, SEG MENTS, SEGMENT SPROCKETS, TRACK  LINKS, TRACK SHOE PLATES,  BOLT AND NUTS FOR TRACK SHOE, BOLT  AND NUTS FOR TRACK LINKS, TRACK  ADJUSTER ASSEMBLY, TRACK SPR ING ASSEMBLY, TRACK CYLINDER AS SEMBLY, TRACK SPRINGS, TRACK  CYLINDER PISTONS, BUCKETS, BUCKETS  FOR EXCAVATORS, BUCKET TOOTH,  BUCKET ADAPTER,  SIDE CUTTER,  CUTTING EDGE, LOOSE LINKS, MASTER  LINKS, BUSH, PIN,  YOKE, BUCKET PIN, TEET H LOCK, TOOTH LOCK,  BREAKER, HYDRAULIC BREAKER,  HYDRAULIC ROCK BREAKER, HAMMER,  HYDRAULIC HAMMER,  CHISEL, CHISEL  FOR BREAKER, LOADER BUCKETS FO R EXCAVATORS, HYDRAULIC HAMMERS , HYDRAULIC BREAKE RS, CHISELS  FOR BREAKERS, HYDRAULIC MOTORS AND PU MPS FOR EXCAVATORS, SLEWING GEARS 4281"
	},
	{
		"page": 433,
		"trademark": "INDIGAMMY",
		"details": "5308856    01/02/2022 RAHUL MARWAHA S/O SHRI BHARAT BHUSHAN 263, Sector-2, Panchkula,  Haryana, (India) INDIVIDUAL Address for service in India/Attorney address: RAMESH K. GAUTAM & ASSOCIATES 451, OPP. BSNL TOWER, AMBEDKAR ROAD, ARTHALA, MOHAN NAGAR, GHAZIABAD-201007,U.P,M- 09871034747,09990034747 Proposed to be Used DELHI Wholesale And Retail Serv ices Relating To Pharmaceutical , Medicinal And Veterinary Pr eparation ,Online Marketing  Services, Online Ordering Services, Online Adver tising, Online  Auctioneering Services 4288"
	},
	{
		"page": 434,
		"trademark": "HAREBELLS",
		"details": "5309013    01/02/2022 SADAM HUSSAIN RIJANA MANZIL, ROSAPOOKANDAM STREET, WARD NO . 9, KUMILYVILLAGE, IDUKKI DISTRICT-685509 THE TRADE MARKS ACT- 1999 Address for service in India/Attorney address: NEWTON REGINALD No 6, Dhanammal Street Spurtank Road Chetpet Chennai - 600031 Proposed to be Used To be associated with: 5038025 CHENNAI Wholesale or retail services; Import  and export agencies; Impo rt and export agency services; Wholesale services for  foodstuffs; Wholesale food di stributorship services; Wholesale store servi ces featuring foodstu ffs; Wholesale services  for food cooking equipment; Wholesale services for  food preparation im plements; Online wh olesale store services  featuring foodstuffs; On-line wholesale store ser vices featuring food preparation implements; 4289"
	},
	{
		"page": 435,
		"trademark": "Vedicon",
		"details": "5309132    01/02/2022 SURYADEO JYOTI Flat-204, Sangamitra Residency, KLV Layout, Kothanur, JP Nagar 8th Phase, Bangalore-560076 INDIVIDUAL Address for service in India/Attorney address: LEGALRAASTA TECHNOLOGIES PRIVATE LTD B - 300 , Saraswati Vihar , Pitampura , Delhi - 110034 Proposed to be Used To be associated with: 4690720 CHENNAI Marketing, Retail,  Wholesale, Trading and Online Sell ing of Cosmetics, Soaps, Bath  preparations, Body cleaning and  beauty care preparations, Perfumes, Toil etries, Cleaning preparatio ns, Household cleaning subs tances, Herbal extracts  for cosmetic purposes, Homeop athic medicines, Homeopathi c supplements, Pharmaceutical  and Medical preparations,  Hand Sanitizers, Handsanitizin g preparations, Alcohol-based  antibacterial skin sanitizergels , Sanitizers  for household  use, Sanitizing preparat ions for hospital use, Sanitary  napkins, Dietary and nutritiona l supplements, Herbal medicine,  Baby food, Medicated su pplements for foodstuffs for an imals, Medical instru ments, Medical devices,  Medical furniture  and bedding, equipment for movi ng patients, Surgical  and wound treating eq uipment, Agricultural  seeds, Pesticides,  Hardware, Marketing consultancy  and Commercial consultancy services 4290"
	},
	{
		"page": 438,
		"trademark": "GAADINATION",
		"details": "5309406    01/02/2022 BIKASH K GANGULY C/O REVATHI BIKASH GANGULY, 33/13, VIJAY VILA S TAURUS, GHODBUNDER ROAD,  NEW HORIZON SCHOOOL,  ANAND NAGAR, KAVESAR, THANE-400615 Proprietor Address for service in India/Attorney address: ARPIT PAREKH B405, NEW VARDHMAN CHS, SO DAWALA LANE, BORIVALI WEST Proposed to be Used MUMBAI Advertising services relating  to the motor vehicles, Adverti sing services relating  to motor cars, Rating  the condition of  pre-owned cars for buyers prior to purchase to verify that pre-owned cars have  been reconditioned and are in good  working order, Providing pu rchase advisory and consulti ng services to consumers for  the purchase of motorized  vehicles, Dealerships in the fi eld of automobiles, Providing information ab out automobiles for sa le by means of the  Internet, Advertising automobil es for sale by means of the Internet, Providin g information via the Inte rnet relating to the  sale of automobiles, wholesale services in  relation to vehicles, auct ioning of vehicles, retail  services in relation to  vehicles, locating pre-owned  vehicles available for purchase  or lease included in class 35 4293"
	},
	{
		"page": 442,
		"trademark": "GWALBAL",
		"details": "5309712    02/02/2022 VINAY MITTAL 2/209-B, AWAGARH HOUSE, CIVIL LINES,  M.G. ROAD, AGRA - 282 002 (U.P.) INDIA SINGLE FIRM Address for service in India/Attorney address: TAJ TRADE MARK ANAND VRINDAVAN, SANJAY PLACE, AGRA - 282 002 (U.P.) INDIA. Used Since :01/01/2008 To be associated with: 1757543, 2253395 DELHI ADVERTISING, BUSINESS M ANAGEMENT, BUSINESS ADMINIS TRATION, OFFICIAL F UNCTIONS, DIST RIBUTION,  MARKETING, WHOLESALE AND RETAIL SERVICES RELATING  TO FLOUR AND PREPARATIONS MADE FROM CEREALS,  BAKERY PRODUCTS AND CONFECTIONERY, I NCLUDING SWEETS & NAMKEEN PREPARATIONS. 4297"
	},
	{
		"page": 446,
		"trademark": "Ernil",
		"details": "5310242    02/02/2022 ERNIL INDIA PRIVATE LIMITED Ernil India Private Limited ,11/48 Kadavil House, Ch enneerkara P O, Pathanamthitta, Kerala, India, 689503 Private Limited Company Address for service in India/Attorney address: SNEHA MANJOORAN F-97, 4th Floor, Anna Nagar (East), Chennai - 600102, Tamil Nadu.  Used Since :13/09/2021 CHENNAI Advertising; business management , organization and administra tion; office function, ONLINE  SELLING,RETAIL,ECOMMERCE. 4301"
	},
	{
		"page": 448,
		"trademark": "HOPETECH",
		"details": "5310415    02/02/2022 LIGHTYEAR INFRATECH PRIVATE LIMITED PLOT NO.-38, FIE PATPARGANJ, INDUSTRIAL AREA, NEW DELHI-110092 Body Incorporate Address for service in India/Attorney address: LALJI ADVOCATES A-48, Yojna Vihar, Delhi-110092 Proposed to be Used DELHI Advertising, Business Administra tion & Business Management Ac tivities, Online Marketing,  Wholesale & Retail Outlets  And Shops Exporter & Importer Includin g Services Relating To Distribution, Tr ading Batteries, Battery Plates, Battery  Starters, Electric Battery Charger, Battery Energy Storage  System, Battery Management System, Battery Pades, Lithium  Ion Cells And Battery, Battery Packs, Elect ric Vehicle Charger And Its Parts, In verter And Power Conversion Systems,  Automation For Manufacture Of Batteries  - Lithium Ion, Flow, Fuses,  Electric Plug, Electric So ckets, Electrical Switches,  Electrical Terminal Connect or, Horns For Signalling, Elect rical Armatures Electric Wire,  Electric Meter, Speedometers,  Electrical Sensor, Electronic Keys For Au tomobiles, Electric Wire Harnesses For Au tomobiles And Helmets, UPS, CVT,  Inverter, Voltage Stabilizers St abilizer Transformer, Wire &  Cables, Electrical Conduit, Switch Accesso ries, Switchboard,  Capacitor, M.C.B., MCB Bo x, Junction Box,  Change Over, Cut Outs, Sockets, Distribu tion Box, DVD, V CD, Audio & Video  Cd Player, LCD TV, Led Tv, Colour T.V., Car Stereos, Audio & Video Cassettes, Home  Theatre Systems, Speakers,  Woofers, Computers, Laptop, Data Stor age Devices, Protective Face Shield, Mo bile Phone And Mobile Phone Accessories  Computer Software, Hardware Applicat ion Software, Application  Software For Smart Phone,  Software For Product,  Development, Application Softwar e, Downloadable Applicatio n Software, Application Soft ware, Computer Software For  Accessing, Browsing And Search ing Online Databases, Intern et Access Software, Analog me ters, Shunts,  Multifunction  meters, Isolators, Digital meters, Energy management syst em, Synchronizing unit, Prot ector relays, CAM switches,  Battery charger, Power quality equipmen t, Temperature controller, Temperatur e tester, Clamp meters, Digital panel  meters, Transducers, Power supp ly equipment, Convertors, Transducers, Insulation  testers, Earth testers, IR testers,  Internal resistance testers,  Load bank, Alloy resistor, Batte ry Analyzer, Cable fault tester, Gas leak detector, Battery  tester, Calibration equipment, Diagnostic systems, Oscilloscope, Data recorder, Temperature recorder, Multichannel data  recorder, LCR meter, Micro Ohm meter,  DC resistance tester, Multichannel r esistance scanner, Battery comprehensive  tester, Cell tester, BMS tester, MOSFET Parameter analyser , Meter calibrator, Data l ogger, Sequence meter, Power  analyser, Ammeter, Voltmeter, Double clamp meter, Circui t breaker analyser, Injection t est equipment, TTR tester,  Demagnetizer, Winding resistan ce tester, Relay test system, Power source equi pment, Multi product  calibrator, CT PT  Tester, CT PT analyser, Meter test equi pment, Meter test bench, Testing softw are Software, Downloadable From The  Internet, Computer Software Products, Educational Computer  Software, Computer Software  Programs, Mobile Application  Software, Battery Tester Software Webs ite Development Software,  Cloud Computing Software,  Artificial Intelligence  Software, Software For Mobile Telephone s, Educational Software Fo r Children, Application So ftware For Smartphones,  Application Software For Cloud  Computing Services, Artificial  Intelligence And Machine L earning Software, Education  Software, Educational Softw are, Downloadable  Educational Course Materials &  Accessories Includ ed In Class 9. 4303"
	},
	{
		"page": 457,
		"trademark": "KURESYS LABS PRIVATE LIMITED",
		"details": "5311254    02/02/2022 KURESYS LABS PRIVATE LIMITED D-602, PLOT NO.5, SWAMI DAYANAND CGHS LTD SECTOR-6, DWARKA, NEW DELHI – 110075 A Private Limited Company Address for service in India/Attorney address: EXPERT INTELLECT 208, GANGOTRI APARTMENT, POCKET-1,  SECTOR 12, DWARKA, NEW DELHI-110078 Used Since :21/03/2014 To be associated with: 3559146 DELHI MARKETING, WHOLESALE AND RETAIL SERVICES  RELATING TO MEDICI NES AND PHARMACEUTICAL  PREPARATIONS. 4312"
	},
	{
		"page": 460,
		"trademark": "PARIWWWAY",
		"details": "5311485    02/02/2022 PARINATI SYSTEMS PRIVATE LIMITED No.4M – 501, 3rd Floor, Kamman ahalli Main Road, 3rd Block,HRBR Layout Bengaluru 560043 AN INDIAN COMPANY INCORPORATED UNDERCOMPANIES ACT, 2013 Address for service in India/Agents address: SHRIPAD GANAPATHI BHAT SARANG #84, MADHUVANA, 2ND MAIN,14TH BL OCK, NAGARBHAVI, BENGALURU-560072. Proposed to be Used CHENNAI Provision of information and advisory  services relating to e-commerce, Adverti sing services for the promotion of e- commerce, Business management servi ces relating to electronic commerce. 4315"
	},
	{
		"page": 461,
		"trademark": "Phool Aromatherapy",
		"details": "5311695    03/02/2022 KANPUR FLOWERCYCLING PRIVATE LIMITED Arazi Number 428,429 Bhaunti, Pratappur, Kalyanpur Kanpur,UP 209305 India Private Limited Address for service in India/Attorney address: KRISHNA TRADE MARK BUREAU SA-17/130 M-M-3 (M.I.G.-3) ASHOK VIH AR COLONY PHASE-II PAHARIA VARANASI U.P Proposed to be Used To be associated with: 4275877, 4277465 DELHI Advertising, business manageme nt, business administration , office functions, Shops,  Outlet Services Related To  Washing Powder, Detergent cake So ap, Liquid Soap, Toilet So ap, Laundry Blue, Hand Wash , Face Wash, Face Pack, Body  Lotion, Glass Cleaner, Floo r, Cleaner, Dish Wash,  Stain Remover, Bleaching Preparations , Cosmetics, Hair Oil, Shampoo,  Hair Gel, Talcum Powder, Hair Lotion,  Skin Care Preparations, po lishing; scouring and abrasi ve preparations , Toothpaste,  air fragrancing preparations, aromatics,  essential oils, perfumery, incense, in cense stick, incense co nes, air fresher,  flower extracts, 4316"
	},
	{
		"page": 462,
		"trademark": "Phool Aromatherapy Sleep",
		"details": "5311696    03/02/2022 KANPUR FLOWERCYCLING PRIVATE LIMITED Arazi Number 428,429 Bhaunti, Prata ppur, Kalyanpur, Kanpur UP 209305 India Private Limited Address for service in India/Attorney address: KRISHNA TRADE MARK BUREAU SA-17/130 M-M-3 (M.I.G.-3) ASHOK VIH AR COLONY PHASE-II PAHARIA VARANASI U.P Proposed to be Used To be associated with: 4275877, 4277465 DELHI Advertising, business manageme nt, business administration , office functions, Shops,  Outlet Services Related To  Washing Powder, Detergent cake So ap, Liquid Soap, Toilet So ap, Laundry Blue, Hand Wash , Face Wash, Face Pack, Body  Lotion, Glass Cleaner, Floo r, Cleaner, Dish Wash,  Stain Remover, Bleaching Preparations , Cosmetics, Hair Oil, Shampoo,  Hair Gel, Talcum Powder, Hair Lotion,  Skin Care Preparations, po lishing; scouring and abrasi ve preparations , Toothpaste,  air fragrancing preparations, aromatics,  essential oils, perfumery, incense, in cense stick, incense co nes, air fresher,  flower extracts, 4317"
	},
	{
		"page": 463,
		"trademark": "Phool Aromatherapy Stress Relief",
		"details": "5311697    03/02/2022 KANPUR FLOWERCYCLING PRIVATE LIMITED Arazi Number 428,429 Bhaunti, Prata ppur, Kalyanpur, Kanpur UP 209305 India Private Limited Address for service in India/Attorney address: KRISHNA TRADE MARK BUREAU SA-17/130 M-M-3 (M.I.G.-3) ASHOK VIH AR COLONY PHASE-II PAHARIA VARANASI U.P Proposed to be Used To be associated with: 4275877, 4277465 DELHI Advertising, business manageme nt, business administration , office functions, Shops,  Outlet Services Related To  Washing Powder, Detergent cake So ap, Liquid Soap, Toilet So ap, Laundry Blue, Hand Wash , Face Wash, Face Pack, Body  Lotion, Glass Cleaner, Floo r, Cleaner, Dish Wash,  Stain Remover, Bleaching Preparations , Cosmetics, Hair Oil, Shampoo,  Hair Gel, Talcum Powder, Hair Lotion,  Skin Care Preparations, po lishing; scouring and abrasi ve preparations , Toothpaste,  air fragrancing preparations, aromatics,  essential oils, perfumery, incense, in cense stick, incense co nes, air fresher,  flower extracts, 4318"
	},
	{
		"page": 464,
		"trademark": "Phool Aromatherapy Energise",
		"details": "5311698    03/02/2022 KANPUR FLOWERCYCLING PRIVATE LIMITED Arazi Number 428,429 Bhaunti, Prata ppur, Kalyanpur, Kanpur UP 209305 India Private Limited Address for service in India/Attorney address: KRISHNA TRADE MARK BUREAU SA-17/130 M-M-3 (M.I.G.-3) ASHOK VIH AR COLONY PHASE-II PAHARIA VARANASI U.P Proposed to be Used To be associated with: 4275877, 4277465 DELHI Advertising, business manageme nt, business administration , office functions, Shops,  Outlet Services Related To  Washing Powder, Detergent cake So ap, Liquid Soap, Toilet So ap, Laundry Blue, Hand Wash , Face Wash, Face Pack, Body  Lotion, Glass Cleaner, Floo r, Cleaner, Dish Wash,  Stain Remover, Bleaching Preparations , Cosmetics, Hair Oil, Shampoo,  Hair Gel, Talcum Powder, Hair Lotion,  Skin Care Preparations, po lishing; scouring and abrasi ve preparations , Toothpaste,  air fragrancing preparations, aromatics,  essential oils, perfumery, incense, in cense stick, incense co nes, air fresher,  flower extracts, 4319"
	},
	{
		"page": 465,
		"trademark": "Phool Aromatherapy Calm",
		"details": "5311699    03/02/2022 KANPUR FLOWERCYCLING PRIVATE LIMITED Arazi Number 428,429 Bhaunti, Prata ppur, Kalyanpur, Kanpur UP 209305 India Private Limited Address for service in India/Attorney address: KRISHNA TRADE MARK BUREAU SA-17/130 M-M-3 (M.I.G.-3) ASHOK VIH AR COLONY PHASE-II PAHARIA VARANASI U.P Proposed to be Used To be associated with: 4275877, 4281366, 4585447, 4726246 DELHI Advertising, business manageme nt, business administration , office functions, Shops,  Outlet Services Related To  Washing Powder, Detergent cake So ap, Liquid Soap, Toilet So ap, Laundry Blue, Hand Wash , Face Wash, Face Pack, Body  Lotion, Glass Cleaner, Floo r, Cleaner, Dish Wash,  Stain Remover, Bleaching Preparations , Cosmetics, Hair Oil, Shampoo,  Hair Gel, Talcum Powder, Hair Lotion,  Skin Care Preparations, po lishing; scouring and abrasi ve preparations , Toothpaste,  air fragrancing preparations, aromatics,  essential oils, perfumery, incense, in cense stick, incense co nes, air fresher,  flower extracts, 4320"
	},
	{
		"page": 466,
		"trademark": "Phool Artisanal Incense",
		"details": "5311700    03/02/2022 KANPUR FLOWERCYCLING PRIVATE LIMITED Arazi Number 428,429 Bhaunti, Prata ppur, Kalyanpur, Kanpur UP 209305 India Private Limited Address for service in India/Attorney address: KRISHNA TRADE MARK BUREAU SA-17/130 M-M-3 (M.I.G.-3) ASHOK VIH AR COLONY PHASE-II PAHARIA VARANASI U.P Proposed to be Used To be associated with: 4275877, 4281366, 4585447, 4726236 DELHI Advertising, business manageme nt, business administration , office functions, Shops,  Outlet Services Related To  Washing Powder, Detergent cake So ap, Liquid Soap, Toilet So ap, Laundry Blue, Hand Wash , Face Wash, Face Pack, Body  Lotion, Glass Cleaner, Floo r, Cleaner, Dish Wash,  Stain Remover, Bleaching Preparations , Cosmetics, Hair Oil, Shampoo,  Hair Gel, Talcum Powder, Hair Lotion,  Skin Care Preparations, po lishing; scouring and abrasi ve preparations , Toothpaste,  air fragrancing preparations, aromatics,  essential oils, perfumery, incense, in cense stick, incense co nes, air fresher,  flower extracts, 4321"
	},
	{
		"page": 467,
		"trademark": "Phool Aromatherapy Headquarters",
		"details": "5311701    03/02/2022 KANPUR FLOWERCYCLING PRIVATE LIMITED Arazi Number 428,429 Bhaunti, Prata ppur, Kalyanpur, Kanpur UP 209305 India Private Limited Address for service in India/Attorney address: KRISHNA TRADE MARK BUREAU SA-17/130 M-M-3 (M.I.G.-3) ASHOK VIH AR COLONY PHASE-II PAHARIA VARANASI U.P Proposed to be Used To be associated with: 4275877, 4277465 DELHI Advertising, business manageme nt, business administration , office functions, Shops,  Outlet Services Related To  Washing Powder, Detergent cake So ap, Liquid Soap, Toilet So ap, Laundry Blue, Hand Wash , Face Wash, Face Pack, Body  Lotion, Glass Cleaner, Floo r, Cleaner, Dish Wash,  Stain Remover, Bleaching Preparations , Cosmetics, Hair Oil, Shampoo,  Hair Gel, Talcum Powder, Hair Lotion,  Skin Care Preparations, po lishing; scouring and abrasi ve preparations , Toothpaste,  air fragrancing preparations, aromatics,  essential oils, perfumery, incense, in cense stick, incense co nes, air fresher,  flower extracts, 4322"
	},
	{
		"page": 468,
		"trademark": "TAZFRESH",
		"details": "5311956    03/02/2022 MR. MOHAMMED ASIM ANSARI 8-2-293/82/L/36B, MLA COLONY, BANJARA HILLS, RO AD NO. 12, HYDERABAD – 34, TELANGANA, INDIA. An Individual Address for service in India/Agents address: PRADEESH P.L No.23, Hari Prem, 2nd floor, Behind Asha Sweets,  CMH Road, Indira Nagar 1st Stage, Bangalore-560038. Proposed to be Used CHENNAI On-Line Retail Ordering In Th e Field Of Restaurant Takeout Delivery; Retail  Services For Foodstuffs ; On-Line Retail Store  Services Featuring Food Stuffs; Retail Or Wholesale Services For Food An d Beverages, Sweets, Snacks; Online Ordering  Services, Marketing, Advertising , Marketing, Distribution, Whol esale And Retail Services, Retail  Outlets, Online Selling,  Retail Store Services, Wholesale Services Fo r Foodstuffs; Retail Store Services Featur ing Foodstuffs; Reta il Store; Retail  Services Provided By Grocery Stores; Retail Services For Food stuffs; Wholesale Services For  Foodstuffs; Retail Services  Relating To Foodstuffs; Wholesale Stor e Services Featuring  Foodstuffs; Wholesale Services  Relating To Foodstuffs;  Retail Store Services Featuring Foodstu ffs; Online Whol esale Store Services Featuring Food stuffs; Online Retail Store  Services Featuring Foodstuffs ; Wholesale Services In Relation To Foodstuffs; Wholesale  Distributorship  Services For  Food And Beverages; Prov iding Consumer Product Informati on Relating To Food Or Drin k Products; Retail Services Or  Wholesale Services For  Food And Beverage 4323"
	},
	{
		"page": 470,
		"trademark": "Mission #2DegreesDown",
		"details": "5312097    03/02/2022 IMPACTWARE TECHNOLOGY SOLUTIONS PRIVATE LIMITED APRAMEY, FLAT NO. 103, S. NO 106/3/23,  BEHIND D-MART, BANER, PUNE 411045 PRIVATE LIMITED COMPANY Address for service in India/Agents address: NEHA SUHAS PATIL 15, Prarambh, Attrey Society,Near Deep Bunglow Chowk,Model Colony, Pune-411016. Proposed to be Used MUMBAI Conducting marketing Campaigns, online & o ffline advertising  for products of applicant 4325"
	},
	{
		"page": 472,
		"trademark": "The Orange Splendour",
		"details": "5312260    03/02/2022 SAHANA S. KUMAR Venkatachala Nivasa, # 1100, Devaparthiva Road, Chamarajapuram, Chamaraja Moholla, Mysuru – 570004 an Indian Proprietor Address for service in India/Agents address: A.V. NATHAN ASSOCIATES. 451, 2ND CROSS, 3RD BLOCK, 3RD STAGE, BASAVESHW ARA NAGAR, BANGALORE-560 079, KARNATAKA STATE INDIA. Proposed to be Used CHENNAI retail services related to bakery products; pastries; co nfectionary; sweets and sav ouries, food and beverages 4327"
	},
	{
		"page": 474,
		"trademark": "Indinno",
		"details": "5312333    03/02/2022 INDINNO TECHNOLOGIES PRIVATE LIMITED Room No - 1/E, 3rd Floor, 29/B, Rabindra Sarani, Kolkata - 700073, West Bengal Private Limited Address for service in India/Attorney address: NADAR VENNILA C-102, Calypso, Bloomfield, Amit Enterprises Housing,Nr. Gold  Gym, NH-4, Mumbai-Bangalore Hi ghway,Sinhagad Road, Ambegaon  (BK), Pune-411 046  Proposed to be Used KOLKATA Retail services for furniture 4329"
	},
	{
		"page": 475,
		"trademark": "CRSST PHARMA",
		"details": "5312339    03/02/2022 SHWETA VIJAYVARGIYA D/O LATE INDERJEET WALIA 2564,SMS Highway, Vijayvargiya Building, Chaura Rasta, Jaipur 14, Rajasthan,(India) INDIVIDUAL Address for service in India/Attorney address: RAMESH K. GAUTAM & ASSOCIATES 451, OPP. BSNL TOWER, AMBEDKAR ROAD, ARTHALA, MOHAN NAGAR, GHAZIABAD-201007,U.P,M- 09871034747,09990034747 Proposed to be Used To be associated with: 4919270 AHMEDABAD Wholesale And Retail Serv ices Relating To Pharmaceutical , Medicinal And Veterinary Pr eparation ,Online Marketing  Services, Online Ordering Services, Online Adver tising, Online  Auctioneering Services 4330"
	},
	{
		"page": 477,
		"trademark": "GORISHANKER HERBALS",
		"details": "5312435    03/02/2022 JAIDEV SINGH PROPRIETOR  OF GORISHANKER HERBALS VILL. SALEMPUR, NEAR PRIMARY SCHOOL, THANA BHAW AN ROAD, MUZAFFAR NAGAR,  UTTAR PRADESH-251001 PROPRIETORSHIP FIRM Address for service in India/Attorney address: PURVI & ASSOCIATES 18-A, GALI NO.7, PRATAP NAGAR,  MAYUR VIHAR PHASE-1, DELHI-110091 Proposed to be Used DELHI Retail or wholesale services for pharmaceu tical, veterinary and sanitary preparat ions and medical  supplies, Herbal  medicines, Herbs (Medicinal -), Herbal ext racts for medicinal purposes, Medicinal he rbal infusions, Extracts of medicinal  herbs, Advertising services re lating to pharmaceuticals,  Advertising services relating  to pharmaceuticals for the  treatment of diabetes. 4332"
	},
	{
		"page": 483,
		"trademark": "PROPERIOR",
		"details": "Priority claimed from 03/12/2021; Application No. : 1455225 ;Benelux   5312826    03/02/2022 NLMK INTERNATIONAL B.V. Strawinskylaan 1331, tower B, World Trade  Centre NL-1077 XX Amsterdam, The Netherlands A company organized and existing under the laws of Netherlands Address for service in India/Agents address: S.S. RANA & CO. 317, LAWYERS CHAMBERS, HIGH COURT OF DELHI, NEW DELHI - 110 003. Proposed to be Used DELHI Advertising; business management; business administration; offi ce functions; market studies;  compilation of information  into computer databases; procurement services for othe rs [purchasing goods and  services for other businesses];  business information; upda ting of advertising material; systemization of information into  computer databases; business  inquiries; providing business  information via a web site;  web indexing for commercial or advertising purposes. 4338"
	},
	{
		"page": 486,
		"trademark": "REFIT",
		"details": "5313149    03/02/2022 CREST EV 10, Princess Building, Ibrahim Re hmatullah Rd, near J.J. Hospital, Mumbai, Maharashtra 400003 A Partnership Firm Address for service in India/Attorney address: SANJOG PANDERE Vardhaman Dham, Flat 101, Sector 5,  Plot 4B, Kamothe, Navi Mumbai 410209 Used Since :12/12/2021 MUMBAI Advertising, business manage ment, business administ ration, offi ce functions 4341"
	},
	{
		"page": 489,
		"trademark": "EZEEPORT",
		"details": "5313306    04/02/2022 KAMLESHKUMAR CH HOTELAL RAJAK 18th FLOOR, D/1806 ROYAL OASIS, NEAR BILLA BO NG SCHOOL, JANKALYAN NAGAR, MALAD WEST, 400095 INDIVIDUAL Address for service in India/Agents address: PUNIT KUMAR GOYAL Office No.137, 1st floor, BC Wing, Sonam Shopping Centre, Golden  Nest Phase VI, Near Balaji Hospital, Mira Bhayandar Road,  Bhayandar East, Thane-401107 Proposed to be Used MUMBAI Business management services relating to  electronic commerce, Advertising servi ces for the promotion of e-commerce,  Organisation of exhibitions fo r business or commerce, Provision of informa tion and advisory services relating to e- commerce, Arranging of collect ive buying, Arranging the buying of goods for others, Arranging of buying and selling  contracts for third parties, Providing  advice relating to the analysis of cons umer buying habits, Arranging business  introductions relating to the buying and selling of products, A rranging of contracts for others  for the buying and selling of  goods, Advice on the an alysis of consumer buying habi ts and needs provided with th e help of sensory, quality and  quantity-related data, Trade marketing [o ther than selling], Import  agency services, Export an d import agencies, Goods  import-export agencies, Compilat ion of registers relating to importers, Ad visory and consultancy services relating to  import-export agencies, Business manageme nt advice relating to ma nufacturing business, Tran sportation fleet (business  management of -) [for others], Business  management in the field of transport  and delivery, Providing transportation  documentation for others [administrative  services], Data processing services in the fi eld of transportati on, On-lin e trading  services in which seller posts products to be auctioned and bi dding is done via th e Internet, Online  marketing, Online  retail services relating to jewelry, Retail  services relating to food, On line retail store services  relating to cosmetic and  beauty products, Demonstration of go ods and services by electronic means, also for the benefit  of the so-called  teleshopping an d homeshopping services,  Retail of third-party pre-paid cards fo r the purchase of entertainment services,  Business management of entertainment ven ues, Retail services in re lation to footw ear, Wholesale services in relation to  footwear, Retail services relating  to furniture, Wholesale services  relating to furniture, Book  club services retailing books  to its members, Subscrip tions (arranging of) to books, r eviews, newspapers or comic boo ks, Subscription s to electronic  journals, Retail services in relati on to festive decorati ons, Mail order retail services co nnected with clothing accessories,  Online retail services relating to clothi ng, Providing online marketplaces for sellers of goods and or ser vices, Provision of  an online marketplace for buyers an d sellers of goods and services. 4344"
	},
	{
		"page": 501,
		"trademark": "BELLASEN",
		"details": "5314150    04/02/2022 OJAS SINGH B-31, Ishaan-2, Opposite Karnavati club, S.  G. Highway, Ahmedabad, Gujarat - 380015. Services for providing food and drink, temporary accommodation,  restaurant services, cafe services, cafeteria services, bar ser vices,  cocktail lounges, catering services, self-service restaurant, etc. Individual Proposed to be Used AHMEDABAD Advertising; business management, orga nization and administra tion; office functions;  business management of  restaurants; business advice relating to  restaurant franchising; franchisin g services, namely, business management  assistance in the establishment and operation of restaurant s; arranging and conducting of  advertising events; arranging  and conducting of marketing events; arra nging and conduc ting of promotional events; co nducting of co mmercial events;  event marketing services. 4356"
	},
	{
		"page": 504,
		"trademark": "MINOFIX",
		"details": "5314279    04/02/2022 COSMOFIX TECHNOVATION PRIVATE LIMITED 306, Building No.2C, Business Classic CHS Ltd, Chinchol i Bunder Road, Malad West, Mumbai-400064, Maharashtra Manufacturing and marketing Active Proposed to be Used MUMBAI Advertising, business manage ment, business administ ration, offi ce functions 4359"
	},
	{
		"page": 506,
		"trademark": "Exil",
		"details": "5314427    04/02/2022 ELGON CROP SCIENCE (REPRESENTED BY  ITS PARTNER, MRS. ANITA KUMARI) Goyel Complex, Behind Petrol Pump Malout Road, Bathinda - 151001, Punjab PARTNERSHIP FIRM Address for service in India/Attorney address: RAVINDER NEGI D1/25, Mansa Ram Park, Uttam Nagar, New Delhi-110059 Proposed to be Used DELHI Trading, Marketing, Retail and  Wholesale of Fertilizers, Bio fertilizers, Agricultural Pest icides, Agricultur al Seeds, Seeds  for Fruit and Vegetables under class “35” 4361"
	},
	{
		"page": 507,
		"trademark": "Zim Zeb",
		"details": "5314430    04/02/2022 ELGON CROP SCIENCE (REPRESENTED BY  ITS PARTNER, MRS. ANITA KUMARI) Goyel Complex, Behind Petrol Pump Malout Road, Bathinda - 151001, Punjab PARTNERSHIP FIRM Address for service in India/Attorney address: RAVINDER NEGI D1/25, Mansa Ram Park, Uttam Nagar, New Delhi-110059 Proposed to be Used DELHI Trading, Marketing, Retail and  Wholesale of Fertilizers, Bio fertilizers, Agricultural Pest icides, Agricultur al Seeds, Seeds  for Fruit and Vegetables under class “35” 4362"
	},
	{
		"page": 508,
		"trademark": "SABISMLUXEcomerce Retail",
		"details": "5314502    04/02/2022 V V C REALINFRA PRIVATE LIMITED Transport Nagar, Madan Mohan Lahoti Auto Complex,  A B Road, Raghogarh, Guna, Madhya Pradesh, 473226 An Indian Company incorporated under the Companies Act, 2013 Address for service in India/Attorney address: SAIKRISHNA & ASSOCIATES B-140, SEC-51, NOIDA-201301 Proposed to be Used MUMBAI Wholesale ordering services; Sell ing of Merchandise in the field of a wide  variety of Products and Services; On-line  ordering services; Administrative processing of computerized purchase orders ; Bringing together,  for the benefit of  others, of a variety of goods enabling  customers to conveniently  view and purchase good s; on-line and e-commerce  trading services to facilitate  the sale of goods by others via a computer  network; Advertising, business management,  business administration, office functions; Organization of  exhibitions for commercial  or advertising purposes;  Commercial intermediation services; Providing business information  via a web site; Sales promotion for others;  Computerized database and file management; Online wholesal e and retail store services for general merchandise goods  and services; 4363"
	},
	{
		"page": 509,
		"trademark": "ECOMLUERETAIL Online Sales",
		"details": "5314503    04/02/2022 V V C REALINFRA PRIVATE LIMITED Transport Nagar, Madan Mohan Lahoti Auto Complex,  A B Road, Raghogarh, Guna, Madhya Pradesh, 473226 An Indian Company incorporated under the Companies Act, 2013 Address for service in India/Attorney address: SAIKRISHNA & ASSOCIATES B-140, SEC-51, NOIDA-201301 Proposed to be Used MUMBAI Wholesale ordering services; Sell ing of Merchandise in the field of a wide  variety of Products and Services; On-line  ordering services; Administrative processing of computerized purchase orders ; Bringing together,  for the benefit of  others, of a variety of goods enabling  customers to conveniently  view and purchase good s; on-line and e-commerce  trading services to facilitate  the sale of goods by others via a computer  network; Advertising, business management,  business administration, office functions; Organization of  exhibitions for commercial  or advertising purposes;  Commercial intermediation services; Providing business information  via a web site; Sales promotion for others;  Computerized database and file management; Online wholesal e and retail store services for general merchandise goods  and services; 4364"
	},
	{
		"page": 510,
		"trademark": "Halyconluxe Merchant",
		"details": "5314504    04/02/2022 V V C REALINFRA PRIVATE LIMITED Transport Nagar, Madan Mohan Lahoti Auto Complex,  A B Road, Raghogarh, Guna, Madhya Pradesh, 473226 An Indian Company incorporated under the Companies Act, 2013 Address for service in India/Attorney address: SAIKRISHNA & ASSOCIATES B-140, SEC-51, NOIDA-201301 Proposed to be Used MUMBAI Wholesale ordering services; Sell ing of Merchandise in the field of a wide  variety of Products and Services; On-line  ordering services; Administrative processing of computerized purchase orders ; Bringing together,  for the benefit of  others, of a variety of goods enabling  customers to conveniently  view and purchase good s; on-line and e-commerce  trading services to facilitate  the sale of goods by others via a computer  network; Advertising, business management,  business administration, office functions; Organization of  exhibitions for commercial  or advertising purposes;  Commercial intermediation services; Providing business information  via a web site; Sales promotion for others;  Computerized database and file management; Online wholesal e and retail store services for general merchandise goods  and services; 4365"
	},
	{
		"page": 517,
		"trademark": "KAJARIA",
		"details": "5314683    04/02/2022 Kajaria Ceramics Limited J-1/ B-1(Extension) Mohan Cooperative Industria l Estate, Mathura Road, New Delhi-110044, India A company organized and existing under the Indian Companies Act Address for service in India/Agents address: S.S. RANA & CO. 317, LAWYERS CHAMBERS, HIGH COURT OF DELHI, NEW DELHI - 110 003. Used Since :01/01/1987 To be associated with: 1481120, 1713523, 2750879, 3686620, 3745886, 3748885, 3748886, 4289174, 4984265, 5043857 DELHI Advertising, business promotions , business functions in respect  of all kind of floor and  wall tiles, sanitary ware,  hardware, building and construction material, lighting fixtures. 4372"
	},
	{
		"page": 520,
		"trademark": "BOFAST",
		"details": "5314839    04/02/2022 ANEY K. KOTTIYATTIL, KANNAMKULANGARA, KOORKENCHERY P. O., THRISSUR – 680 001, KERALA STATE, INDIA SOLE PROPRIETORSHIP Address for service in India/Attorney address: LAWYERS' ARCADE SUPEX CORNER, 2ND FLOOR, SUB REGISTRAR OFFICE ROAD, NEAR GOVT, TRAINING SCHOOL, KANNUR-670 002.  KERALA, INDIA. Proposed to be Used CHENNAI E-COMMERCE, SUPPLY CHAIN MANAGEMENT, BUSINESS MANAG EMENT OF LOGISTICS FOR OTHERS, ADVERTISING  RELATING TO TRANSPORT  & DELIVERY, BUSINESS MANAG EMENT IN THE FIELD OF  TRANSPORT & DELIVERY,  BUSINESS ADMINISTRATION IN THE  FIELD OF TRANSPORT &  DELIVERY, BUSINESS ANAL YSIS AND INFORMATION  SERVICES, AND MARKET RESEARCH,  BUSINESS ADMINISTRATION, BUS INESS MANAGEMENT ASSISTANCE,  BUSINESS MANAGEMENT, BUSINESS PROMOTION, BUSINE SS INTERMEDIARY SERVICES , BUSINESS NETWORKING,  RETAILING, WHOLESALING, SUPPLYING, DISTRIBUTING, MARKETING, TRADING, ONLINE SALES. 4375"
	},
	{
		"page": 529,
		"trademark": "Lendingkart Cred8",
		"details": "5315578    05/02/2022 LENDINGKART TECHNOLOGIES PRIVATE LIMITED A-602, 6th Floor, The First, The First Avenue Road, Behind Ke shavbaug Party Plot Vastrapur, Ahmedabad, 380015, Gujarat,India Body Incorporate Address for service in India/Agents address: SUNDEEP KUMAR PARASHAR 2F CS 03, SECOND FLOOR, ANSAL  CORPORATE SUITES, ANSAL PLAZA,  SECTOR-1, VAISHALI, GHAZIABAD- 201010,DELHI NCR. Used Since :14/10/2021 To be associated with: 4027083, 4027225, 4080139 AHMEDABAD Business management and administrati on, compilation, processing and analysi s of data for bu siness and business  management and financial marketing. 4384"
	},
	{
		"page": 530,
		"trademark": "VISTA SQUARE",
		"details": "5315647    05/02/2022 PEERAGE BUILDWELL PRIVATE LIMITED G-25A, RING ROAD MALL, PLOT NO. 21, MANG LAM PLACE, SECTOR-3, ROHINI, DELHI-110085 AN INDIAN COMPANY Address for service in India/Agents address: MANGLA & ASSOCIATES. 1961, KATRA SHAHN SHAHI, CHAND NI CHOWK, DELHI - 110 006. Proposed to be Used DELHI SHOPPING MALL. 4385"
	},
	{
		"page": 537,
		"trademark": "MN GROUP OF COMPANIES",
		"details": "5316331    05/02/2022 M/S. ARIHANTA INDUSTRIES 5/120, Sant Nirankari Colony, Delhi - 110009 (INDIA) A Partnership Company Address for service in India/Attorney address: DEY & KUMHAR CO. T-62, LGF, BHOGAL ROAD, BHOGAL  JANGPURA, NEW DELHI-110014 (INDIA). Proposed to be Used DELHI Advertising; business management,  organization and administrati on; office functions in Class 35. 4392"
	},
	{
		"page": 540,
		"trademark": "Elder Social",
		"details": "5316948    07/02/2022 M/S HABEMUS SOLUTIO LLP HOUSE NO 44/2679, B 17, FL AT NO 501, PAN RICHMONDE APARTMENTS , ASHOKA ROAD, ERNAKULAM, PIN- 682017 LIMITED LIABILITY PARTNERSHIP Address for service in India/Attorney address: AJAY R KAMATH TC 16/570-1, EVRA-55, Jagathy, Thycaud, PO, Thiruvananthapuram-695014 Proposed to be Used CHENNAI ADVERTISING / PUBLICITY; ADVERTISING  AGENCY SERVICES / PUBLICITY AG ENCY SERVICES; PROVIDING BUSINESS  INFORMATION; BUSINESS INQUIRIES; BUSINESS ORGANIZATION CONSULTANCY; PROFESSIONAL BUSINESS  CONSULTANCY; COMMERCIAL INFORM ATION AGENCY SERVICE S; PROVIDING COMMERCIAL INFORMATION AND  ADVICE FOR CONSUMERS IN THE CHOICE OF PRODUCTS  AND SERVICES; MARKETING; SALES PROMOTION FOR  OTHERS; WRITING OF PUBLICITY TEXTS. 4395"
	},
	{
		"page": 542,
		"trademark": "BIOWOLK HEALTHCARE",
		"details": "5317446    07/02/2022 KAPIL GUPTA PROPRIETOR OF M/S BIOWOLK HEALTHCARE SCO 243, Basement,Sector 12,Karnal,Haryana, (India) Proprietorship Address for service in India/Attorney address: RAMESH K. GAUTAM & ASSOCIATES 451, OPP. BSNL TOWER, AMBEDKAR ROAD, ARTHALA, MOHAN NAGAR, GHAZIABAD-201007,U.P,M- 09871034747,09990034747 Proposed to be Used DELHI Wholesale And Retail Serv ices Relating To Pharmaceutical , Medicinal And Veterinary Pr eparation ,Online Marketing  Services, Online Ordering Services, Online Adver tising, Online  Auctioneering Services 4397"
	},
	{
		"page": 543,
		"trademark": "ARCON ENGINEERS",
		"details": "5317706    07/02/2022 JATINDER KUMAR TRADING AS ARCON ENGINEERS KHASRA NO. 49/13/1/1, KHATA NO. 591/696, JANDIALI CH OWK, VASIKA NO. 1738, BUDEWAL ROAD, CHD ROAD, NEAR  AKAL ACADEMY, TEH. SAHNEWAL , LUDHIANA 141112 (PB.) PROPRIETORSHIP Address for service in India/Attorney address: MAHTTA & CO 43-B/3, UDHAM SINGH NAGAR, LUDHIANA. 141001 (PUNJAB) Used Since :01/09/2021 DELHI Advertising, Business Administra tion & Management of Wholesale & Retail Outlets; Onli ne Marketing , Marketing ,  Trading, Import & Export, relating to Lubricants, Lubricating  oils [industrial lubricants], Sp ray-on lubricants, Industrial  greases, Industrial oil, Syntheti c lubricants in the form of aer osols, Graphite lubricants, Lu bricants for machines & Petrol. 4398"
	},
	{
		"page": 546,
		"trademark": "Bakkuendo",
		"details": "ABHISHEK GULATI Flat No. 601, Ground Floor, Sarvhit Apartments, Pocket A, Sec 17, Dwarka, New Delhi – 110075 Proprietor Address for service in India/Agents address: MRS. MEENA BANSAL 96, SUKHDEV VIHAR, MA THURA ROAD, NEW DELHI-25 Proposed to be Used DELHI Advertising; business management; busin ess administration; office  functions; database mana gement; compilation and  collection of data, information  and statistics for business; retail store and  online retail store services for computer  software and equipment; using technologies that include the inte rnet of things (IoT), blo ckchain, robotics,  software as a  service (SaaS), platforms as a service (PaaS) and artificial intelligence, Wholesale & Reta il service in relation to  information technolog y equipment, Business Co nsultancy relating to  the administration of  information technology,  Business management consulting services in the field of information technology, Bu siness consultation  services in the  fields of information technology, computers, software,  cloud computing, and ente rprise architecture; database  management services; IT outsourcing services;  business risk assessment and management services 4401"
	},
	{
		"page": 548,
		"trademark": "MATLIN",
		"details": "5319055    08/02/2022 SAROM FAB PVT. LTD. THAKOR INDUSTRIAL ESTATE, KIROL VILLAGE, PR EMIER ROAD, VIDYAVIHAR (WEST), MUMBAI - 400086,  MAHARASHTRA, INDIA. Proposed to be Used MUMBAI ADVERTISING AND MARKETING, TRADING,  WHOLESALE, RETAIL  EXPORT, IMPORT, DISTRIBUT ION, OUTLETS, SHOPS,  ONLINE SELLING, ORDERING SERV ICES, BUSINESS ADMINISTRATION  AND BUSINESS MANAGEMENT SERVICES,  OFFICE FUNCTIONS I NCLUDING IN CLASS 35 4403"
	},
	{
		"page": 549,
		"trademark": "CXE",
		"details": "5319251    08/02/2022 TANDON HOLDINGS LIMITED UNIT NO. 602, 6TH FLOOR, FLORAL DECK PLAZA,  MIDC OPP, SEEPZ, ANDHERI (EAST)MUMBAI -400093. PUBLIC LIMITED Address for service in India/Attorney address: BHANSALI KARAN KETAN VS IPR AND LEGAL ADVISORS B 005 SURYA KIRAN BUILDING , NEAR ST. MARY SCHOOL,  AWDHUT NAGAR, DAHISAR  EAST, MUMBAI - 400068, MAHARASHTRA Proposed to be Used MUMBAI BUSINESS MANAGEMENT AND MARKETING INCLUDED  IN CLASS 35 4404"
	},
	{
		"page": 552,
		"trademark": "Konverj-Zeus",
		"details": "5319953    08/02/2022 KAVEER CONSULTING SERVICES (OPC) PVT. LTD G/602, Saidham, Opp. St. Marys School,  P.K. Road, Mulund West, Mumbai - 400080 Body Incorporate Address for service in India/Attorney address: VINAYAK TYAGI Third Floor, B-43, Sector-2, Noida-201301 Proposed to be Used MUMBAI Advertising, business manage ment, business administ ration, offi ce functions. 4407"
	},
	{
		"page": 553,
		"trademark": "AGROTIE",
		"details": "5320115    08/02/2022 AGROTIE SERVICES LLP NO. 2/5, 4TH MAIN ROAD, TATA SI LK FARM, JAYANAGAR, BENGALURU - 560082 A Limited Liability Partnershi p registered unde r LLP Act, 2008 Address for service in India/Attorney address: VINODKUMAR KOTABAGI NO.25/1, UTSAV, MATRUSHREE LAYOUT, GANAGOND ANAHALLI MAIN ROAD, KARIOBANAHALLI, BENGALURU -560  073, PH:9448335243 Used Since :10/02/2017 CHENNAI ONLINE AND OFFLINE MARKETING RETAIL AND WHOLES ALE OUTLET FOR SALE OF  AGRICULTURAL PRODUCTS. 4408"
	},
	{
		"page": 554,
		"trademark": "ITALINO [LABEL]",
		"details": "5320811    09/02/2022 KRISHNA WALL AND GLAZE TILES PRIVATE LIMITED  A COMPANY INCORPORATED  UNDER THE COMPANIES ACT,  1956 8-A , NATIONAL HIGHWAY, NR. DARIYALAL RESORT, JAMBUDIA , MORBI – 363642, GUJARAT, INDIA. NEW Address for service in India/Attorney address: T.C.PATEL & CO., 229, GOLDEN PLAZA, OPP. ARYA SAMAJ MANDIR, OUT  SIDE RAIPUR GATE, KANKARIA, AHMEDABAD - 380 022 Used Since :17/07/2004 AHMEDABAD SHOWROOM, EXPORT, IMPORT,  TRADING AND RETAIL OUTLET ENGAGE TO  S. S. KITCHENSI NK, KITCHEN WARE  ITEMS, HARDWARE AND FURNITURE FITT INGS, SANITARYWARE, BATH ACCESS ORIES, SANITARY PRODUCTS,  CERAMIC PRODUCTS, CERAMIC TILES,  CERAMIC RAW MATERIALS AND BUILDIN G MATERIALS INCLUDED IN CLASS- 35 4409"
	},
	{
		"page": 555,
		"trademark": "KONG POSH TEA",
		"details": "5321287    09/02/2022 MUDASIR AHMAD MALIK TRADING AS MALIK TRADERS Malik Traders, Hospital Road, Kulgam - 192231, Jammu and Kashmir Proprietorship Firm Address for service in India/Attorney address: NADAR VENNILA C-102, Calypso, Bloomfield, Amit Enterprises Housing,Nr. Gold  Gym, NH-4, Mumbai-Bangalore Hi ghway,Sinhagad Road, Ambegaon  (BK), Pune-411 046  Proposed to be Used DELHI Retail services for teas 4410"
	}
]