[{"page_no":"1,journal no. 2048","trademark":"CCS CAMPUS","details":"3523708    11/04/2017 DEEPAK KUMAR V illage Mukimpur, Post Office Dipalpur, Sonipat-131001, Haryana Individual Address for service in India/Attorney address: SANJEEV KUMAR A G-7, Ground Floor, Shalimar Bagh, New Delhi - 110088 Used Since :03/03/2017 DELHI Education; Providing of training; Entertainment; Spo rting and cultural activities THIS IS CONDITION OF REGISTRATION THAT MARK SHOULD BE USED AS A WHOLE.. 4109","tm_class":"41","tm_phonetics":"KKS KMPS"},{"page_no":"8,journal no. 2048","trademark":"GATEFORALL","details":"4066437    24/01/2019 SAGAR KHURANA H ouse No- P15, Street No -3, Singh Colony, Rudrapur, U.S.Nagar-263153 AN INDIVIDUAL Address for service in India/Attorney address: KANIKA JAIN L egalRaasta Technologies Pvt. Ltd, B-300 Saraswati Vihar Pitampura Delhi -110034 Proposed to be Used D ELHI Education services 4116","tm_class":"41","tm_phonetics":"KTFRL"},{"page_no":"9,journal no. 2048","trademark":"MUDRA NRITYA ACADEMY","details":"4126053    23/03/2019 ANKITA RAJESH HEDAU M ANOGAT HO. SOC. PLOT NO. 502, ROOM NO. B/25, CHARKOP MARKET, KANDIWALI WEST, MUMBAI 67. ACTIVE Address for service in India/Agents address: RAHUL DAHAPUTE C ORP AID CONSULTANCY SERVICES PRIVATE LIMITED Proposed to be Used M UMBAI Teaching / educational services / instruction servic es,vocational guidance [education or training advice],coaching  [training],physical education,health club services [health and fitness training] included in class 41. 4117","tm_class":"41","tm_phonetics":"MTR NRTY KTM"},{"page_no":"10,journal no. 2048","trademark":"WILD WILD PUNJAB","details":"4127969    26/03/2019 LUV RANJAN R -11/40, Raj Nagar, Ghaziabad Individual Address for service in India/Attorney address: BAGAI & CO. 3 27, LAWYERS CHAMBERS, HIGH COURT OF DELHI, NEW DELHI-110003 Proposed to be Used D ELHI Media, entertainment, cinema presentations, cinemato graph films, film production, movie studios, movie theatre  presentations, production of radio and television programs, production of shows and films, publications of books and  texts, providing on-line electronic publications, not downloadable, recording studio services, movie studios, managing,  distributing and monetizing the content rights, television entertainment, cine films (rental of), cinema facilities (providing),  dubbing, editing (video tape), entertainment information, film production, movie projectors and accessories (rental of),  motion pictures (rental of), movie studio, movie theatre facilities (providing), recording studio services, television  entertainment, television programmes, production of radio shows, theatre productions, video editing, video film  production. 4118","tm_class":"41","tm_phonetics":"WLT WLT PNJB"},{"page_no":"17,journal no. 2048","trademark":"JUGGERNAUT","details":"4246048    25/07/2019 JUGGERNAUT BOOKS PRIVATE LIMITED trading as ;JUGGERNAUT BOOKS PRIVATE LIMITED 118, 4TH FLOOR KS HOUSE, SHAHPUR JAT , NEW DELHI-110 049, INDIA. SERVICE PROVIDER Address for service in India/Attorney address: SATYAJIT SARNA I -11 JANGPURA EXTENSION NEW DELHI 110014 Used Since :17/09/2015 DELHI PUBLISHING SERVICES (INCLUDING ELECTRONIC PUBLISHING  SERVICES), MUSIC PUBLISHING, NEWSPAPER  PUBLISHING, BOOK PUBLISHING, MAGAZINE PUBLISHING, MULTIMEDIA PUBLISHING, MICRO-PUBLISHING,  ELECTRONIC PUBLISHING, PUBLISHING OF REVIEWS, ELECTRONIC DESKTOP PUBLISHING, PUBLISHING OF STORIES,  PUBLISHING OF NEWSPAPERS, PUBLISHING OF DOCUMENTS, PUBLISHING OF MAPS, PUBLISHING OF BOOKS,  PUBLISHING OF JOURNALS, PROVISION OF ENTERTAINMENT SERVICES THROUGH THE MEDIA OF PUBLICATIONS,  LENDING OF BOOKS AND OTHER PUBLICATIONS AND RENTAL OF PRINTED PUBLICATIONS. 4125","tm_class":"41","tm_phonetics":"JJRNT"},{"page_no":"19,journal no. 2048","trademark":"THE SOLUTIONIST","details":"4249138    29/07/2019 RAJIV BALI E -56, 3rd Floor, Naraina Vihar, New Delhi-110028 Proprietor Address for service in India/Attorney address: ANIKET BHATTACHARYYA A -19, Ground floor, Jangpura Extension Proposed to be Used D ELHI Adult education services relating to management; Adu lt education services relating to intellectual property; Adult  education services relating to banking; Adult education services relating to finance; Adult education services relating to  commerce; Adult education services relating to accounting; Arrangement of conferences for educational purposes;  Arranging and conducting of workshops; Arranging and conducting seminars and conferences; Arranging and conducting  of training courses; Arranging and conducting lectures; Arranging and conducting conferences relating to advertising;  Arranging and conducting professional workshops; Arranging and conducting seminars relating to business; Conducting  educational workshops in the field of business; Conducting of educational courses relating to business; Conducting of  educational conferences; Conducting of educational courses related to business management; Conducting of educational  courses in business management; Courses (Training)- relating to finance; Courses (Training)- relating to business  management; Courses (Training)- relating to law; Education and training in the field of business management. The Applicant wishes to claim rights in all colours. 4127","tm_class":"41","tm_phonetics":"0 SLXNST"},{"page_no":"20,journal no. 2048","trademark":"HOWZAT","details":"4251998    31/07/2019 HOWZAT GAMES PRIVATE LIMITED 1 211, 12th Floor, DLF Tower B, Jasola District Centre, New Delhi-110025 Private Limited Company Address for service in India/Agents address: LUTHRA & LUTHRA. 1 03-104, ASHOKA ESTATE 24, BARAKHAMBA ROAD, NEW DELHI - 1. Used Since :01/06/2019 DELHI Entertainment Services, Providing Online Computer Ga mes; Providing Online Information and magazines, not  downloadable, featuring information in the field of computer games; organisation of games and competitions; organisation  and provisions of games and competitions via the internet; organisation and presentation of shows, competitions, games,  concerts and entertainment events; Publication of multimedia material online relating to books, magazines journals,  software and games. 4128","tm_class":"41","tm_phonetics":"HST"},{"page_no":"27,journal no. 2048","trademark":"FAIRYLAND","details":"4398214    04/01/2020 SAROJ URMIL BHATT, SOLE PROPRIETOR OF FAIRYLAND PRE- SCHOOL 8, PRANKUNJ SOCIETY, KANKARIA ROAD, MANINAGAR, AHMEDABAD – 380 028, GUJARAT, INDIA. A SOLE PROPRIETARY CONCERN Address for service in India/Agents address: Y. J. TRIVEDI & CO. Y AGNAJYOT, OPP. KASHIRAM AGRAWAL HALL, POLYTECHNIC, AHMEDABAD 380 015 Used Since :01/04/2000 AHMEDABAD EDUCATION SERVICES; PROVIDING OF TRAINING; ENTERTAIN MENT; SPORTING AND CULTURAL ACTIVITIES;  TEACHING; ORGANIZATION OF EVENT FOR CULTURAL OR EDUCATIONAL PURPOSES; ARRANGING AND CONDUCTING  OF WORKSHOPS [TRAINING]; PUBLICATION OF ELECTRONIC BOOKS AND JOURNALS ON- LINE, EDUCATION SERVICES  RELATING TO BUSINESS FRANCHISE MANAGEMENT. 4135","tm_class":"41","tm_phonetics":"FRLNT"},{"page_no":"33,journal no. 2048","trademark":"STARK SCREEN PRODUCTIONS","details":"4676140    27/09/2020 SUSHIL DINANATH SINGH F lat/Block No. A/107, Sai Leela Residency Village, Nandivali Block , Malang Road City Kalyan East State MAHARASHTRA District  THANE , Pin 421306 IndividualProprietorship Address for service in India/Agents address: GIGI JOSEPH K J 4 8, Opp. Kendriya Sadan,100 Ft Road, Koramangala,Bangalore-560034. Proposed to be Used M UMBAI Production and distribution of cinema films,Producti on and distribution of sound, movie and video recordings,Film  distribution services,Movie schedule information services,Cinema schedule information services,Scriptwriting services 4141","tm_class":"41","tm_phonetics":"STRK SKRN PRTKXNS"},{"page_no":"36,journal no. 2048","trademark":"CCSD (CERTIFIED CYBER SECURITY DEFENDER)","details":"4685510    03/10/2020 DASHAGRIIVA INFOTECH LLP 3 04, SHUBH APARTMENT, NEAR NOBLE SCHOOL, KRISHNA NAGAR, AHMEDABAD - 382345, GUJARAT, INDIA Limited Liability Partnership (LLP) Address for service in India/Attorney address: NAVDEEP & ASSOCIATES B  - 13, NEW YOGESHWAR SOCIETY, NR. PARAS PRABHU SOCIETY, OPP. VISHAL NAGAR, ISANPUR, AHMEDABAD -  382443, GUJARAT Proposed to be Used A HMEDABAD Education; Providing of training; Entertainment; Spo rting and cultural activities REGISTRATION OF THIS TRADE MARK SHALL GIVE NO RIGHT TO THE EXCLUSIVE USE OF THE.Certified Cyber Security  Defender.. THIS IS SUBJECT TO ASSOCIATION WITH REGISTERED/PENDING REGISTRATION NO..4685511.. 4144","tm_class":"41","tm_phonetics":"KKST (SRTFT SBR SKRT TFNTR)"},{"page_no":"37,journal no. 2048","trademark":"APPRENTICE)","details":"4685512    03/10/2020 DASHAGRIIVA INFOTECH LLP 3 04, SHUBH APARTMENT, NEAR NOBLE SCHOOL, KRISHNA NAGAR, AHMEDABAD - 382345, GUJARAT, INDIA Limited Liability Partnership (LLP) Address for service in India/Attorney address: NAVDEEP & ASSOCIATES B  - 13, NEW YOGESHWAR SOCIETY, NR. PARAS PRABHU SOCIETY, OPP. VISHAL NAGAR, ISANPUR, AHMEDABAD -  382443, GUJARAT Proposed to be Used A HMEDABAD Education; Providing of training; Entertainment; Spo rting and cultural activities REGISTRATION OF THIS TRADE MARK SHALL GIVE NO RIGHT TO THE EXCLUSIVE USE OF THE.Certified Cyber Security  Apprentice.. THIS IS SUBJECT TO ASSOCIATION WITH REGISTERED/PENDING REGISTRATION NO..4685511, 4685510.. 4145","tm_class":"41","tm_phonetics":"APRNTS)"},{"page_no":"40,journal no. 2048","trademark":"VIBRANT PUBLISHERS","details":"4692947    08/10/2020 AVANI DEEP UDESHI TRADING AS VIBRANT PUBLISHERS A 1205, Paras Business Center, Kasturba Road No. 1, Borivali (East), Mumbai – 400 066 Service Provider SINGLE FIRM Address for service in India/Attorney address: LEMARK 2 /A-1, KESLEY CHS, RAM NAGAR, BORIVALI WEST, MUMBAI- 400092 Used Since :28/06/2010 MUMBAI EDUCATION; PUBLICATION SERVICES; PUBLICATION OF BOOK S; ALL INCLUDED IN CLASS 41 4148","tm_class":"41","tm_phonetics":"FBRNT PBLKSHRS"},{"page_no":"47,journal no. 2048","trademark":"OPENBOOK EDUCARE","details":"4709651    20/10/2020 VAISHALI MAKRAND DESAI 4 03-31,Sonam Shree Phase 12,New Golden Nest , Bhayandar 401105 An Indian Inhabitant Address for service in India/Attorney address: NRN SUITS AND LAWS LLP 1 7 SAROJ SADAN,S K PATIL LANE ,DAFTARI ROAD,MALAD EAST,MUMBAI -97 Proposed to be Used M UMBAI Providing Of Education, Instruction And Training Ser vices, Organizing Various Kinds Of Events And Programmes,  Exhibitions For Cultural Or Educational Purpose, Education Conferences, Seminars, Consultancy, Research, Online  Education, Educational Examination, Consultancy Services, Workshop For Educational Purpose, Arranging Educational  Events, Professional Consultancy Relating To Education, Vocational Education And Training, Career Counselling,  Production Of Video Tapes For Educational Training, Educational Tour, Publication Of Books, Conducting Entertainment  Exhibitions, Planning Of Shows, Event Planning Consultation, Party Planning Services, Arranging And Conducting Of  Educational And Entertainment Events For Charitable Purposes, Information About Entertainment Events Provided Via  Online Networks And The Internet Entertainment Services In The Nature Of Organizing And Arranging Social  Entertainment Events, Production And Photography Services, Production Of Audio, Video, Music, Films Including Cinema  And Cinematographic Film, Tv And Tv Shows Animation, Radio, Motion Picture, Live Entertainment Production Of Special  Effects For Films And Television, Production Of Animated And Live Action Programmes Production Of Films For  Entertainment Purpose Production Of Pre-Recorded Cinema Films. 4155","tm_class":"41","tm_phonetics":"OPNBK TKR"},{"page_no":"51,journal no. 2048","trademark":"GOLDMINES MOVIES","details":"4715512    23/10/2020 GOLDMINES TELEFILMS PRIVATE LIMITED 6 01-A/1 & A2, B-Wing, 6th Floor, Palm Court M Premises CHS Ltd, Above D Mart, Link Road, Malad (West), Mumbai - 400064,  Maharashtra A Private Limited Company Registered under The Companies Act 1956 Address for service in India/Attorney address: IPR LAW ASSOCIATES (MUMBAI) 2 01 A, 2nd Floor, Raheja Plaza-I, LBS Marg, Ghatkopar (W), Mumbai - 400 086. Used Since :22/11/2013 MUMBAI Providing education and entertainment services; Audi o video production; Cable television programming [scheduling]:  Radio entertainment services; Video production services; Music recording and entertainment services; Audio, video and  multimedia production, and photography; Preparation of entertainment programmes for broadcasting 4159","tm_class":"41","tm_phonetics":"KLTMNS MFS"},{"page_no":"53,journal no. 2048","trademark":"QUANTO LIFE","details":"4719342    26/10/2020 Sudhir Gupta alias Quanto Shivo O pp: Kaul Nursing Home, Indira Colony, Naya Bazar, Gwalior 474009 in the State of Madhya Pradesh within the Union of India. An Indian National. Address for service in India/Attorney address: KRISHNA & SAURASTRI ASSOCIATES LLP 7 4/F, VENUS, WORLI SEA FACE, MUMBAI – 400018 Used Since :23/09/2017 MUMBAI Education; providing online and offline training inc luding meditation training, health and fitness training; training relating  to spirituality and spiritual activities; conducting online and offline classes, master classes, lectures, workshops,  seminars, conventions, conferences, exhibitions and camps; providing online and offline manuals and teaching materials. 4161","tm_class":"41","tm_phonetics":"KNT LF"},{"page_no":"55,journal no. 2048","trademark":"KIDS WITH PASSPORTS","details":"4735914    06/11/2020 TEENA PAUL C hithaary Elite, Arekere, Bengaluru 560076 Educational Services Individual Person Proposed to be Used C HENNAI Educational Service T he mark should be used as a whole. 4163","tm_class":"41","tm_phonetics":"KTS W0 PSPRTS"},{"page_no":"60,journal no. 2048","trademark":"SHYAM WORLD SCHOOL","details":"4810162    06/01/2021 SHYAM KNOWLEDGE PARK SHIKSHA SAMITI E -562 LALKOTHI SCHEME, JAIPUR (RAJ.) Society Address for service in India/Agents address: G. D. BANSAL & ASSOCIATES. M -118-B, MAHESH COLONY, LAXMI MANDIR PHATAK, JAIPUR - 302 015. (RAJASTHAN) Used Since :27/02/2007 To be associated with: 4537857 AHMEDABAD Education; providing of training; Entertainment; Spo rting and cultural activities. ASSOCIATED WITH TRADEMARK NUMBER- 4534749 & 4537857. 4168","tm_class":"41","tm_phonetics":"SHYM WRLT SKHL"},{"page_no":"62,journal no. 2048","trademark":"WHISTL","details":"4831082    22/01/2021 RAGHAV SHARMA 4 01, Archi The Divine, Near Choudhury Hospital, Hiranmagri Sector 4, Udaipur – 313002, Rajasthan Proprietor Address for service in India/Attorney address: SNEHA MANJOORAN F -97, 4th Floor, Anna Nagar (East), Chennai - 600102, Tamil Nadu.  Proposed to be Used A HMEDABAD EDUCATION; PROVIDING OF TRAINING; ENTERTAINMENT; SPO RTING AND CULTURAL ACTIVITIES 4170","tm_class":"41","tm_phonetics":"WSTL"},{"page_no":"67,journal no. 2048","trademark":"JOY TO THE WORLD","details":"4872771    20/02/2021 M/S. SATHIYAM MEDIA VISION PRIVATE LIMITED N o.1, kamaraj Park Street, Royapuram, Chennai – 600 013, Tamil Nadu Company incorporated Address for service in India/Agents address: D. RAJAKUMAR F 2 Meadows Nest, 182/52, Red Hills Road, Pudur, Ambattur, Chennai-600053. Used Since :15/12/2014 CHENNAI Conducting entertainment events, cultural events, li ve sports events, educational events, entertainment and cultural  activities, Organization and presentation of shows, competitions, games, concerts and entertainment events. SUBJECT TO USE THE MARK AS A WHOLE AS REPRESENTED IN THE FORM OF APPLICATION. 4175","tm_class":"41","tm_phonetics":"J T 0 WRLT"},{"page_no":"68,journal no. 2048","trademark":"AWARDS","details":"4872957    20/02/2021 MR. VENKAT ADITHYA PALURI F LAT 103, NAVYA ARCADE, ROAD NO. 1, RAMAKRISHNAPURAM, KOTHAPET, SAROORANGAR, HYDERABAD - 500035,  RANGA REDDY DISTRICT, TELANGANA. Individual Address for service in India/Attorney address: PUVVULA VINAY KUMAR E eva IP & IT Services Pvt Ltd, 1st Floor, HIG 139, Bharat Nagar Colony, Moosapet, Hyderabad - 500018, Telangana Proposed to be Used C HENNAI Sporting and cultural activities; Organisation of co mpetitions and awards; Arranging of award ceremonies; Arranging and  conducting of conferences, congresses, seminars and training workshops; Arranging and conducting of workshops and  seminars in self-awareness. SUBJECT TO USE THE MARK AS A WHOLE AS REPRESENTED IN THE FORM OF APPLICATION. 4176","tm_class":"41","tm_phonetics":"AWRTS"},{"page_no":"73,journal no. 2048","trademark":"ST MARY'S LOTTERY AGENCY","details":"4888423    03/03/2021 VINOD JOSEPH M AKKAPARAMBIL, PALARIVATTOM, ERANAKULAM, KERALA-682025. SOLE PROPRIETOR Address for service in India/Attorney address: ATHUL.C.K. S AROVARAM (H), CHERUKUNNUMMAL, MUNDUPALAM, PANTHEERANKAVU POST, CALICUT-673019, KERALA. Proposed to be Used C HENNAI LOTTERY SERVICES 4181","tm_class":"41","tm_phonetics":"ST MR'S LTR JNS"},{"page_no":"75,journal no. 2048","trademark":"LIMITED","details":"4890308    04/03/2021 CREATIVE SOUL VFX STUDIO PRIVATE LIMITED F LAT NO 206 , BM GLORIETTA BLOCK F , BOREWELL ROAD , NALLURAHALLI WHITEFIELD BANGALORE 560066 THE TRADE MARK ACT - 1999 Address for service in India/Attorney address: NEWTON REGINALD N o 6, Dhanammal Street Spurtank Road Chetpet Chennai - 600031 Proposed to be Used C HENNAI Training; Coaching [training]; Training consultancy;  Personal development training; Training and further training for  personnel development; Training and further training for personnel, team and organisational development; Academic  mentoring of school age children; Training courses in strategic planning relating to advertising, promotion, marketing and  business; Business education services; Business training consultancy; Education; Education services; Educational  consultancy No exclusive right over the descriptive matters separately except as substantially shown in the representation of the mark. 4183","tm_class":"41","tm_phonetics":"LMTT"},{"page_no":"80,journal no. 2048","trademark":"CERTIFIED EMPATHIC PROFESSIONAL","details":"4901774    12/03/2021 RASHA MOHAMMED KUTTY C HACKU PURAKKAL, KARULAI, MALAPPURAM, KERALA-679330. SOLE PROPRIETOR Address for service in India/Attorney address: ATHUL.C.K. S AROVARAM (H), CHERUKUNNUMMAL, MUNDUPALAM, PANTHEERANKAVU POST, CALICUT-673019, KERALA. Proposed to be Used C HENNAI EDUCATION AND INSTRUCTION SERVICES:, TRAINING COURSE :, AWARDING OF EDUCATIONAL CERTIFICATES:,  ARRANGING AND CONDUCTING SEMINARS AND WORKSHOPS. 4188","tm_class":"41","tm_phonetics":"SRTFT MP0K PRFKSNL"},{"page_no":"99,journal no. 2048","trademark":"SERENDIPITY","details":"5183778    22/10/2021 SUNIL KANT MUNJAL 1 A, Friends Colony (West), New Delhi – 1100 65 Individual Address for service in India/Attorney address: WORLDWIDE INTELLEC 3 13, BEST SKY TOWER, NETAJI SUBHASH PLACE, PITAMPURA, NEW DELHI-34 Used Since :11/08/2016 To be associated with: 2938903 DELHI Entertainment, sporting & cultural activities includ ing organizing cultural and arts events; art exhibitions; arranging and  conducting colloquium, conferences, congresses, seminars, symposiums, workshops, organizing competitions; providing  a website featuring information in the field of arts, history and culture. 4207","tm_class":"41","tm_phonetics":"SRNTPT"},{"page_no":"106,journal no. 2048","trademark":"RACE CONFERENCES","details":"5196551    01/11/2021 SHALIMAR INFOTECH PRIVATE LIMITED 1 001/1002, Lodha Supremus, Opp. The World Towers, S.B. Marg, Lower Parel, Mumbai – 400013 Private Limited Company Address for service in India/Agents address: UNIVERSAL LEGAL ADVOCATES 1 61/162 MITTAL COURT, A WING, JAMNALAL BAJAJ MARG, NARIMAN POINT, MUMBAI 400021. Used Since :16/04/2019 MUMBAI Education; providing of training; coaching; tutoring ; entertainment; sporting and cultural activities; academies;  organization of exhibitions for cultural or educational purposes; arranging and conducting of conferences, congresses  and symposiums, colloquiums; seminars, workshops; online publication of electronic books and journals; publication of  books and texts; teaching / educational services; instruction services. 4214","tm_class":"41","tm_phonetics":"RS KNFRNSS"},{"page_no":"113,journal no. 2048","trademark":"PLAY THERAPY","details":"5200043    04/11/2021 PLAY THERAPY INDIA LLP N o. D-104, 3rd Floor, Wing 2, Saravana Tranquil Heights, CB Halli, Sambram College, Bangalore -560097 Limited Liability Partnership Firm Address for service in India/Attorney address: MANJUSHREE T he Startup Zone, No.5b, 2nd floor, 10th Cross, RMV Extension, Sadashivanagar, Bangalore-560080 Used Since :22/04/2019 CHENNAI academies [education], coaching [training], coaching  [training], providing information in the field of education, online  publication of electronic books and journals 4221","tm_class":"41","tm_phonetics":"PL 0RP"},{"page_no":"116,journal no. 2048","trademark":"IINVENTIV","details":"5200849    06/11/2021 INDIAN INSTITUTE OF TECHNOLOGY BOMBAY P owai, Mumbai - 400 076, State of Maharashtra. A body corporate under the Institutes of Technology Act, 1961. Address for service in India/Agents address: S. MAJUMDAR & CO. 5 , HARISH MUKHERJEE ROAD, KOLKATA - 700 025, INDIA. Proposed to be Used M UMBAI Dissemination of educational material; arranging and  conducting of commercial, trade and business conferences. 4224","tm_class":"41","tm_phonetics":"INFNTF"},{"page_no":"119,journal no. 2048","trademark":"FITNESSROMP-ZAIRA KOSHY","details":"5200891    06/11/2021 SRUTHY ZAIRA KOSHY K UNNEL PUTHIYAVEEDU , KOLLAKA PO, KARUNAGAPPALLY,,VADAKKUMTHALA,KOLLAM,KERALA-690536 AN INDIAN CITIZEN Address for service in India/Attorney address: JOSHUA DANIEL B izpole business solutions private limited,villiadath building, PC road,chalikavattom,cochin,kerala,682028 Proposed to be Used C HENNAI Physical fitness centre services 4227","tm_class":"41","tm_phonetics":"FTNSRMP-SR KKSH"},{"page_no":"123,journal no. 2048","trademark":"SOFTCLAY","details":"5203038    09/11/2021 SOFTCLAY TECHNOLOGY PRIVATE LIMITED H . No 1288, Second Floor Sector-46, Gurgaon Gurgaon HR 122002 IN Educational Services Body Corporate Proposed to be Used D ELHI Education; providing of training; entertainment; spo rting and cultural activities. 4231","tm_class":"41","tm_phonetics":"SFTKL"},{"page_no":"125,journal no. 2048","trademark":"TAKSHILA","details":"5204764    10/11/2021 M/S TAKSHILA EDUCATIONAL SOCIETY C  - 404 (Basement), Defence Colony, New Delhi - 110024 A society registered under the Society Registration Act, 1860 India. Address for service in India/Attorney address: ARORA AND ARORA 7 , FIRST FLOOR, NEHRU NAGAR MARKET, NEW DELHI-110065 Used Since :13/04/2000 DELHI Educational Services, Schools, Vocational Training,  Cultural And Entertainment Shows, Event management, Training In  Performing Arts And Fine arts, Art gallery services and Art Exhibition services, Entertainment, Sporting And Cultural  activities. 4233","tm_class":"41","tm_phonetics":"TKKSHL"},{"page_no":"140,journal no. 2048","trademark":"MODE DE VIE","details":"5334689    18/02/2022 Wardan Chandra Basu 2 52-B F/F, Shahpur Jat, South Delhi, Delhi – 110049, India A citizen of India. Address for service in India/Attorney address: MARK SHIELD 1 061, B/13, Ward 7 Mehrauli, New Delhi- 110030, India  Proposed to be Used D ELHI Education; providing of training; entertainment; spo rting and cultural activities. 4248","tm_class":"41","tm_phonetics":"MT T F"},{"page_no":"141,journal no. 2048","trademark":"THE CINESTAR MINIPLEX","details":"5334717    18/02/2022 PATEL DHAVALKUMAR JAYKRISHNABHAI B -2, SIMRAN BUNGLOWS, OPP. SAKAL BUNGLOWS, CHANDKHEDA, AHMEDABAD, GUJARAT-382424 Individual Proposed to be Used A HMEDABAD ENTERTAINMENT, CINEMA, THEATRE 4249","tm_class":"41","tm_phonetics":"0 SNSTR MNPLKS"},{"page_no":"146,journal no. 2048","trademark":"D-TECH COMPUTERS","details":"5336690    19/02/2022 JAGDISH MHATRE G ROUND FLOOR, SOLSE MARKET, BEHIND MARUTI SWEETS, OPP.BUS DEPOT, BADLAPUR (W) Individual Address for service in India/Attorney address: SAVITA WAIKAR B -703 VRINDAVAN GARDEN NEAR K M AGARWAL COLLEGE GANDHARI KALYAN WEST 421301 Used Since :08/07/2006 To be associated with: 3818436 MUMBAI PROVIDING EDUCATION IN THE FIELD OF SOFTWARE, HARDWA RE & ANIMATION 4254","tm_class":"41","tm_phonetics":"T-TKSH KMPTRS"},{"page_no":"147,journal no. 2048","trademark":"WISEMONKEYS","details":"5337188    21/02/2022 SOHRAB A. VAKHARIA 2 02, 4-A, Salsette Parsi Colony, Off pump house road, Andheri-400093 Individual Address for service in India/Attorney address: SONEJI RADHA I PMANTRA, 1st Floor, 150 Modi Street, Near Fort Market, Fort, Mumbai-400001, Maharashtra, Contact no. +91 77009 99092, Email  id- ipmantra@yahoo.com Used Since :09/04/2017 MUMBAI Education; Educational Services; Educational consult ancy; Educational testing; Education information services;  Publication Services; Publication of electronic publications; Editing of electronic publications; on-line publication of  journals or diaries [blog services]; Training; Providing non-downloadable videos via a website; Providing sports  information via a website; Providing entertainment information via a website; Provision of online tutorials; Online research  library services; Providing of training; Training consultancy; Training services; Computerized training; Training courses;  Coaching [training]; Advanced training; Providing Online Training; Conducting workshops [training]; Conducting training  seminars; Personal development training; Entertainment; sporting and cultural activities; Entertainment services; On-line  entertainment; Live entertainment; Interactive entertainment services; Organization of entertainment shows; Production of  podcasts; Providing information on sports and sporting events; Organizing and conducting of entertainment, sporting and  cultural activities; Providing online information about education, training, entertainment, sporting and cultural activities. 4255","tm_class":"41","tm_phonetics":"WSMNKS"},{"page_no":"148,journal no. 2048","trademark":"THE DARKLIFE STUDIOS","details":"5337357    21/02/2022 VIRAM DASS W ard No. 02, Near Anaaj Mandi, Bhikhi, Mansa, Punjab-151504 PROPRIETOR Address for service in India/Attorney address: RAGHAV CHUGH B  390, BASTI HAZOOR SINGH, FAZILKA Proposed to be Used D ELHI PROVIDING ONLINE ENTERTAINMENT, NAMELY, PROVIDING SO UND AND AUDIOVISUAL RECORDING IN THE FIELD OF  MUSIC AND MUSICAL BASED ENTERTAINMENT; PROVIDING A WEBSITE OVER A GLOBAL COMPUTER NETWORK  FEATURING INFORMATION ON MUSICAL ARTISTS; TOURS OF MUSICAL ARTISTS; SOUND RECORDINGS; POPULAR  CULTURE AND EVENTS AND MUSICAL BASED ENTERTAINMENT; DISTRIBUTION OF DIGITAL PROGRAMS, NAMELY,  ONLINE RADIO AND TELEVISION PROGRAMS, MUSIC PUBLISHING SERVICES; DESKTOP PUBLISHING FOR OTHERS;  MULTIMEDIA PUBLISHING OF BOOKS, MAGAZINES, JOURNALS, SOFTWARE, GAMES, MUSIC, AND ELECTRONIC  PUBLICATIONS; PRODUCING VIDEO FOR EDUCATION, CULTURE, ENTERTAINMENT, AND SPORTS; PROVISION OF  STUDIO FOR AUDIO AND VISUAL; PROVISION OF AMUSEMENT FACILITY; RENTAL OF CINEMA APPARATUS, CINEMA  FILM, AND MUSIC INSTRUMENT; RENTAL OF RECORD AND RECORDED MAGNETIC TAPE, RENTAL OF TOYS; SHOOTING  OF PHOTOGRAPH; RENTAL OF CAMERA; RENTAL OF OPTICAL APPARATUS.DUBBING, MUSIC COMPOSITION AND  PRODUCTION OF VIDEOS AND FILMS, COMPOSITION OF MUSIC FOR OTHERS, RECORDING STUDIO SERVICES,  PROVIDING RECORDING STUDIO FACILITIES, MUSIC RECORDING STUDIO SERVICES, AUDIO AND VIDEO EDITING  SERVICES,WRITING OF SONG LYRICS 4256","tm_class":"41","tm_phonetics":"0 TRKLF STXS"},{"page_no":"150,journal no. 2048","trademark":"LONEWOLF FITNESS CENTER","details":"5337620    21/02/2022 AKSHAY DAMODAR KHADE R oom no. 45 3/4 , Hanuman tekdi, Gate no 2, Shastri Nagar rahivashi chowl, Santacruz(east), Mumbai, Maharashtra, 400055 India FITNESS CENTER Individual Proposed to be Used M UMBAI GYM AND FITNESS CENTER , NUTRITIONISTS , HEALTH AND FITNESS TRAINING CLUB AND CONSULTANCY SERVICES ,  PERSONAL FITNESS TRAINING SERVICES , CONSULTANCY AND CONDUCTING TRAINING SESSION ON PHYSICAL  FITNESS ONLINE , GYMNASTICS INSTRUCTION AND TRAINING FACILITIES , YOGA INSTRUCTION AND TRAINING  FACILITIES , SPORT CAMP AND TRAINING SERVICES , ARRANGING AND CONDUCTING WORKSHOP AND SEMINAR OF  HEALTH & FITNESS TRAINING 4258","tm_class":"41","tm_phonetics":"LNWLF FTNS SNTR"},{"page_no":"152,journal no. 2048","trademark":"LOVEVERY","details":"5338434    21/02/2022 LOVEVERY, INC. 9 18 W Idaho St., Ste. 300, Boise, Idaho 83702 Delaware Corporation Address for service in India/Attorney address: RAHUL CHAUDHRY & PARTNERS R CY HOUSE, C-235, DEFENCE COLONY, NEW DELHI-110024 Proposed to be Used D ELHI Educational services provided for parents and caregi vers of children; educational services, namely, providing courses in  the field of early childhood development; providing a website featuring information on research in the fields of parenting  concerning education of children, early childhood education development; providing on-line non- downloadable brochures,  articles, booklets, and blogs in the field of early childhood educational development, learning, and education to provide  assistance on ways to maximize a child's early years of development, learning, and education; educational services,  namely, providing on-line non-downloadable brochures, articles, booklets, and blogs in the fields of parenting, children,  and early childhood development; providing on-line non-downloadable publications, namely, brochures, articles, booklets,  and blogs in the fields of parenting, children, and early childhood development. 4260","tm_class":"41","tm_phonetics":"LFFR"},{"page_no":"155,journal no. 2048","trademark":"UNFOLD THE UNCERTAIN","details":"5338632    21/02/2022 Abhishek Mishra D -312, Shivalya Apartment, Golf Course Road, Sector 55-56, Gurgaon – 122011, Haryana A citizen of India Address for service in India/Attorney address: VIDHI SINGH # 1359, Sector-C, Pocket-1, Vasant Kunj, New Delhi Proposed to be Used D ELHI Educational, teaching and training, entertainment, s porting and cultural services 4263","tm_class":"41","tm_phonetics":"UNFLT 0 NSRTN"},{"page_no":"157,journal no. 2048","trademark":"DREAMWORKS PINECONE & PONY","details":"5338882    22/02/2022 DreamWorks Animation L.L.C. 1 000 Flower Street, Glendale, California 91201, U.S.A. a Delaware limited liability company Address for service in India/Attorney address: FIDUS LAW CHAMBERS F lat No. 021, Mahagun Maestro Plot No. F21A Sector 50 Noida - 201301 Proposed to be Used T o be associated with: 1653622, 2701858, 2734028, 4360990, 5257055 DELHI Entertainment services in the nature of film, televi sion series, short form entertainment content, videos and podcasts  featuring news, sports, comedy, drama, music and variety content; entertainment services in the nature of the production  and distribution of film, television series, short form entertainment content, videos, podcasts and games featuring news,  entertainment, sports, comedy, drama, music and variety content; providing a website, images and non-downloadable  videos in the field of news and entertainment via the internet, mobile and wireless networks; providing interactive online  computer games; amusement park attraction and theme park services; live stage performances, namely, presentation of  live show performances; providing waterpark services; providing recreational areas for entertainment and amusement,  namely, interactive play areas; providing events, contests, displays and exhibits in the field of news and entertainment;  providing on-demand and rental of film, television series, short form entertainment content, videos, podcasts and games  in the fields of news, sports, comedy, drama, music and variety content; online non-downloadable electronic publications,  namely, text and graphic works featuring news, entertainment, sports, comedy, drama, music and variety content. 4265","tm_class":"41","tm_phonetics":"TRMWRKS PNKN & PN"},{"page_no":"158,journal no. 2048","trademark":"FARMILY","details":"5338883    22/02/2022 DreamWorks Animation L.L.C. 1 000 Flower Street, Glendale, California 91201, U.S.A. a Delaware limited liability company Address for service in India/Attorney address: FIDUS LAW CHAMBERS F lat No. 021, Mahagun Maestro Plot No. F21A Sector 50 Noida - 201301 Proposed to be Used D ELHI Entertainment services in the nature of film, televi sion series, short form entertainment content, videos and podcasts  featuring news, sports, comedy, drama, music and variety content; entertainment services in the nature of the production  and distribution of film, television series, short form entertainment content, videos, podcasts and games featuring news,  entertainment, sports, comedy, drama, music and variety content; providing a website, images and non-downloadable  videos in the field of news and entertainment via the internet, mobile and wireless networks; providing interactive online  computer games; amusement park attraction and theme park services; live stage performances, namely, presentation of  live show performances; providing waterpark services; providing recreational areas for entertainment and amusement,  namely, interactive play areas; providing events, contests, displays and exhibits in the field of news and entertainment;  providing on-demand and rental of film, television series, short form entertainment content, videos, podcasts and games  in the fields of news, sports, comedy, drama, music and variety content; online non-downloadable electronic publications,  namely, text and graphic works featuring news, entertainment, sports, comedy, drama, music and variety content. 4266","tm_class":"41","tm_phonetics":"FRML"},{"page_no":"178,journal no. 2048","trademark":"ADHYALAYA","details":"5342662    24/02/2022 SABIK CHAKRABORTY G uijan Kalibari, Tinsukia, Assam, 786147 INDIVIDUAL Address for service in India/Attorney address: HINDOL NANDI F astInfo Legal Services Pvt. Ltd. 8th Floor,Kariwala Towers, J1-5, EP Block, Salt Lake Sector-V, Kolkata, West Bengal, PIN-700091 Proposed to be Used K OLKATA Providing online educational classes via a live vide o chat, Education services, Information relating to education or  entertainment provided online or via television, broadband and wireless communications, Information relating to  education and entertainment provided online from a computer database or the Internet, Providing online information about  education, training, entertainment, sporting and cultural activities, Provision of temporary use of online non-downloadable  educational materials, Online educational assessment services INCLUDED IN CLASS 41 4286","tm_class":"41","tm_phonetics":"A0YLY"},{"page_no":"179,journal no. 2048","trademark":"THE DAILY EYE","details":"5342830    24/02/2022 RAJAT HANDA B 12, BAREJA SADAN, MAIN MATHURA ROAD BADARPUR, NEW DELHI 110044 An Indian Citizen KAVISH SALUJA B12, BAREJA SADAN, MAIN MATHURA ROAD BADARPUR, NEW DELHI 110044 An Indian Citizen Address for service in India/Agents address: VUTTS & ASSOCIATES S UITE NO. 704, THE CASTLE, PLOT 36-A,SECTOR-56, GURGAON-110002. (HARYANA). Proposed to be Used D ELHI Education; providing of training; entertainment; spo rting and cultural activities; Entertainment media production services  for the internet; News reporting services; Film distribution; Art Exhibition, Exhibition of Video films and Cine films;  Organizing of educational exhibitions; Organization of exhibitions for cultural purposes; Arranging of exhibitions,  seminars and conferences; Organization of exhibitions publication for educational purposes; Arranging and organizing of  award ceremonies; Arranging award ceremonies for entertainment purposes; Publication of printed matter for  entertainment and teaching purposes; Newspaper publication; Newsletter publication; Magazine publication; Book  publication; Publication services; Publication of journals; Publication of electronic magazines. 4287","tm_class":"41","tm_phonetics":"0 TL Y"},{"page_no":"180,journal no. 2048","trademark":"ECOMMERCESITY","details":"5343170    24/02/2022 UNICOMMERCE ESOLUTIONS PRIVATE LIMITED S UITE #181-TR6, FIRST FLOOR OF SPROUT BOX SURYAVILAS, D 181,OKHLA INDUSTRIAL AREA PHASE 1, NEW DELHI- 110020 a company incorporated under the Companies Act, 1956 Address for service in India/Attorney address: MASON & ASSOCIATES A -7, LOWER GROUND FLOOR, SARVODAYA ENCLAVE, NEW DELHI - 110017 Proposed to be Used D ELHI academies [education]; coaching [training]; organiza tion of competitions [education or entertainment]; correspondence  courses; providing information in the field of education; providing information in the field of entertainment; online  publication of electronic books and journals; providing online electronic publications, not downloadable; providing online  music, not downloadable; providing online videos, not downloadable; publication of books; arranging and conducting of  seminars; teaching / educational services/instruction services; arranging and conducting of workshops [training]. 4288","tm_class":"41","tm_phonetics":"EKMRSST"},{"page_no":"183,journal no. 2048","trademark":"INDIA FALCONS RACING LIMITED","details":"5344823    25/02/2022 ROADWAY SOLUTIONS (I) PRIVATE LIMITED P LOT NO. 20, DHANJIBUOY SOCIETY, OFF. NIBM ROAD, BEHIND BIZZBAY MALL, KONDHWA (KD), PUNE 411048  MAHARASHTRA. A COMPANY INCORPORATED UNDER THE INDIAN COMPANIES ACT Address for service in India/Agents address: R.K. DEWAN & CO. P ODAR CHAMBERS, S.A. BRELVI ROAD, FORT, MUMBAI - 400 001. Proposed to be Used M UMBAI ENTERTAINMENT SERVICES; ARRANGING AND ORGANIZATION O F EXHIBITIONS FOR CULTURAL,EDUCATIONAL AND  ENTERTAINMENT PURPOSE; ORGANIZATION AND PRESENTATION OF SHOWS; PRESENTATION OF LIVE  PERFORMANCES; PROVIDING ONLINE INFORMATION ABOUT EDUCATION, TRAINING, ENTERTAINMENT, SPORTING  AND CULTURAL ACTIVITIES; SPORTING AND CULTURAL ACTIVITIES; CONDUCTING, ORGANISING AND MANAGING  EVENTS; ARRANGING OF FILM EVENTS, MUSICAL EVENTS, CULTURAL AND SPORTING EVENTS AND LIVE  ENTERTAINMENT EVENTS; PRODUCTION OF RADIO AND TELEVISION PROGRAMMES FOR THE INTERNET AND OTHER  MEDIA; EDUCATIONAL AND TRAINING SERVICES; PUBLICATIONS OF ELECTRONIC PUBLICATIONS. 4291","tm_class":"41","tm_phonetics":"INX FLKNS RSNK LMTT"},{"page_no":"184,journal no. 2048","trademark":"WALMART","details":"5345158    25/02/2022 WALMART APOLLO, LLC 7 02 SW 8th Street, Bentonville, Arkansas 72716 A limited liability company organized under the laws of Delaware Address for service in India/Attorney address: RAHUL CHAUDHRY & PARTNERS R CY HOUSE, C-235, DEFENCE COLONY, NEW DELHI-110024 Proposed to be Used T o be associated with: 3959088 DELHI ENTERTAINMENT AND EDUCATIONAL SERVICES, NAMELY, PROV IDING ONLINE NON-DOWNLOADABLE PUBLICATIONS  ABOUT VIRTUAL REALITY TECHNOLOGY VIA A WEBSITE; ENTERTAINMENT AND EDUCATIONAL SERVICES, NAMELY,  PROVIDING ONLINE NON-DOWNLOADABLE PUBLICATIONS ABOUT AUGMENTED REALITY TECHNOLOGY VIA A  WEBSITE; VIRTUAL REALITY GAME SERVICES PROVIDED VIA THE INTERNET AND OTHER COMMUNICATIONS  NETWORKS; AUGMENTED REALITY GAME SERVICES PROVIDED VIA THE INTERNET AND OTHER COMMUNICATIONS  NETWORKS; ENTERTAINMENT SERVICES, NAMELY, PROVIDING VIRTUAL REALITY GAMES, INTERACTIVE  ENTERTAINMENT AND VIRTUAL REALITY CONTENT AND EXPERIENCES; ENTERTAINMENT SERVICES, NAMELY,  PROVIDING AUGMENTED REALITY GAMES, INTERACTIVE ENTERTAINMENT AND AUGMENTED REALITY CONTENT AND  EXPERIENCES; ENTERTAINMENT SERVICES, NAMELY, PROVIDING MIXED REALITY GAMES, INTERACTIVE  ENTERTAINMENT AND MIXED REALITY CONTENT AND EXPERIENCES; ENTERTAINMENT SERVICES, NAMELY,  PROVIDING ONLINE VIRTUAL REALITY ENVIRONMENTS; ENTERTAINMENT SERVICES, NAMELY, PROVIDING ONLINE  AUGMENTED REALITY ENVIRONMENTS; AUGMENTED REALITY VIDEO PRODUCTION FOR ENTERTAINMENT  PURPOSES; VIRTUAL REALITY VIDEO PRODUCTION FOR ENTERTAINMENT PURPOSES; ENTERTAINMENT SERVICES,  NAMELY, PROVIDING ONLINE MIXED REALITY ENVIRONMENTS; MIXED REALITY VIDEO PRODUCTION; VIRTUAL  REALITY VIDEO PRODUCTION; ENTERTAINMENT SERVICES, NAMELY, PROVIDING ON-LINE, NON-DOWNLOADABLE  DIGITAL ANIMATED AND NON-ANIMATED DESIGNS AND CHARACTERS, AVATARS, DIGITAL OVERLAYS, AND SKINS  FOR USE IN VIRTUAL ENVIRONMENTS; VIRTUAL REALITY AND INTERACTIVE GAME SERVICES PROVIDED ONLINE  FROM A GLOBAL COMPUTER NETWORK AND THROUGH VARIOUS WIRELESS NETWORKS AND ELECTRONIC DEVICES;  ENTERTAINMENT SERVICES, NAMELY, PROVIDING ONLINE NON-DOWNLOADABLE GAME SOFTWARE AND ONLINE  VIDEO GAMES; ENTERTAINMENT SERVICES, NAMELY, PROVIDING VIRTUAL ENVIRONMENTS IN WHICH USERS CAN  INTERACT FOR RECREATIONAL, LEISURE, OR ENTERTAINMENT PURPOSES; ENTERTAINMENT SERVICES, NAMELY,  PROVIDING AN ONLINE ENVIRONMENT FEATURING STREAMING OF ENTERTAINMENT CONTENT AND LIVE STREAMING  OF ENTERTAINMENT EVENTS; ENTERTAINMENT SERVICES IN THE NATURE OF ORGANIZING, ARRANGING, AND  HOSTING VIRTUAL PERFORMANCES AND SOCIAL ENTERTAINMENT EVENTS; ENTERTAINMENT SERVICES, NAMELY,  PROVIDING ON-LINE, NON-DOWNLOADABLE VIRTUAL GOODS, NAMELY, ELECTRONICS, APPLIANCES, INDOOR AND  OUTDOOR FURNITURE, HOME DÉCOR, TOYS, SPORTING GOODS, OUTDOOR RECREATION, HEALTH, BEAUTY AND  PERSONAL CARE PRODUCTS, HOUSEHOLD ESSENTIALS, APPAREL, PATIO, GARDEN, LAWN CARE AND  LANDSCAPING PRODUCTS, HOME IMPROVEMENT PRODUCTS, GRILLING PRODUCTS, ENTERTAINMENT RECORDINGS,  VIDEO GAMES, BOOKS AND PUBLICATIONS, MUSICAL INSTRUMENTS, OFFICE SUPPLIES, ARTS AND CRAFT SUPPLIES,  HOLIDAY AND CELEBRATION SUPPLIES, JEWELRY, AND PET PRODUCTS FOR USE IN VIRTUAL ENVIRONMENTS;  EDUCATION; PROVIDING OF TRAINING; ENTERTAINMENT; SPORTING AND CULTURAL ACTIVITIES. 4292","tm_class":"41","tm_phonetics":"WLMRT"},{"page_no":"186,journal no. 2048","trademark":"LITTLE PEOPLE'S HUB","details":"5345584    25/02/2022 SMILEY KIDS PRIVATE LIMITED N URSERY SCHOOL SITE NS-13,K BLOCK,ANSALPALAM VIHAR BAJGHERA,CARTERPUR, GURGAON-122017, HARY  HARYANA Gurgaon HR 122017 PRIVATE LIMITED COMPANY Address for service in India/Attorney address: SUMTI PUGLIYA F -14/14A, KRISHNA NAGAR, DELHI-110051 Proposed to be Used D ELHI Play School 4294","tm_class":"41","tm_phonetics":"LTL PPL'S HB"},{"page_no":"187,journal no. 2048","trademark":"INDAS ON POINT","details":"5345594    25/02/2022 DELOITTE TOUCHE TOHMATSU INDIA LLP O ne International Center, Tower 3, 32nd Floor, Senapati Bapat Marg, Prabhadevi (W), Mumbai -400013 LLP Address for service in India/Attorney address: ANURADHA SUNEET MAHESHWARI L ex Mantis D-4,B-Wing, 4th Floor, Barodawala Mansion, Opp. RBI Bldg, Above ICICI Bank, 81, Dr. Annie Besant Road, Mumbai 400  018, India Proposed to be Used M UMBAI Education; Education information; Educational semina rs; Publishing of educational materials Publication of newsletters,  Publishing of newsletters 4295","tm_class":"41","tm_phonetics":"INTS N PNT"},{"page_no":"198,journal no. 2048","trademark":"MAYHEM STUDIOS","details":"5349746    01/03/2022 M-LEAGUE PTE LTD 5 0 Raffles Place, #19-00 Singapore Land Tower, Singapore 048623 Body Incorporate Address for service in India/Attorney address: LEXPORT K  1/114, First Floor, Chittaranjan Park, New Delhi - 110019 Proposed to be Used D ELHI Providing an Online Computer Database in the Fields  of Computer Games, Movies, Music, Sports And Entertainment;  Providing a Web Site Featuring Information about Computer And Video Games, Movies, Music, Sports And Entertainment;  and Entertainment Services, namely providing Online Computer Games; And Arranging Competitions and Games relating  to education and Entertainment; organisation of competitions and games [education or entertainment], game services  provided online [from a computer network]; game services provided over the Internet; still and moving images containing  film and television programs and artwork by streaming via the Internet 4306","tm_class":"41","tm_phonetics":"MHM STXS"},{"page_no":"199,journal no. 2048","trademark":"MELOTALES","details":"5349786    01/03/2022 AAYUSH JUNEJA A AYUSH JUNEJA S/O SH. ASHOK KUMAR, R/O H. NO. 149, HUDA, SECTOR-12, PANIPAT-132103 (HARYANA) INDIVIDUAL Address for service in India/Attorney address: SURAJ AGGARWAL ADV., C HAMBER NO 90, LAWYERS CHAMBERS, PANIPAT 132103 HRAYANA Proposed to be Used D ELHI ENTERTAINMENT INFORMATION, PROVIDING ONLINE MUSIC AN D VIDEOS, NOT DOWNLOADABLE, MUSIC  COMPOSITION SERVICES, PRODUCTION OF MUSIC, AUDIO AND VIDEO RECORDING SERVICES, WRITING OF LYRICS 4307","tm_class":"41","tm_phonetics":"MLTLS"},{"page_no":"202,journal no. 2048","trademark":"MYGATHER","details":"5350259    01/03/2022 RAKESH JAIN PROPRIETOR OF MY GATHER TECH ENTERPRISE 4 48, 7TH MAIN ROAD, 4TH BLOCK, JAYANAGAR, BANGALORE -560011 THE TRADEMARK ACT - 1999 Address for service in India/Attorney address: NEWTON REGINALD N o 6, Dhanammal Street Spurtank Road Chetpet Chennai - 600031 Proposed to be Used C HENNAI Booking of seats for shows and booking of theatre ti ckets; Booking of seats for shows and booking of theater tickets;  Ticket reservation and booking services for cultural events; Ticket reservation and booking services for music concerts;  Ticket reservation and booking services for educational events; Ticket reservation and booking services for entertainment  events; Ticket reservation and booking services for sporting events; Ticket reservation and booking services for  entertainment, sporting and cultural events; Ticket reservation and booking services for recreational and leisure events 4310","tm_class":"41","tm_phonetics":"MK0R"},{"page_no":"204,journal no. 2048","trademark":"NEEYAMO","details":"5350370    01/03/2022 NEEYAMO ENTERPRISE SOLUTIONS PRIVATE LIMITED B LOCK NO. A (MODULE 4), 5TH FLOOR, SP INFOCITY, NO.40, MGR SALAI, PERUNGUDI, KANDANCHAVADI CHENNAI -  600096 TAMIL NADU Company Address for service in India/Attorney address: S ESHWAR CONSULTANTS H OUSE OF CORPORATE AND IPR LAWS 4, AISHWARYA, 12B/177, KUMARAN COLONY, 6TH STREET, VADAPALANI,  CHENNAI-600026. Used Since :10/02/2009 To be associated with: 5350354 CHENNAI Arranging and conducting of workshops, training, eve nts, conferences and seminars; Providing on-line non-downloadable  electronic publications. 4312","tm_class":"41","tm_phonetics":"NYM"},{"page_no":"210,journal no. 2048","trademark":"KAAKDI","details":"5351465    02/03/2022 APPLAUSE ENTERTAINMENT PVT. LTD 7 02, Shalimar Morya Park, Oshiwara Link Road, Andheri (West), Mumbai-400053 Body Incorporate Address for service in India/Attorney address: ANM GLOBAL INC 1 410, 14th Floor, Maker Chambers V, Dr. Jamnalal Bajaj Road, Nariman Point, Mumbai 400 021  Proposed to be Used M UMBAI Production of films, programmes and sound recordings , cultural activities; production of radio and television  programmes; production of shows; television entertainment; theatre productions videotape film productions;  entertainment being services included in class 41. 4318","tm_class":"41","tm_phonetics":"KKT"},{"page_no":"211,journal no. 2048","trademark":"DARK MONEY","details":"5351481    02/03/2022 APPLAUSE ENTERTAINMENT PVT. LTD 7 02, Shalimar Morya Park, Oshiwara Link Road, Andheri (West), Mumbai-400053 Body Incorporate Address for service in India/Attorney address: ANM GLOBAL INC 1 410, 14th Floor, Maker Chambers V, Dr. Jamnalal Bajaj Road, Nariman Point, Mumbai 400 021  Proposed to be Used M UMBAI Production of films, programmes and sound recordings , cultural activities; production of radio and television  programmes; production of shows; television entertainment; theatre productions videotape film productions;  entertainment being services included in class 41. 4319","tm_class":"41","tm_phonetics":"TRK MN"},{"page_no":"212,journal no. 2048","trademark":"THE WOKE THIS WEEK","details":"5351497    02/03/2022 APPLAUSE ENTERTAINMENT PVT. LTD 7 02, Shalimar Morya Park, Oshiwara Link Road, Andheri (West), Mumbai-400053 Body Incorporate Address for service in India/Attorney address: ANM GLOBAL INC 1 410, 14th Floor, Maker Chambers V, Dr. Jamnalal Bajaj Road, Nariman Point, Mumbai 400 021  Proposed to be Used M UMBAI Production of films, programmes and sound recordings , cultural activities; production of radio and television  programmes; production of shows; television entertainment; theatre productions videotape film productions;  entertainment being services included in class 41. 4320","tm_class":"41","tm_phonetics":"0 WK THS WK"},{"page_no":"216,journal no. 2048","trademark":"GENLEAP","details":"5352291    02/03/2022 GENLEAP ECOSYSTEM PRIVATE LIMITED C -11, Greater Kailash Enclave -1, New Delhi-110048 (INDIA) Company Address for service in India/Attorney address: SUNIL TYAGI 2 , Palam Marg, Vasant Vihar, New Delhi-110057 Used Since :01/06/2021 DELHI Educational services; Career Counselling [education] , Career counselling and coaching; Computerised, scientific,  genomics, psychometric, astromancy testing and training in career counselling; Career advisory services (education or  training); Career information and advisory services (educational or training); Coaching [education or training]; vocational  training and counselling; arranging and conducting of workshops, sessions, trainings and conferences related to career  counselling, training and coaching. 4324","tm_class":"41","tm_phonetics":"JNLP"},{"page_no":"219,journal no. 2048","trademark":"RAR","details":"4046545    04/01/2019 RANJEET KUMAR MANPURA, DAUDNAGAR, VAISHALI, BIHAR - 844113 THE TRADEMARK ACT-1999 Address for service in India/Attorney address: VANCHINATHAN No 6, Dhanammal Street Spurtank Road Chetpet Chennai - 600031 Proposed to be Used KOLKATA Software development, Scientific and technological services and research and design relating thereto; Industrial analysis  and research services; Design and development of computer hardware and software 4327","tm_class":"42","tm_phonetics":"RR"},{"page_no":"220,journal no. 2048","trademark":"HIND SAMACHAR","details":"4048841    07/01/2019 THE HIND SAMACHAR LTD. HIND SAMACHAR STREET, PUCCA BAGH, CIVIL LINES, JALANDHAR (PB.) A COMPANY INCORPORATED UNDER THE COMPANIES ACT Address for service in India/Attorney address: MAHTTA & CO 43-B/3, UDHAM SINGH NAGAR, LUDHIANA. 141001 (PUNJAB) Used Since :07/11/2002 DELHI Web Site Hosting, Website Maintenance, Website Design, Creating Websites, Website Development Services, Website  Traffic Optimization, Computer Services; Namely, Creating Computer Network- Based Indexes of Information, Websites and  Resources Hosting of Platforms on the Internet, Hosting of Digital Content, Electronic Storage of Digital Images, Digital  Compression of Computer Data, Electronic Storage of Digital Images, Photographs, Music, Videos & Hosting of Digital  Content Online. 4328","tm_class":"42","tm_phonetics":"HNT SMKSHR"},{"page_no":"221,journal no. 2048","trademark":"WATCH SHOP EARN","details":"4195054    02/06/2019 GURMAIL SINGH H.No 1288, Sector 19-B Proprietor Address for service in India/Agents address: GEETA GULATI 913, SECTOR 12-A, PANCHKULA-134109 Proposed to be Used DELHI Design and Development of Computer Software. 4329","tm_class":"42","tm_phonetics":"WTKSH KSHP RN"},{"page_no":"222,journal no. 2048","trademark":"CREWWW","details":"4533936    17/06/2020 PARTH D UJENIA C-2/403 SAHAJANAND CITY NEAR SUKAN SILVER KUDASAN GANDHINAGAR GUJARAT 382421 Crewww INDIVIDUAL Proposed to be Used AHMEDABAD Information Technology and Software Services 4330","tm_class":"42","tm_phonetics":"KRW"},{"page_no":"225,journal no. 2048","trademark":"CLARA","details":"4660163    17/09/2020 PHASORZ TECHNOLOGIES PRIVATE LIMITED Tower D, 4th Floor, IBC Knowledge Park, 4/1, Bannerghatta Road, Bengaluru - 560 029 Private Limited Company Address for service in India/Attorney address: VENKATARAGHAVAN DBS House, 26, Cunningham Road, Bangalore 560 052 Used Since :15/11/2015 CHENNAI Services related to computer software for a mobile and web messaging platform for medical practitioners to share images,  videos and relevant reports of patients, discuss and collaborate treatment plan with features including patient centric  grouping, templates for easy data entry and connecting to medical diagnostic devices. 4333","tm_class":"42","tm_phonetics":"KLR"},{"page_no":"226,journal no. 2048","trademark":"SHAREMYSTORE.COM","details":"4672296    24/09/2020 ADJ UTILITY APPS PRIVATE LIMITED 1103, B WING, VALENCIA, HIRANANDANI GARDENS, POWAI, MUMBAI -400076 Private Limited Address for service in India/Attorney address: BALAJI R. BARGE M/s. VEDIC IP, E-212, 2nd Floor, Tower No.3, International Infotech park, Vashi, Navi Mumbai- 400703 Used Since :01/09/2020 MUMBAI Design and development of software in the field of mobile applications, Programming of multimedia applications,  Development and design of mobile applications. 4334","tm_class":"42","tm_phonetics":"SHRMSTR.KM"},{"page_no":"233,journal no. 2048","trademark":"BULLET","details":"4690027    06/10/2020 AMICA FINANCIAL TECHNOLOGIES PRIVATE LIMITED 801, Casablanca, 28th Road, Stomach Rest, Off Waterfield Road, Bandra West, Mumbai 400050, India A company organised under the laws of India Address for service in India/Attorney address: NITIN MASILAMANI Masilamani Law Partners, B-25, Sector 92, NOIDA, Uttar Pradesh, 201304, India  Proposed to be Used MUMBAI Providing temporary use of on-line non-downloadable software for processing electronic payments; providing temporary  use of on-line non-downloadable authentication software for controlling access to and communications with computers  and computer networks; design and development of computer software to provide and operate m-commerce and e- commerce platforms and internet applications for electronic payment processing, authentication processes; providing  temporary use of on-line non-downloadable computer software for payment processing, authentication, management and  tracking; computer services, namely collecting, analyzing, and providing data and information regarding electronic  payment transactions; providing temporary use of on-line non-downloadable software for use in collecting, analyzing, and  providing data and information regarding electronic payment transactions; providing an interactive web site featuring  technology that enables users to enter, access, track, manage, monitor, and generate information and reports regarding  sales of products; providing user authentication services in e-commerce transactions; design, creation, hosting and  maintenance of websites; providing temporary use of on-line non-downloadable authentication software for controlling  access to and communications with computers and computer networks. 4341","tm_class":"42","tm_phonetics":"BLT"},{"page_no":"234,journal no. 2048","trademark":"SLATE.AC","details":"4691503    07/10/2020 RYPE FINTECH PRIVATE LIMITED 108, Plot-228, Mittal Chamber, Rajani Patel Marg, Nariman Point, Mumbai 400021 Private Limited Company Address for service in India/Agents address: ASHWINI RAMAKANT GUPTA Office No.9, 1-A, IRAISA Bldg., 1st floor,Above Dominos Pizza, Nr. Kanakia Police Station, Beverly Park, Mira Road East, Thane- 401107 Proposed to be Used MUMBAI Scientific and technological services, IT services, eCommerce, Data duplication and conversion services, data coding  services and research and design relating thereto 4342","tm_class":"42","tm_phonetics":"SLT.K"},{"page_no":"240,journal no. 2048","trademark":"GANSONS","details":"4704723    16/10/2020 WEST VIEW INNOVATION SERVICES PRIVATE LIMITED 157/158A, Akbar Camp Road, Sandoz Baug, Kolshet, Thane (West) 400607, Maharashtra, India Company registered under the laws of India Address for service in India/Attorney address: OBHAN & ASSOCIATES N 94 Second Floor Panchshila Park New Delhi 110017 India  Used Since :19/08/1947 MUMBAI Scientific and technological services and research and design relating thereto; Industrial analysis, industrial research and  industrial design services; Quality control and authentication services; Design and development of computer hardware  and software 4348","tm_class":"42","tm_phonetics":"KNSNS"},{"page_no":"241,journal no. 2048","trademark":"BEYOND ABACUS","details":"4712286    21/10/2020 Dr. PRAKASH MOGHE 55, Satyadev Nagar, IDA Scheme 97, Part 4, near Havabangla, Indore, Sudama Nagar, Madhya Pradesh. PIN-452 009 BEYOND ABACUS Address for service in India/Attorney address: VARALAKSHMI Flat No.202, SriSivaRamakrishna Mansion, Above SBI BANK, Kamalaprasana Nagar,Allwyn Colony,Kukatpally, Hyderabad- 72,Telangana Proposed to be Used MUMBAI Scientific and technological services and research and design relating thereto; Industrial analysis, industrial research and  industrial design services; Quality control and authentication services; Design and development of computer hardware  and software; including Computer programming; Computer Software Consultancy; Computer Software Design; Rental of  Computer Software or applications; Design of interior decor; Interior design; Platform as a service (PaaS); Software as a  service (Saas) included in class-42 4349","tm_class":"42","tm_phonetics":"BYNT BKS"},{"page_no":"243,journal no. 2048","trademark":"INFERGENES","details":"4785970    18/12/2020 LIFECELL INTERNATIONAL PRIVATE LIMITED No.16, Vijayaraghava Road, I Lane, T.Nagar, Chennai - 600017 A BODY INCORPORATE REGISTERED UNDER THE COMPANIES ACT 1956 Address for service in India/Attorney address: ALTACIT GLOBAL SHED NO. C2-A, THIRU-VI-KA INDUSTRIAL ESTATE, GUINDY, CHENNAI - 600 032. Proposed to be Used CHENNAI Development of diagnostic apparatus; Computer-aided diagnostic testing services; Laboratory testing; Scientific and  industrial research; Genetic research; Genetic mapping for scientific purposes; Scientific research relating to genetics; 4351","tm_class":"42","tm_phonetics":"INFRJNS"},{"page_no":"244,journal no. 2048","trademark":"DIGIQC","details":"4800540    30/12/2020 SPACEIFY TECHNOLOGIES PVT. LTD OFFICE NO. 603, 6TH FLOOR, TRINITY ORION, B/S. JOLLY RESIDENCY, VESU, SURAT-395007, GUJARAT STATE, INDIA PRIVATE LIMITED Address for service in India/Attorney address: SHETH & CO., ADVOCATES RAJAN BUILDING-5,6, OPP. JAINATH PETROL PUMP, GONDAL ROAD, RAJKOT - 360 002 Proposed to be Used AHMEDABAD DESIGN AND DEVELOPMENT OF COMPUTER HARDWARE AND SOFTWARE; SOFTWARE DEVELOPMENT,  PROGRAMMING AND IMPLEMENTATION; COMPUTER PROJECT MANAGEMENT SERVICES; INFORMATION  TECHNOLOGY [IT] CONSULTANCY; SCIENCE AND TECHNOLOGY SERVICES; TESTING, AUTHENTICATION AND QUALITY  CONTROL; DEVELOPMENT AND DESIGN OF MOBILE APPLICATIONS; COMPUTER SOFTWARE MAINTENANCE;  DESIGNING AND DEVELOPING WEB PAGES; DESIGNING WEBSITES FOR ADVERTISING PURPOSES 4352","tm_class":"42","tm_phonetics":"TJKK"},{"page_no":"246,journal no. 2048","trademark":"BIOSEQUESTRATION MIRACLE","details":"4833994    25/01/2021 BHASKER THAKORBHAI PATEL 1307 BOBWHITE AVE, SUNNYVALE, CA, 94087, USA Proposed to be Used AHMEDABAD SCIENTIFIC AND TECHNOLOGICAL SERVICES AND RESEARCH AND DESIGN RELATING THERETO; INDUSTRIAL  ANALYSIS AND RESEARCH SERVICES; DESIGN AND DEVELOPMENT OF COMPUTER HARDWARE AND SOFTWARE,  RESEARCH AND DEVELOPMENT OF NEW PRODUCTS FOR OTHERS; TECHNICAL RESEARCH; TECHNICAL PROJECT  STUDIES; RESEARCH ON CASE STUDIES. 4354","tm_class":"42","tm_phonetics":"BSKSTRXN MRKL"},{"page_no":"247,journal no. 2048","trademark":"WORLD PAP","details":"4833995    25/01/2021 BHASKER THAKORBHAI PATEL 1307 BOBWHITE AVE, SUNNYVALE, CA, 94087, USA Proposed to be Used AHMEDABAD SCIENTIFIC AND TECHNOLOGICAL SERVICES AND RESEARCH AND DESIGN RELATING THERETO; INDUSTRIAL  ANALYSIS AND RESEARCH SERVICES; DESIGN AND DEVELOPMENT OF COMPUTER HARDWARE AND SOFTWARE,  RESEARCH AND DEVELOPMENT OF NEW PRODUCTS FOR OTHERS; TECHNICAL RESEARCH; TECHNICAL PROJECT  STUDIES; RESEARCH ON CASE STUDIES. 4355","tm_class":"42","tm_phonetics":"WRLT PP"},{"page_no":"248,journal no. 2048","trademark":"VARUNA ELECTRIC","details":"4846268    02/02/2021 LA-GAJJAR MACHINERIES PVT. LTD. ACIDWALA ESTATE, NAGARWEL HANUMAN ROAD, AMRAIWADI, AHMEDABAD – 380 026, GUJARAT STATE, INDIA. A COMPANY INCORPORATED UNDER THE COMPANIES ACT. Address for service in India/Agents address: Y. J. TRIVEDI & CO. YAGNAJYOT, OPP. KASHIRAM AGRAWAL HALL, POLYTECHNIC, AHMEDABAD 380 015 Used Since :01/01/1980 To be associated with: 4510918 AHMEDABAD SCIENTIFIC AND TECHNOLOGICAL SERVICES AND RESEARCH AND DESIGN RELATING THERETO; INDUSTRIAL  ANALYSIS AND INDUSTRIAL RESEARCH SERVICES; DESIGN AND DEVELOPMENT OF COMPUTER HARDWARE AND  SOFTWARE. 4356","tm_class":"42","tm_phonetics":"FRN LKTRK"},{"page_no":"249,journal no. 2048","trademark":"RURALPAYMENTS","details":"4858088    10/02/2021 FINANCIAL SOFTWARE AND SYSTEMS PRIVATE LIMITED, \"SARADHA”, Ground Floor, No. 42,Third Main Road, Gandhi Nagar, Adyar, Chennai 600 020, Tamil Nadu, India A company incorporated under the Companies Act, 1956 Address for service in India/Agents address: ANAND AND ANAND FLAT NO. GA, AR VILLA, 31, III MAIN ROAD, GANDHI NAGAR, ADAYAR, CHENNAI 600 020 Proposed to be Used CHENNAI computer software development, computer software engineering, computer software programming services, computer  software technical support services, computer software research, design and development of computer hardware and  software; software consultancy services and licensing of software, medical research; Providing temporary use of on-line,  non-downloadable software for use in publishing and printing, Data encryption services, Development of data bases,  Computerized analysis of data; Information technology services for the pharmaceutical and healthcare industries included  in class 42. 4357","tm_class":"42","tm_phonetics":"RRLPMNTS"},{"page_no":"251,journal no. 2048","trademark":"ZOOMCAR MOBILITY SERVICES","details":"4858587    11/02/2021 ZOOMCAR INC 2437, S Fillmore ST Denver 80210 A company registered under the laws of United States of America Address for service in India/Attorney address: THIMMANNA P P ATV Legal, No. 1472, 2nd Cross, Judicial Layout, GKVK Post Bangalore 560065 Used Since :12/08/2020 CHENNAI Technological services and research and design relating thereto, and also design and development of computer hardware  and software for the mobility domain. 4359","tm_class":"42","tm_phonetics":"SMKR MBLT SRFSS"},{"page_no":"253,journal no. 2048","trademark":"KEEPS","details":"4872040    20/02/2021 THIRTY MADISON, INC. 27 E 28th Street 12th Floor, New York, NY10016, United States of America. Service Providers A corporation existing under the laws of the State of Delaware, United States of America Address for service in India/Attorney address: SELVAM & SELVAM, ADVOCATES Old No. 9, Valliammal Street, First Floor, Kilpauk, Chennai-600010, Tamil Nadu, India. Used Since :28/12/2017 CHENNAI Providing on-line non-downloadable software for mobile devices and computers, namely, software for accessing  information and advice concerning hair loss due to male pattern baldness, hair care, hair loss, hair regrowth, erectile  dysfunction, dandruff, acne, sexual health issues, and men\"s health issues ; providing on-line non-downloadable software  for mobile devices and computers, namely, software for purchasing goods and accessing telemedicine services  concerning hair loss due to male pattern baldness; providing on-line non-downloadable software for mobile devices and  computers, namely, software for purchasing goods and accessing telemedicine services concerning hair care, hair loss,  hair regrowth, erectile dysfunction, dandruff, acne, sexual health issues, and men\"s health issues. 4361","tm_class":"42","tm_phonetics":"KPS"},{"page_no":"255,journal no. 2048","trademark":"HUPP","details":"4882154    26/02/2021 JIGAR HARISH TANK 1201/D, BVR EK, NR. WESTEND HOTEL, OPP. INDER RESIDENCY HOTEL, ELLISBRIDGE, AHMEDABAD, GUJARAT –  380006 Individual Address for service in India/Agents address: SHIKHA NILESH DHANUKA B-702,DOMAIN HEIGHTS, NR. BAKERI SONNET, SHYAMAL CROSS ROAD, SATELLITE, AHMEDABAD-380015, GUJARAT. Used Since :06/04/2012 AHMEDABAD DESIGNING, CREATION, HOSTING, PLANNING, INTRODUCTION, INSTALLATION, EXPANSION, CONFIGURING, UPDATING,  CONSULTANCY, APPRAISAL MAINTENANCE OF WEBSITE, COMPUTER SOFTWARE, COMPUTER PROGRAMMING,  SOFTWARE DEVELOPMENT, PROGRAMMING AND IMPLEMENTATION, INFORMATION TECHNOLOGY CONSULTANCY,  DEVOPS AND CLOUD CONSULTATION, DATA ENTRY MANAGEMENT, TECHNICAL PROJECT MANAGEMENT,  MANAGEMENTS OF INTERNET WEBSITE CONTENTS, GRAPHIC AND WEB DESIGNING, MULTIMEDIA SERVICES,  COMPILATION OF INFORMATION INTO COMPUTER DATABASES, SYSTEMIZATION OF INFORMATION INTO COMPUTER  DATABASES, ANNUAL MAINTENANCE OF WEBSITE, IT SERVICES, DESIGN AND DEVELOPMENT OF COMPUTER  HARDWARE AND SOFTWARE, IT SERVICES, DESIGN SERVICES INCLUDED IN CLASS 42. 4363","tm_class":"42","tm_phonetics":"HP"},{"page_no":"256,journal no. 2048","trademark":"DAWABOOK","details":"4885393    01/03/2021 SAVEO HEALTHTECH PRIVATE LIMITED No. 18 & 19, 3rd Floor, Krishna Reddy Layout, Domlur, Bangalore, Karnataka – 560071, India Service Provider Address for service in India/Attorney address: SPICE ROUTE LEGAL No. 775, 3rd Floor, 100 ft Road Indiranagar 2nd Stage, Bangalore - 560038 Proposed to be Used CHENNAI Design services for data processing systems Advisory services relating to computer systems design; Software  development, programming and implementation; IT consultancy, advisory and information services; Constructing an  internet platform for electronic commerce; Image processing software design; Software design and development; Design  and development of virtual reality software; Design and development of operating software for accessing and using a  cloud computing network; Designing and developing webpages on the internet; Intranet design, development and  maintenance; Design, development and implementation of software; Design and development of computer software for  logistics, supply chain management and e-business portals; Design and development of software for database  management; Design and development of data output systems; Creation of computer programmes for data processing;  Creating programmes for data processing; Development of data bases; Development of virtual reality software;  Development of computer software for use with programmable controllers; Developing of driver and operating system  software; Development of programmes for data processing; Maintenance of software; Maintenance of data bases;  Maintenance and updating of software for communication systems; Programming of software for e-commerce platforms;  Programming of software for Internet portals, chatrooms, chat lines and Internet forums; Providing virtual computer  systems through cloud computing; Enterprise content management; Hosting of databases; Infrastructure as a Service  [IaaS]; Rental of software for importing and managing data; Software as a service [SaaS]; Platform as a Service [PaaS];  Electronic storage of files and documents; Electronic data storage and data back-up services; Electronic data storage;  Temporary electronic storage of information and data; Data mining; Troubleshooting of computer hardware and software  problems. 4364","tm_class":"42","tm_phonetics":"TWBK"},{"page_no":"267,journal no. 2048","trademark":"ZOCKET","details":"5079089    08/08/2021 ZOCKET TECHNOLOGIES PRIVATE LIMITED New No. 9/2, Old No. 41, 12th Avenue, Ashok Nagar, Chennai - 600083. Service Providers A PRIVATE LIMITED COMPANY INCORPORATED UNDER COMPANIES ACT, 2013 Address for service in India/Attorney address: P.M.VATSALA F7, Perfect Park Apartments, No 97 Balamurugan Nagar Main Road, Keelkattalai, Chennai 117 Proposed to be Used CHENNAI Designing and development of computer software, code, algorithm mobile application and other technology based  solutions for online marketing, advertisement promotional activities especially in social media. 4375","tm_class":"42","tm_phonetics":"SKT"},{"page_no":"268,journal no. 2048","trademark":"TQLIMS","details":"5176121    17/10/2021 TQ TECHNOLOGY PRIVATE LTD 36-B GANESH NAGAR A, NEW SANGNER ROAD SODALA, JAIPUR, Rajasthan, India, 302019 a company, incorporated under The Companies Act 2013, with corporate Identity Number U72900RJ2019PTC065108 Address for service in India/Attorney address: HEMLATA AGRAWAL 407, Bhavya Tower, Kabir Marg, Banipark, Jaipur 302016 Used Since :24/06/2019 AHMEDABAD Computer Software Design & development; Computer Software implementation & support; Consultancy for computer  software & hardware; Automation & Paperless work through computer software; System study for computer software and  computer software validation; All the services under class 42 4376","tm_class":"42","tm_phonetics":"TKLMS"},{"page_no":"270,journal no. 2048","trademark":"MATAJI","details":"5186864    25/10/2021 VIJAYKUMAR KAMLESHKUMAR MANGLANI OPP JANTA BANK, GAURAV PATH ROAD, DHANKAWAD, GODHRA individual Address for service in India/Attorney address: JAYA HINGORANI AND ASSOCIATES F-505, Titanium City Center, Near Sachin Tower, Anand Nagar Cross Road, 100 Feat Ring Road, Satellite, Ahmedabad 380015, Used Since :05/05/2015 AHMEDABAD “Scientific and technological services and research and design relating thereto; industrial analysis and research services;  design and development of computer hardware and software” 4378","tm_class":"42","tm_phonetics":"MTJ"},{"page_no":"271,journal no. 2048","trademark":"PULSEFIT","details":"5188020    26/10/2021 SBI CARDS & PAYMENT SERVICES LIMITED 401-402, 4th Floor, Aggarwal Millenium Tower, E-1,2,3, Netaji Subhash Palace, Pitampura, New Delhi - 110034 Public Limited Company Address for service in India/Attorney address: ATHENA LEGAL 37, LINK ROAD, FIRST FLOOR, LAJPAT NAGAR-III, NEW DELHI-110024. Proposed to be Used DELHI SERVICES FOR PROVIDING OF COMPUTER PROGRAMMING; ESPECIALLY DEVELOPMENT OF PROGRAMMES FOR  DATA PROCESSING IN CONNECTION WITH FINANCIAL AND MONETARY AFFAIRS AND FOR FACILITATING MONETARY  AND FINANCIAL TRANSACTIONS OVER COMPUTER NETWORKS INCLUDING THE INTERNET. 4379","tm_class":"42","tm_phonetics":"PLSFT"},{"page_no":"272,journal no. 2048","trademark":"PRESENT","details":"5192033    29/10/2021 MAHESH SOMANI PROPRIETOR OF PERFECT ENTERPRISES # 10, GANDHODI, KICHAIAH LANE, 1ST CROSS ROAD, L. R. ROAD CROSS, CHICKPET, BANGALORE-560053, KARNATAKA PROPRIETORSHIP Address for service in India/Attorney address: LALJI ADVOCATES A-48, Yojna Vihar, Delhi-110092 Proposed to be Used CHENNAI Scientific and technological services and research and design relating thereto; Industrial analysis, industrial research and  industrial design services; Quality control and authentication services; Design and development of computer hardware  and software. 4380","tm_class":"42","tm_phonetics":"PRSNT"},{"page_no":"273,journal no. 2048","trademark":"RACE CONFERENCES","details":"5196552    01/11/2021 SHALIMAR INFOTECH PRIVATE LIMITED 1001/1002, Lodha Supremus, Opp. The World Towers, S.B. Marg, Lower Parel, Mumbai – 400013 Private Limited Company Address for service in India/Agents address: UNIVERSAL LEGAL ADVOCATES 161/162 MITTAL COURT, A WING, JAMNALAL BAJAJ MARG, NARIMAN POINT, MUMBAI 400021. Used Since :16/04/2019 MUMBAI Scientific and technological services and research and design relating thereto; industrial analysis, industrial research and  industrial design services; quality control and authentication services; design and development of computer hardware and  software; services of engineers and scientists who undertake evaluations, estimates, research and reports in the scientific  and technological fields, including technological consultancy; software as a service (SaaS), platform as a service (PaaS);  computer programming; development of computer platforms; electronic data storage; software development in the  framework of software publishing; information technology services. 4381","tm_class":"42","tm_phonetics":"RS KNFRNSS"},{"page_no":"278,journal no. 2048","trademark":"BEARDMAN","details":"5198970    03/11/2021 MAVERIXPRO LIMITED NO. 7 /279, PODIYATTUVILA, VALAKOM P.O, KOTTARAKKARA, KOLLAM, KERALA, INDIA, 691532. . LEGAL ENTITY Address for service in India/Attorney address: SHAHZAD K ALISHAHZ LEGAL LLP, NBS BUILDING, M M ALI ROAD, PALAYAM, CALICUT - 673002. Proposed to be Used CHENNAI Programming of Software for Market Research Purposes 4386","tm_class":"42","tm_phonetics":"BRTMN"},{"page_no":"279,journal no. 2048","trademark":"RUN WITH THE BULL","details":"5198973    03/11/2021 MAVERIXPRO LIMITED NO. 7 /279, PODIYATTUVILA, VALAKOM P.O, KOTTARAKKARA, KOLLAM, KERALA, INDIA, 691532. . LEGAL ENTITY Address for service in India/Attorney address: SHAHZAD K ALISHAHZ LEGAL LLP, NBS BUILDING, M M ALI ROAD, PALAYAM, CALICUT - 673002. Proposed to be Used CHENNAI Scientific and technological services and research and design relating thereto; industrial analysis and research services;  design and development of computer hardware and software. 4387","tm_class":"42","tm_phonetics":"RN W0 TH BL"},{"page_no":"280,journal no. 2048","trademark":"ACLARIS THERAPEUTICS","details":"5200459    05/11/2021 Aclaris Therapeutics, Inc. Suite 200 640, Lee Road Wayne PENNSYLVANIA, 19087, U.S.A A corporation organized and existing under laws of the state of Delaware, U.S.A Address for service in India/Agents address: S.S. RANA & CO. 317, LAWYERS CHAMBERS, HIGH COURT OF DELHI, NEW DELHI - 110 003. Used Since :10/11/2017 DELHI Research and development of pharmaceutical preparations, products and technology in the fields of dermatology;  providing medical and scientific research information in the fields of dermatology, pharmaceuticals and clinical trials; drug  discovery services. 4388","tm_class":"42","tm_phonetics":"AKLRS 0RPTKS"},{"page_no":"283,journal no. 2048","trademark":"AZCTECH","details":"5201746    08/11/2021 AJAY BRAMHE Flat # 204, Sai Sharnam Apartment, Sector - 53, Noida, Uttar Pradesh AN INDIVIDUAL Address for service in India/Attorney address: LEGALRAASTA TECHNOLOGIES PRIVATE LTD B - 300 , Saraswati Vihar , Pitampura , Delhi - 110034 Proposed to be Used DELHI Computer consultancy services, Advisory and consultancy services relating to computer hardware, Technical advice and  consultancy services in the field of information technology, , Advice and consultancy in relation to computer networking  applications, computer programming services, Design and development of software in the field of mobile applications,  Design and development of operating system software, Advisory services relating to man- machine interfaces for computer  software, Programming of multimedia applications, Design of software, Design of virtual reality software, Custom design  of software packages, Application service provider [ASP], namely, hosting computer software applications of others,  Development and design of mobile applications, Engineering services relating to robotics, IT consultancy, advisory and  information services, Computer software technical support services, Recordal of seismic data, Troubleshooting of  computer hardware and software problems, computer programming services, Design of computer programs,  Development, updating and maintenance of software and database systems, Hire of computers, Hosting services, software  as a service, and rental of software, Rental of computer hardware and software, Development of computer firmware, Rental  of computer software, data processing equipment and computer peripheral devices, Rental services relating to data  processing equipment and computers, Advice and consultancy in relation to computer networking applications, cloud  computing services, Design and development of databases, Design, creation, hosting and maintenance of websites for  others, Computer systems analysis, Testing, analysis and monitoring of telecommunication signals, Information  technology services provided on an outsourcing basis, Monitoring of network systems, Data migration services, Computer  integration services, Hosting of portals on the internet, Design and development of software in the field of mobile  applications, recovery of computer data, Data security services, Providing virtual computer environments through cloud  computing, Encryption, decryption and authentication of information, messages and data, Electronic storage of data,  Design of models, Preparation of reports relating to computer programmes, Providing temporary use of non-downloadable  software for analyzing financial data and generating reports, IT project management, Web site design services, Hosting the  web sites of others, Creating and maintaining customized web pages 4391","tm_class":"42","tm_phonetics":"ASKTKSH"},{"page_no":"288,journal no. 2048","trademark":"DISPLAYSWEET","details":"5205999    11/11/2021 DISPLAY SWEET PTY LTD Level 1, 257 Chapel Street, Prahran, VIC, Australia 3181 Private Limited Address for service in India/Attorney address: VIVEK SUBHASH SADHALE Unit 3A, Level 3, PV House, 55, Damle Road, Lane adjacent to Indsearch, Off Law College Road, Pune, 411004 Maharashtra, India Proposed to be Used MUMBAI Computer programming: Computer programming services: Computer programming for data processing: Computer  software design, development and programming services: Consultancy and information services relating to computer  programming: Design, development and programming of computer software: Computer software development: Computer  software integration services; Design of computer software, computer firmware, computer hardware and computer  systems; Computer software consultancy and development; Development of computer database software; Development of  computer software application solutions; Hosting computer software applications for others; Information technology  consultation; Information services relating to information technology; Information technology [IT] consultancy services;  Research, design and development of information and communications technology: Software as a service [SaaS]:  Consulting services in the field of software as a service [SaaS]; Providing online non-downloadable web-based software;  Provision of online non-downloadable web-based computer programmes; Information technology [IT] services [computer  hardware, software and peripherals design and technical consultancy]; Technical consultancy relating to the design of  computer hardware, software and computer peripherals. 4396","tm_class":"42","tm_phonetics":"TSPLSWT"},{"page_no":"293,journal no. 2048","trademark":"SKILLIT","details":"5330756    16/02/2022 KANIKA KUMAR 2673-G SECOND FLOOR SECTOR-46 GURUGRAM-122003 individual Address for service in India/Attorney address: MAYANK GOEL Goel Niwas, J-62, Street No. 4, Laxmi Nagar, Delhi - 110092 Proposed to be Used DELHI Scientific and technological services and research and design relating thereto; Industrial analysis, industrial research and  industrial design services; Quality control and authentication services; Design and development of computer hardware  and software 4401","tm_class":"42","tm_phonetics":"SKLT"},{"page_no":"295,journal no. 2048","trademark":"AKALMA","details":"5332051    17/02/2022 AKALMA TECHNOLOGIES PVT LTD No. 275, G Block, 1st Phase, KHB Colony, Basaveshwaranagar, Bangalore 560079, Karnataka, India A Private Limited Company incorporated under the provisions of Indian Companies Act of 2013 Address for service in India/Attorney address: THIMMANNA P P ATV Legal, No. 1472, 2nd Cross, Judicial Layout, GKVK Post Bangalore 560065 Used Since :21/01/2021 CHENNAI Creating and designing website-based indexes of information for others, creating and maintaining websites for others,  website design consultancy, cloud based solutions, development of websites, mobile applications, Information  Technology and computer software consultancy. 4403","tm_class":"42","tm_phonetics":"AKLM"},{"page_no":"297,journal no. 2048","trademark":"CHATURWORKS","details":"5332054    17/02/2022 AKALMA TECHNOLOGIES PVT LTD No. 275, G Block, 1st Phase, KHB Colony, Basaveshwaranagar, Bangalore 560079, Karnataka, India A Private Limited Company incorporated under the provisions of Indian Companies Act of 2013 Address for service in India/Attorney address: THIMMANNA P P ATV Legal, No. 1472, 2nd Cross, Judicial Layout, GKVK Post Bangalore 560065 Proposed to be Used CHENNAI Providing services related to designing and development of customer relationship management software as a tool 4405","tm_class":"42","tm_phonetics":"SHTRWRKS"},{"page_no":"303,journal no. 2048","trademark":"ONEXTEL AURA","details":"5334616    18/02/2022 ONEXTEL MEDIA PRIVATE LIMITED (REPRESENTED BY ITS DIRECTOR, MR. MD RASHID ANWAR) H-218, Second Floor, Sector-63, Noida, Gautam Buddha Nagar – 201301, Uttar Pradesh PRIVATE LIMITED COMPANY Address for service in India/Attorney address: RAVINDER NEGI D1/25, Mansa Ram Park, Uttam Nagar, New Delhi-110059 Proposed to be Used To be associated with: 4495578, 4805004 DELHI Scientific and technological services and research and design relating thereto; Industrial analysis and industrial research  services; Design and development of computer hardware and software under class “42” 4411","tm_class":"42","tm_phonetics":"ONKSTL R"},{"page_no":"306,journal no. 2048","trademark":"PANUM","details":"5336670    19/02/2022 SHABRISH MENON 446A, GANESH KRUPA, BANAVASI ROAD, SIRSI, KARNATAKA - 581401 SOLE PROPRIETOR Address for service in India/Attorney address: VINODKUMAR KOTABAGI NO.25/1, UTSAV, MATRUSHREE LAYOUT, GANAGONDANAHALLI MAIN ROAD, KARIOBANAHALLI, BENGALURU -560  073, PH:9448335243 Proposed to be Used CHENNAI PROVIDING TEMPORARY USE OF ONLINE NON-DOWNLOADABLE INVESTMENT SOFTWARE; PROVIDING TEMPORARY  USE OF NON-DOWNLOADABLE SOFTWARE FOR FINANCIAL MANAGEMENT, PLANNING AND ANALYSIS. 4414","tm_class":"42","tm_phonetics":"PNM"},{"page_no":"308,journal no. 2048","trademark":"TRENDKART","details":"5336755    19/02/2022 BRAJPAL SINGH C/O. SATYA PRAKASH, D-73, LALITA BLOCK, SHASTRI NAGAR, ASHOK VIHAR H.O., DELHI-110052 PROPRIETOR Address for service in India/Agents address: JAI KISHAN A-177, Kamaruddin Nagar, Near Shiv Mandir, Nangloi, Delhi-110041. Proposed to be Used DELHI DESIGN AND DEVELOPMENT OF COMPUTER SOFTWARE AND WEB SITES; HOSTING WEB SITES; PROVIDING ONLINE  NON-DOWNLOADABLE SOFTWARE AND ONLINE SOFTWARE TOOLS, CREATING ONLINE COMMUNITY FOR USERS AND  HOSITING ON-LINE WEB FACILITIES FOR OTHERS TO PARTICIPATE IN DISCUSSIONS, FORM VIRTUAL COMMUNITIES,  CONDUCT ONLINE MEETINGS, INTERACTIVE DISCUSSIONS RELATING TO BOOKS, MUSIC, MOVIES, PERIODICALS AND  OTHER MEDIA. 4416","tm_class":"42","tm_phonetics":"TRNTKRT"},{"page_no":"323,journal no. 2048","trademark":"NANDAKA VENTURES","details":"5342574    24/02/2022 NANDAKA VENTURES LLP PLOT NO.512, SRI LEELA, ROAD NO.31, JUBILEE HILLS, HYDERABAD, RANGAREDDY, TELANGANA, 500033, INDIA Body Incorporated Address for service in India/Attorney address: P. SAILAKSHMI NO.250/8, 1ST FLOOR, KAMALAM, APARTMENTS, KALI AMMAN KOIL STREET, NATESAN NAGAR, VIRUGAMBAKKAM,  CHENNAI-600092. Used Since :27/10/2020 CHENNAI Architectural Services Relating to Land Development; Land Surveying Services; Consultancy In The Field Of Architecture  And Construction Drafting; Interior Design; Interior Decoration Consultancy; Interior Design Services, Design Of Building  Interiors; Consultancy Relating To Interior Decoration; Advisory Services Relating To Interior Design; Design Of Building  Interiors And Exteriors. 4431","tm_class":"42","tm_phonetics":"NNTK FNTRS"},{"page_no":"325,journal no. 2048","trademark":"DUBVERSE","details":"5342582    24/02/2022 LENSMATIC SOLUTIONS PRIVATE LIMITED F-219, Alpha-1, Neelkanth Plaza Greater Noida, Gautam BudhNagar GreaterNoida Gautam Buddha Nagar UP 201306 IN Private Limited Company Address for service in India/Agents address: GAURAV SAINI 264-265, Anarkali Bazar Complex,Jhandewalan Extension,New Delhi-110055. Used Since :08/10/2021 DELHI The applicant is providing IT Software Development Services, scientific and technological services and research and  design relating thereto, industrial analysis and research services, design and development of computer hardware and  software. 4433","tm_class":"42","tm_phonetics":"TBFRS"},{"page_no":"329,journal no. 2048","trademark":"WARDWIZARD","details":"5343071    24/02/2022 YATIN GUPTE 12/a, SURAMYA BUNGALOWS, RAIPURA ROAD, BHAYALI GAON, BEHIND LALGURU FARM, BHAYLI, VADODARA –  391410, (GUJARAT) INDIVIDUAL Address for service in India/Attorney address: YASH SURYAWALA N/7, 1st floor, Dhavalgiri Aprtment, B/h Dr. Swadiya\"s Hospital, Nr. Kuber Bhuvan, Kothi, Vadodara, Gujarat. Proposed to be Used AHMEDABAD Analysis for oil-field exploitation, architectural consultancy, architectural services, authenticating works of art,  bacteriological research, biological research, business card design, calibration [measuring], cartography services,  chemical analysis, chemical research, chemistry services, clinical trials, cloud computing, cloud seeding, computer  programming, computer rental, computer security consultancy, computer software consultancy, computer software  design, computer system analysis, computer system design, computer technology consultancy, computer virus protection  services, conducting technical project studies, construction drafting, consultancy in the design and development of  computer hardware, consultancy in the field of energy-saving, conversion of computer programs and data, other than  physical conversion, conversion of data or documents from physical to electronic media, cosmetic research, creating and  designing website-based indexes of information for others [information technology services], creating and maintaining  websites for others, data encryption services, data security consultancy, design of interior decor, development of  computer platforms, digitization of documents [scanning], dress designing, duplication of computer programs, electronic  data storage, electronic monitoring of credit card activity to detect fraud via the internet, electronic monitoring of  personally identifying information to detect identity theft via the internet, energy auditing, engineering, exploration  services in the field of the oil, gas and mining industries, geological prospecting, geological research, geological surveys,  graphic arts design, graphic design of promotional materials, handwriting analysis [graphology], hosting computer sites  [web sites], industrial design, information technology [IT] consultancy, information technology services provided on an  outsourcing basis, installation of computer software, interior design, internet security consultancy, land surveying,  maintenance of computer software, material testing, mechanical research, medical research, meteorological information,  monitoring of computer systems by remote access, monitoring of computer systems for detecting unauthorized access or  data breach, monitoring of computer systems to detect breakdowns, off-site data backup, oil prospecting, oil- field surveys,  oil-well testing, packaging design, platform as a service [PaaS], providing information relating to computer technology and  programming via a website, providing scientific information, advice and consultancy relating to carbon offsetting,  providing search engines for the internet, quality control, quality evaluation of standing timber, quality evaluation of wool,  recovery of computer data, rental of computer software, rental of meters for the recording of energy consumption, rental of  web servers, research and development of new products for others, research in the field of building construction, research  in the field of environmental protection, research in the field of physics, research in the field of telecommunications  technology, research in the field of welding, scientific and technological research in the field of natural disasters, scientific  and technological research relating to patent mapping, scientific laboratory services, scientific research, server hosting,  software as a service [SaaS], software development in the framework of software publishing, styling [industrial design],  surveying, technical writing, technological consultancy, technological research, telecommunications technology  consultancy, textile testing, underwater exploration, unlocking of mobile phones, updating of computer software, urban  planning, user authentication services using single sign-on technology for online software applications, user  authentication services using technology for e-commerce transactions, vehicle roadworthiness testing, water analysis,  weather forecasting, website design consultancy. 4437","tm_class":"42","tm_phonetics":"WRTWSRT"},{"page_no":"330,journal no. 2048","trademark":"JOYE-BIKE","details":"5343144    24/02/2022 YATIN GUPTE 12/a, SURAMYA BUNGALOWS, RAIPURA ROAD, BHAYALI GAON, BEHIND LALGURU FARM, BHAYLI, VADODARA –  391410, (GUJARAT) INDIVIDUAL Address for service in India/Attorney address: YASH SURYAWALA N/7, 1st floor, Dhavalgiri Aprtment, B/h Dr. Swadiya\"s Hospital, Nr. Kuber Bhuvan, Kothi, Vadodara, Gujarat. Proposed to be Used AHMEDABAD Analysis for oil-field exploitation, architectural consultancy, architectural services, authenticating works of art,  bacteriological research, biological research, business card design, calibration [measuring], cartography services,  chemical analysis, chemical research, chemistry services, clinical trials, cloud computing, cloud seeding, computer  programming, computer rental, computer security consultancy, computer software consultancy, computer software  design, computer system analysis, computer system design, computer technology consultancy, computer virus protection  services, conducting technical project studies, construction drafting, consultancy in the design and development of  computer hardware, consultancy in the field of energy-saving, conversion of computer programs and data, other than  physical conversion, conversion of data or documents from physical to electronic media, cosmetic research, creating and  designing website-based indexes of information for others [information technology services], creating and maintaining  websites for others, data encryption services, data security consultancy, design of interior decor, development of  computer platforms, digitization of documents [scanning], dress designing, duplication of computer programs, electronic  data storage, electronic monitoring of credit card activity to detect fraud via the internet, electronic monitoring of  personally identifying information to detect identity theft via the internet, energy auditing, engineering, exploration  services in the field of the oil, gas and mining industries, geological prospecting, geological research, geological surveys,  graphic arts design, graphic design of promotional materials, handwriting analysis [graphology], hosting computer sites  [web sites], industrial design, information technology [IT] consultancy, information technology services provided on an  outsourcing basis, installation of computer software, interior design, internet security consultancy, land surveying,  maintenance of computer software, material testing, mechanical research, medical research, meteorological information,  monitoring of computer systems by remote access, monitoring of computer systems for detecting unauthorized access or  data breach, monitoring of computer systems to detect breakdowns, off-site data backup, oil prospecting, oil- field surveys,  oil-well testing, packaging design, platform as a service [PaaS], providing information relating to computer technology and  programming via a website, providing scientific information, advice and consultancy relating to carbon offsetting,  providing search engines for the internet, quality control, quality evaluation of standing timber, quality evaluation of wool,  recovery of computer data, rental of computer software, rental of meters for the recording of energy consumption, rental of  web servers, research and development of new products for others, research in the field of building construction, research  in the field of environmental protection, research in the field of physics, research in the field of telecommunications  technology, research in the field of welding, scientific and technological research in the field of natural disasters, scientific  and technological research relating to patent mapping, scientific laboratory services, scientific research, server hosting,  software as a service [SaaS], software development in the framework of software publishing, styling [industrial design],  surveying, technical writing, technological consultancy, technological research, telecommunications technology  consultancy, textile testing, underwater exploration, unlocking of mobile phones, updating of computer software, urban  planning, user authentication services using single sign-on technology for online software applications, user  authentication services using technology for e-commerce transactions, vehicle roadworthiness testing, water analysis,  weather forecasting, website design consultancy. 4438","tm_class":"42","tm_phonetics":"JY-BK"},{"page_no":"333,journal no. 2048","trademark":"ANSHIN","details":"5344182    25/02/2022 DR. MANN LIFESCIENCES PRIVATE LIMITED 2 D-Block Market, LSC, Vasant Vihar, New Delhi 110057. Body Incorporate Address for service in India/Agents address: D K LALWANI & CO. E-64 (LGF & GF), Greater Kailash-3, Masjid Moth, New Delhi-110048. Proposed to be Used DELHI Scientific and technological services and research and design relating thereto; Industrial analysis, industrial research and  industrial design services; Computer services; Designing and design services; Information technology services; Testing,  authentication and quality control services; Design and development of computer hardware and software. 4441","tm_class":"42","tm_phonetics":"ANKSHN"},{"page_no":"334,journal no. 2048","trademark":"FIBE","details":"5344289    25/02/2022 SOCIAL WORTH TECHNOLOGIES PRIVATE LIMITED 404, The Chambers, Viman Nagar, Pune - 411014, Maharashtra, India Private Limited Address for service in India/Attorney address: VIVEK SUBHASH SADHALE Unit 3A, Level 3, PV House, 55, Damle Road, Lane adjacent to Indsearch, Off Law College Road, Pune, 411004 Maharashtra, India Proposed to be Used MUMBAI Design and development of software in the field of mobile applications; Providing temporary use of web-based  applications; Software development services; Computer software design, development and programming services;  Application service provider; Hosting multimedia and interactive applications; Hosting of computer software applications  for others; Hosting computer application software in the field of knowledge management for creating searchable  databases of information and data; Providing online trading platform for securities brokerage; Providing an online trading  platform for hedge funds brokerage; Hosting platforms on the Internet. 4442","tm_class":"42","tm_phonetics":"FB"},{"page_no":"339,journal no. 2048","trademark":"ITOKEN","details":"5345110    25/02/2022 BLAZEKTECH INTERNET TECHNOLOGY SERVICE LIMITED OMC Chambers, Wickhams Cay 1, Road Town, Tortola, British Virgin Islands A Company incorporated under the laws of British Virgin Islands Address for service in India/Attorney address: ACE INDIA LEGAL CONSULTANTS LLP F-83, Ground Floor, Green Park (Main), New Delhi – 110016 Proposed to be Used DELHI Providing online non-downloadable software for sending, receiving, and transmitting digital currency; Providing online  non-downloadable software for managing digital currency payment and exchange transactions; Providing on-line non- downloadable computer software for use as a cryptocurrency wallet; Providing online non-downloadable software for use  in user identification, authentication, and verification; Providing online non- downloadable software for enabling generation  of multiple crypto-wallets from a single seed phrase; Providing online non-downloadable software for generating and  storing cryptographic keys used to create or modify blockchain accounts; Hosting of platforms on the internet; Providing  temporary use of on-line non-downloadable software for processing electronic payments; (PaaS) Platform as a Service;  Software as a Service. 4447","tm_class":"42","tm_phonetics":"ITKN"},{"page_no":"340,journal no. 2048","trademark":"INDAS ON POINT","details":"5345595    25/02/2022 DELOITTE TOUCHE TOHMATSU INDIA LLP One International Center, Tower 3, 32nd Floor, Senapati Bapat Marg, Prabhadevi (W), Mumbai -400013 LLP Address for service in India/Attorney address: ANURADHA SUNEET MAHESHWARI Lex Mantis D-4,B-Wing, 4th Floor, Barodawala Mansion, Opp. RBI Bldg, Above ICICI Bank, 81, Dr. Annie Besant Road, Mumbai 400  018, India Proposed to be Used MUMBAI Services relating to scientific and technological services and research and design relating thereto; industrial analysis and  research services; design and development of computer software 4448","tm_class":"42","tm_phonetics":"INTS N PNT"},{"page_no":"342,journal no. 2048","trademark":"7VIK PACHAK","details":"5345725    26/02/2022 SHUBHADA DHEBAR B/702, Kolag Appartment, ANS Phadke Marg, Near Suba Galaxy Hotel, Andheri East,Mumbai 400069 An Individual – An Indian Resident Address for service in India/Attorney address: SHILPA DAMANIA B/4-2, Bansi Ratna, Mahesh Nagar, S. V.Road, Goregaon west, Mumbai - 400062 Proposed to be Used To be associated with: 5184534 MUMBAI Scientific and technological services and research and design relating thereto; industrial analysis, industrial research and  industrial design services; quality control and authentication services; design and development of computer hardware and  software, quality control, research and development of new products for others, surveying, material testing 4450","tm_class":"42","tm_phonetics":"7FK PKSHK"},{"page_no":"343,journal no. 2048","trademark":"7VIK DAANT","details":"5345727    26/02/2022 SHUBHADA DHEBAR B/702, Kolag Appartment, ANS Phadke Marg, Near Suba Galaxy Hotel, Andheri East,Mumbai 400069 An Individual – An Indian Resident Address for service in India/Attorney address: SHILPA DAMANIA B/4-2, Bansi Ratna, Mahesh Nagar, S. V.Road, Goregaon west, Mumbai - 400062 Proposed to be Used To be associated with: 5184534 MUMBAI Scientific and technological services and research and design relating thereto; industrial analysis, industrial research and  industrial design services; quality control and authentication services; design and development of computer hardware and  software, quality control, research and development of new products for others, surveying, material testing 4451","tm_class":"42","tm_phonetics":"7FK TNT"},{"page_no":"344,journal no. 2048","trademark":"7VIK INDRIYA","details":"5345728    26/02/2022 SHUBHADA DHEBAR B/702, Kolag Appartment, ANS Phadke Marg, Near Suba Galaxy Hotel, Andheri East,Mumbai 400069 An Individual – An Indian Resident Address for service in India/Attorney address: SHILPA DAMANIA B/4-2, Bansi Ratna, Mahesh Nagar, S. V.Road, Goregaon west, Mumbai - 400062 Proposed to be Used To be associated with: 5184534 MUMBAI Scientific and technological services and research and design relating thereto; industrial analysis, industrial research and  industrial design services; quality control and authentication services; design and development of computer hardware and  software, quality control, research and development of new products for others, surveying, material testing 4452","tm_class":"42","tm_phonetics":"7FK NTRY"},{"page_no":"345,journal no. 2048","trademark":"7VIK SHANTI","details":"5345729    26/02/2022 SHUBHADA DHEBAR B/702, Kolag Appartment, ANS Phadke Marg, Near Suba Galaxy Hotel, Andheri East,Mumbai 400069 An Individual – An Indian Resident Address for service in India/Attorney address: SHILPA DAMANIA B/4-2, Bansi Ratna, Mahesh Nagar, S. V.Road, Goregaon west, Mumbai - 400062 Proposed to be Used To be associated with: 5184534 MUMBAI Scientific and technological services and research and design relating thereto; industrial analysis, industrial research and  industrial design services; quality control and authentication services; design and development of computer hardware and  software, quality control, research and development of new products for others, surveying, material testing 4453","tm_class":"42","tm_phonetics":"7FK KSHNT"},{"page_no":"346,journal no. 2048","trademark":"7VIK KANTHA","details":"5345731    26/02/2022 SHUBHADA DHEBAR B/702, Kolag Appartment, ANS Phadke Marg, Near Suba Galaxy Hotel, Andheri East,Mumbai 400069 An Individual – An Indian Resident Address for service in India/Attorney address: SHILPA DAMANIA B/4-2, Bansi Ratna, Mahesh Nagar, S. V.Road, Goregaon west, Mumbai - 400062 Proposed to be Used To be associated with: 5184534 MUMBAI Scientific and technological services and research and design relating thereto; industrial analysis, industrial research and  industrial design services; quality control and authentication services; design and development of computer hardware and  software, quality control, research and development of new products for others, surveying, material testing 4454","tm_class":"42","tm_phonetics":"7FK KN0"},{"page_no":"347,journal no. 2048","trademark":"ALGOWIN","details":"5345988    26/02/2022 SIDDHARTH KRISHNAN 201, Maithili's Vyom, Plot 121, Sector 12, Vashi, Navi Mumbai, Maharashtra - 400703 SOLE PROPRIETOR Address for service in India/Agents address: BOBY VARGHESE. 1ST FLOOR, GALAXY TOWER, SUB JAIL ROAD, ALWAYE, KERALA. - 683 101. Proposed to be Used MUMBAI Development and testing of computing methods, algorithms and software 4455","tm_class":"42","tm_phonetics":"ALKWN"},{"page_no":"350,journal no. 2048","trademark":"VALGORIK","details":"5346159    26/02/2022 VALGORIK TECHNOLOGIES PVT. LTD. 1021/44, Dev Deh Nagar, Dhola Bhata, Ajmer, Rajasthan, India, 305001 Body Incorporate Address for service in India/Attorney address: PRITAM SINGH SONI N 2 Dhola Bhata Ajmer Rajasthan 305001 Used Since :07/02/2022 AHMEDABAD Scientific and technological services and research and design relating thereto; industrial analysis and research services;  design and development of computer hardware and software, in Class 42 4458","tm_class":"42","tm_phonetics":"FLKRK"},{"page_no":"355,journal no. 2048","trademark":"RAJAPUSHPA","details":"5347111    25/02/2022 M/S. RAJAPUSHPA PROPERTIES PRIVATE LIMITED Rajapushpa Summit, Sy No. 115/1 And 130/P, 6th Floor, Financial District, Nanakramguda, Hyderabad – 500008,Telangana, India Body Incorporate Address for service in India/Agents address: S.BALAJANAKI SUITE NO 27 C & D, 3RD FLOOR, PANDU KLIX PLAZA, 168 THAMBU CHETTY STREET, CHENNAI-600 001. Used Since :20/11/2009 CHENNAI Interior Designing, Engineering, Architecture, Construction Drafting, Architectural Consultation, Land Surveying. 4463","tm_class":"42","tm_phonetics":"RJPKSHP"},{"page_no":"356,journal no. 2048","trademark":"FLOCAMO","details":"5348173    25/02/2022 FINCONVENIO SERVICES PVT LTD 12, Kanchi Nilayam, South Usman Road T .Nagar, Chennai – 600017 COMPANY Address for service in India/Attorney address: JACOB KURIAN NEW NO 21 (OLD NO 11), 2ND AVENUE, HARRINGTON ROAD, CHETPET, CHENNAI- 600031. Proposed to be Used CHENNAI Saas (Software as a service) and PaaS (Platform as a service) Services being services Included in Class 42. 4464","tm_class":"42","tm_phonetics":"FLKM"},{"page_no":"359,journal no. 2048","trademark":"MAYHEM STUDIOS","details":"5349747    01/03/2022 M-LEAGUE PTE LTD 50 Raffles Place, #19-00 Singapore Land Tower, Singapore 048623 Body Incorporate Address for service in India/Attorney address: LEXPORT K 1/114, First Floor, Chittaranjan Park, New Delhi - 110019 Proposed to be Used DELHI Access and leasing access time to video games via telecom network and for server, including Internet and cable, satellite  or terrestrial television network; leasing access time to telecommunication network and Internet site and digital or  analogue or interactive television; computer programming and program, peripherals, smartcard, Internet, intranet and  Internet for mobile telephone, computers & digital or analogue television decoders; design and production of games for  digital / analogue television decoders, for mobile telephone, digital personal assistant (organisers) or for computers 4467","tm_class":"42","tm_phonetics":"MHM STXS"},{"page_no":"362,journal no. 2048","trademark":"SMARTSEVAK","details":"5350443    26/02/2022 SWAPNIL JAIN C/O Suchita Jain Near Kanwantia Hospital D-16 B Janpath Suraj Villa Shastri Nagar Jaipur Rajasthand-302016 Individual Address for service in India/Attorney address: URVASHI JAIN S-4, Shree Gopal Nagar, Gopalpura Bypass, Jaipur-302019, Rajasthan Used Since :05/12/2020 AHMEDABAD Scientific and technological services and research and design relating thereto; industrial analysis and research services;  design and development of computer hardware and software. 4470","tm_class":"42","tm_phonetics":"SMRTSFK"},{"page_no":"364,journal no. 2048","trademark":"IVRBOT","details":"5351045    01/03/2022 COROVER PRIVATE LIMITED CoRover Private Limited A125, Kethana Blossom, Kadubeesanahalli, Panathur Road, Bangalore-560103 , Karnataka Private Limited Company Address for service in India/Attorney address: SNEHA MANJOORAN F-97, 4th Floor, Anna Nagar (East), Chennai - 600102, Tamil Nadu.  Used Since :15/12/2019 CHENNAI Scientific and technological services and research and design relating thereto; industrial analysis, industrial research and  industrial design services; quality control and authentication services; design and development of computer hardware and  software. 4472","tm_class":"42","tm_phonetics":"IFRBT"},{"page_no":"369,journal no. 2048","trademark":"GENLEAP","details":"5352299    02/03/2022 GENLEAP ECOSYSTEM PRIVATE LIMITED C-11, Greater Kailash Enclave -1, New Delhi-110048 (INDIA) Company Address for service in India/Attorney address: SUNIL TYAGI 2, Palam Marg, Vasant Vihar, New Delhi-110057 Used Since :01/06/2021 DELHI Scientific and technological services, research and consultancy; industrial analysis, industrial research and industrial  design services; design and development of computer hardware and software; software as a service [SaaS]. 4477","tm_class":"42","tm_phonetics":"JNLP"},{"page_no":"370,journal no. 2048","trademark":"GENDISCOVER","details":"5352303    02/03/2022 GENLEAP ECOSYSTEM PRIVATE LIMITED C-11, Greater Kailash Enclave -1, New Delhi-110048 (INDIA) Company Address for service in India/Attorney address: SUNIL TYAGI 2, Palam Marg, Vasant Vihar, New Delhi-110057 Proposed to be Used DELHI Scientific and technological services, research and consultancy; industrial analysis, industrial research and industrial  design services; design and development of computer hardware and software; software as a service [SaaS]. 4478","tm_class":"42","tm_phonetics":"JNTSKFR"},{"page_no":"377,journal no. 2048","trademark":"FLY","details":"4197712    05/06/2019 ARPAN GUPTA H .NO.13-C,Club Road, Punjabi Bagh West,Paschim Vihar,NEW DELHI SERVICE PROVIDERS PROPRIETOR Proposed to be Used D ELHI SERVICES FOR PROVIDING FOOD, DRINK AND TEMPORARY ACC OMMODATION MAINLY FALL UNDER TRADEMARK  CLASS 43 FOR TRADEMARK REGISTRATION 4485","tm_class":"43","tm_phonetics":"FL"},{"page_no":"380,journal no. 2048","trademark":"EJA","details":"4285610    06/09/2019 LEISURE ARTIZANS PRIVATE LIMITED C -348, GROUND FLOOR, SEC-7, DWARKA, NEW DELHI-110075 A PRIVATE LIMITED COMPANY Address for service in India/Attorney address: NEHA SINHA ADV., B -9, 2ND FLOOR, HOUSING SOCIETY SOUTH EXTN PART-I, NEW DELHI-110049 Used Since :01/07/2019 DELHI Includes mainly services provided by persons or esta blishments whose aim is to prepare food and drink for consumption  and services providing bed and board in hotels, boarding houses or other establishments providing temporary  accommodations. 4488","tm_class":"43","tm_phonetics":"EJ"},{"page_no":"382,journal no. 2048","trademark":"THE GOURMET KITCHEN COMPANY","details":"4313313    05/10/2019 AAKASH CATERERS PVT. LTD. A COMPANY INCORPORATED UND ER THE COMPANIES ACT, 1956 \"R R HOUSE\", ATIKA IND. AREA STREET NO.16, NEAR BSNL TELEPHONE EXCHANGE, PIPALIYA HALL ROAD, DHEBAR  ROAD (SOUTH), RAJKOT - 360002. GUJARAT - INDIA. NEW Address for service in India/Attorney address: T.C.PATEL & CO., 2 29, GOLDEN PLAZA, OPP. ARYA SAMAJ MANDIR, OUT SIDE RAIPUR GATE, KANKARIA, AHMEDABAD - 380 022 Proposed to be Used A HMEDABAD SERVICES RELATED TO PROVIDING FOOD AND SOFT DRINKS,  TEMPORARY ACCOMMODATION, CLUBS, CAFES,  BANQUET HALL, HOTELS, RESTAURANTS, CATERING SERVICES, READY TO EAT FOODS, SNACKS, VADAPAV, DABELI,  SANDWICH,PIZZA, BHEL AND CHINESE FOOD AND ICE CREAM PARLOUR INCLUDED IN CLASS – 43. 4490","tm_class":"43","tm_phonetics":"0 KRMT KTKSHN KMPN"},{"page_no":"388,journal no. 2048","trademark":"AARSH VILLA","details":"4681279    30/09/2020 RESHMA JWALAPRASAD MISTRY 3 03, D-Wing, Shiv Om Complex Housing Society, Kacheri Road, Mudre-Budruk, Karjat-410201 Individual Address for service in India/Agents address: ANKIT SETHI 1 04, Monalisa Apartment, Kasturba Road, Near Bharat Bank, New Era Malad Station Road, Malad West, Mumbai-400064. Proposed to be Used M UMBAI Resort hotel services as covered under class 43. 4496","tm_class":"43","tm_phonetics":"ARKSH FL"},{"page_no":"395,journal no. 2048","trademark":"YUM CHA HOUSE","details":"4703942    15/10/2020 VARUN TULI L aburnum Apartments LTH 312A, Sushant Lok I, Sector 28, Gurgaon 122009 SERVICE PROVIDER Single firm Address for service in India/Agents address: ANAND AND ANAND. B -41,NIZAMUDDIN EAST, NEW DELHI - 110 013. Proposed to be Used M UMBAI Services for providing food and drink; temporary acc ommodation including without limitation canteen services; cafeteria  services; café services; hotel services; temporary accommodation reservations; food and drink catering; personal chef  services; restaurant services; self-service restaurant services; snack-bar services; udon and soba restaurant services;  washoku restaurant services; decorating of food. No claim is made to the exclusive right to use \"YUM\", \"CHA\", or \"HOUSE\" apart from the mark as shown.. THIS IS SUBJECT TO ASSOCIATION WITH REGISTERED/PENDING REGISTRATION NO..2066887, 3323343 & 3431909.. 4503","tm_class":"43","tm_phonetics":"YM KSH HS"},{"page_no":"397,journal no. 2048","trademark":"CITY BITES","details":"4738030    09/11/2020 MOHANDAS KOTTIL trading as ;VSM FOODS 8501, Prestige Monte Carlo, Doddaballpur Road, Yelah anka, Bangalore 560 064 SERVICE PROVIDERS PARTNERSHIP FIRM Proposed to be Used C HENNAI PROVIDING FOOD AND BEVERAGES,PROVIDING OF FOOD AND D RINK VIA A MOBILE TRUCK,CAFETERIAS, FAST FOOD  RESTAURANT SERVICES, HOTEL RESTAURANT SERVICES, CATERING SERVICES. 4505","tm_class":"43","tm_phonetics":"ST BTS"},{"page_no":"403,journal no. 2048","trademark":"TOOKA RESTO BAR","details":"4798345    28/12/2020 R S SHARMA AND COMPANY (DELHI) PRIVATE LIMITED S AHAKAR MARG, TONK ROAD, JAIPUR, RAJASTHAN, 302015 Private Limited Address for service in India/Agents address: G. D. BANSAL & ASSOCIATES. M -118-B, MAHESH COLONY, LAXMI MANDIR PHATAK, JAIPUR - 302 015. (RAJASTHAN) Proposed to be Used A HMEDABAD Hotels, Hotel reservations, Hotel accommodation serv ices, Hotel restaurant services, Resort hotel services, Hotel catering  services, Hotel room booking services, Booking of hotel accommodation, Hotels, hostels and boarding houses, holiday  and tourist accommodation, Services for providing food and drink; Temporary accommodation, Reservation of temporary  accommodation in the nature of holiday homes, Private members dining club services, Private members drinking club  services, Night club services [provision of food], Club services for the provision of food and drink, Pubs, Arranging of  wedding receptions [venues], Arranging of wedding receptions [food and drink], Motel services, Event facilities and  temporary office and meeting facilities. 4511","tm_class":"43","tm_phonetics":"TK RST BR"},{"page_no":"406,journal no. 2048","trademark":"MIRACLE GREENS","details":"4871702    19/02/2021 BANDARU SRINIVAS S urvey No 318, Damarlapalli Village, Nandigama Mandal , Ranga Reddy District , Mahabubnangar, 509325 CITIZEN OF INDIA Address for service in India/Attorney address: DEEPESH PIPALWA #  115 & 116, First Floor, Model House, Dwarakapuri Colony, Punjagutta, Hyderabad, 500082 Telangana, India. Proposed to be Used C HENNAI RESTAURANTS, HOTELS, PROVIDING FOOD AND DRINK SERVIC ES, CATERING, PROVIDING REVIEWS OF HOTELS AND  RESTAURANTS 4514","tm_class":"43","tm_phonetics":"MRKL KRNS"},{"page_no":"408,journal no. 2048","trademark":"CHAI RUNNER","details":"4872651    20/02/2021 GANADINNI FINE FOODS IMPEX PVT LTD P lot # 31, Sri Santhoshimatha Colony, Road # 3, Hastinapuram, Hyderabad-500079, Telangana, India Private limited company Address for service in India/Attorney address: PUVVULA VINAY KUMAR E eva IP & IT Services Pvt Ltd, 1st Floor, HIG 139, Bharat Nagar Colony, Moosapet, Hyderabad - 500018, Telangana Proposed to be Used C HENNAI Restaurants, Carry-out restaurants, Restaurant servi ces, Take-out restaurant services, Fast food restaurants, Providing  food and drink, Self-service restaurants, Cafeterias, Tea rooms included in class 43. SUBJECT TO USE THE MARK AS A WHOLE AS REPRESENTED IN THE FORM OF APPLICATION. 4516","tm_class":"43","tm_phonetics":"SH RNR"},{"page_no":"416,journal no. 2048","trademark":"ARAB HOUSE","details":"4885795    02/03/2021 SYED UMAR FAROOQ, PROPRIETOR TRADING AS ARAB HOUSE P LOT NO. 152, H.NO.8-1398/PM/152/A, PARAMOUNT HILLS, GATE NO.1, TOLICHOWKI, HYDERABAD - 500008,  TELANGANA, INDIA AN INDIAN SOLE PROPRIETORSHIP FIRM Address for service in India/Attorney address: ADHI LEGAL SOLUTIONS O LD NO:4/2,NEW NO:9/2, ARMENIAN STREET, 2ND FLOOR, PARRYS, CHENNAI-600 001, INDIA Used Since :27/09/2020 CHENNAI HOTEL AND RESTAURANT SERVICES, RESTAURANT AND CATERI NG SERVICES, PROVIDING FOOD AND DRINK, TAKE- AWAY FAST FOOD SERVICES, RESERVATION AND BOOKING SERVICES FOR HOTELS, RESTAURANTS AND HOLIDAY  ACCOMMODATION SUBJECT TO USE THE MARK AS A WHOLE AS REPRESENTED IN THE FORM OF APPLICATION AND RESTRICT THE  AREA ONLY TO ANDHRA AND TELANGANA.. 4524","tm_class":"43","tm_phonetics":"ARB HS"},{"page_no":"423,journal no. 2048","trademark":"YOUR PARADISE BIRYANI YOUR WAY","details":"4927763    31/03/2021 PARADISE FOOD COURT PVT. LTD., D .No:1-7-186 to 193, S.D.Road, Secunderabad - 500003 (T.S) India. Body Incorporate Address for service in India/Agents address: RAO & RAO. 1 2-10-651/3, ROAD NO.2, INDIRANAGAR, WARASLGUDA SECUNDERABAD - 500 061 ( A.P.). Proposed to be Used C HENNAI Providing food and drink; temporary accommodation in cluding cafes, cafeterias, canteens, food and drinks catering;  hotels, hotel reservation, motels, snack bars, tourist home services, self-service restaurants, providing camp ground  facilities and holiday camp services, fast – food restaurant services and take-away food services. SUBJECT TO USE THE MARK AS A WHOLE AS REPRESENTED IN THE FORM OF APPLICATION. THIS IS SUBJECT TO ASSOCIATION WITH REGISTERED/PENDING REGISTRATION NO..3675865 and 3675866. 4531","tm_class":"43","tm_phonetics":"YR PRTS BRYN YR W"},{"page_no":"424,journal no. 2048","trademark":"RESORTS","details":"4947823    16/04/2021 SANJAY KUMAR C /O North Point Residential School Opp. SSB CAMP Ranidanga Siliguri Darjeeling 734012 Individual Address for service in India/Agents address: ITAG BUSINESS SOLUTIONS LTD. 8 3/1,BELIAGHATA MAIN ROAD (E M BYEPASS CROSSING),SHUBHAM PLAZA,KOLKATA 700 010,W.B.,INDIA. Proposed to be Used K OLKATA Services for providing food and drink; temporary acc ommodation THIS IS CONDITION OF REGISTRATION THAT LABELS SHALL BE USED TOGETHER.. 4532","tm_class":"43","tm_phonetics":"RSRTS"},{"page_no":"436,journal no. 2048","trademark":"NEIGHBORFOOD","details":"5195298    30/10/2021 INTERLOCK RETAIL PRIVATE LIMITED N o. 14/3, 2nd Cross, Bhavani Nagar, Bannerghatta Main Road, DRC Post, Bangalore - 560029, Karnataka PRIVATE LIMITED Address for service in India/Attorney address: NADAR VENNILA C -102, Calypso, Bloomfield, Amit Enterprises Housing,Nr. Gold Gym, NH-4, Mumbai-Bangalore Highway,Sinhagad Road, Ambegaon  (BK), Pune-411 046  Proposed to be Used C HENNAI Restaurant services 4544","tm_class":"43","tm_phonetics":"NBRFT"},{"page_no":"437,journal no. 2048","trademark":"THE CRUSTMASTER","details":"5195317    30/10/2021 Foodesco LLP V adakkeveettil House, 62/979 Chakkalapadam, LFC Road, Kaloor, Cochin, Kerala-682017, India A limited liability partnership (LLP) Address for service in India/Attorney address: MARK SHIELD 1 061, B/13, Ward 7 Mehrauli, New Delhi- 110030, India  Proposed to be Used C HENNAI Services for providing food and drink; temporary acc ommodation. 4545","tm_class":"43","tm_phonetics":"0 KRSTMSTR"},{"page_no":"441,journal no. 2048","trademark":"THE BIG CHILL HOUSE","details":"5197230    01/11/2021 MR. DINESH GYANCHANDANI TRADING AS THE BIG CHILL HOU SE S. No. G-1, Satkar Apartment, Tabla Market, Maskasath, Itwari, Nagpur- 440 002 ( Maharashtra) Proprietor Address for service in India/Attorney address: LAW PROTECTORS D humal Nivas, Behind Kamla Nehru Hospital, Near Barane School, 104, Mangalwar peth, Pune - 411 011 Proposed to be Used M UMBAI Providing food & Drink, Temporary accommodation 4549","tm_class":"43","tm_phonetics":"0 BK KSHL HS"},{"page_no":"445,journal no. 2048","trademark":"PINGPANGPONG","details":"5199125    03/11/2021 SHRI. RAPAKA SATYA SIVA KRISHNA B hanu Enclave, Plot 22, Phase 1, Yapral, Secunderabad - 500087, Telangana, India Single firm Address for service in India/Agents address: S.BALAJANAKI S UITE NO 27 C & D, 3RD FLOOR, PANDU KLIX PLAZA, 168 THAMBU CHETTY STREET, CHENNAI-600 001. Used Since :21/09/2021 CHENNAI Hotels, Restaurants, Catering Services, Providing Te mporary Accommodation, Providing Food And Drink In Restaurants,  Coffee Shops, Bar And Restaurant Services. 4553","tm_class":"43","tm_phonetics":"PNKPNKPNK"},{"page_no":"449,journal no. 2048","trademark":"FOREIGNER","details":"5202315    08/11/2021 BIJENDER V ILLAGE - KHALILPUR, TEHSIL - PATAUDI, KHALILPUR (272), GURGAON, HARYANA - 122502 INDIVIDUAL-SOLE PROPRIETOR Address for service in India/Attorney address: HARISH KUMAR ADV., 3 685/17 BEHIND KRISHAN KRIPA MANDIR, UTTAM NAGAR, HANSI, DISTRICT - HISAR, HARYANA (INDIA) - 125033 Proposed to be Used D ELHI SERVICES FOR PROVIDING FOOD AND DRINK, TEMPORARY ACC OMMODATION. 4557","tm_class":"43","tm_phonetics":"FRKNR"},{"page_no":"451,journal no. 2048","trademark":"50° SHAWARMA","details":"5202505    09/11/2021 M/S- HOTEL PRADEEP C -27/153, Jagatganj, Varanasi (U.P.), India. Partners Address for service in India/Attorney address: KRISHNA TRADE MARK BUREAU S A-17/130 M-M-3 (M.I.G.-3) ASHOK VIHAR COLONY PHASE-II PAHARIA VARANASI U.P Proposed to be Used D ELHI SERVICES FOR PROVIDING FOODS & DRINKS, BAR SERVICES,  CAFETERIAS, CANTEENS, CATERING, MOTELS,  HOTELS, RESTAURANTS, SNACK-BARS, TEMPORARY ACCOMMODATION 4559","tm_class":"43","tm_phonetics":"50° KSHWRM"},{"page_no":"452,journal no. 2048","trademark":"MOMO BLUES","details":"5202506    09/11/2021 M/S- HOTEL PRADEEP C -27/153, Jagatganj, Varanasi (U.P.), India. Partners Address for service in India/Attorney address: KRISHNA TRADE MARK BUREAU S A-17/130 M-M-3 (M.I.G.-3) ASHOK VIHAR COLONY PHASE-II PAHARIA VARANASI U.P Proposed to be Used D ELHI SERVICES FOR PROVIDING FOODS & DRINKS, BAR SERVICES,  CAFETERIAS, CANTEENS, CATERING, MOTELS,  HOTELS, RESTAURANTS, SNACK-BARS, TEMPORARY ACCOMMODATION 4560","tm_class":"43","tm_phonetics":"MM BLS"},{"page_no":"456,journal no. 2048","trademark":"CORBETT ELWOOD RESORT","details":"5204574    10/11/2021 JINDAL LAMPS PVT. LTD. 2 52A, VILLAGE DHIKULI TEHSIL RAMNAGAR DISTT- NAINITAL (UTTARAKHAND)- 244715. BODY INCORPORATE Address for service in India/Attorney address: TAJ TRADE MARK A NAND VRINDAVAN, SANJAY PLACE, AGRA - 282 002 (U.P.) INDIA. Used Since :28/09/1995 DELHI Providing food and drinks, temporary accommodation a nd their allied hospitality services. 4564","tm_class":"43","tm_phonetics":"KRBT LWT RSRT"},{"page_no":"469,journal no. 2048","trademark":"SHIVCHAT","details":"5331265    16/02/2022 MR. BITTU KUMAR PROPRIETOR OF M/S SHIV CHAT B lock-19-710/3, Dandi Swami Road, Opposite Old DMC, Ludhiana-141001 (Punjab) Proprietorship Firm Address for service in India/Agents address: BASSI & ASSOCIATES 4 , FIRST FLOOR, SYNDICATE COMPLEX, BINDRABAN ROAD, CIVIL LINES, LUDHIANA-1 Used Since :24/03/1995 DELHI Restaurants, Self Service Restaurants, Fast Food Res taurant Services, Services for Providing Food and Drink, Cafeterias,  Canteens, Coffee Shops, Ice cream Parlours, Snack Bars, Catering Services, Providing Banquet and Social function  facilities for special occasions, Rental of Rooms as Temporary Living Accommodations 4577","tm_class":"43","tm_phonetics":"SHFKSHT"},{"page_no":"471,journal no. 2048","trademark":"THE LOUNGING APES","details":"5331777    16/02/2022 MANDEEP SINGH BHATIA 1 68, PIPLIYA RAO, NEAR BHAWARKUAN,INDORE,MADHYA PRADESH INDIVIDUAL Address for service in India/Attorney address: NAVKAR ASSOCIATES 3 17, 3rd FLOOR, SHEKHAR CENTRAL BUILDING, AB ROAD, PALASIA SQUARE INDORE- 452 001 (M.P.) INDIA Proposed to be Used M UMBAI Services for providing food and drink; Temporary acc ommodation 4579","tm_class":"43","tm_phonetics":"0 LNJNK PS"},{"page_no":"474,journal no. 2048","trademark":"MR. KRISPER","details":"5335469    18/02/2022 SAHIL KUMAR PROP. OF MR. KRISPER B -6, 273 B, MODEL TOWN, YAMUNANAGAR (HARYANA), PIN-135001 Proprietorship Firm Address for service in India/Attorney address: HITESH LALIT C hamber No 17, Block A, Ground Floor, New Lawyer Complex, Distt and Session Court, Jagadhri, Yamunanagar-135003 (Haryana) Used Since :01/05/2019 To be associated with: 4772442 DELHI SERVICES FOR PROVIDED FOOD AND DRINKS; TEMPORARY ACC OMMODATION. 4582","tm_class":"43","tm_phonetics":"MR. KRSPR"},{"page_no":"483,journal no. 2048","trademark":"BEND","details":"5338515    21/02/2022 O. K. ENTERTAINMENT AND HOSPITALITY PRIVATE LIMITED B -2-902, 9TH FLOOR, PACIFIC GOLF ESTATE, SHARASTRADHARA ROAD, DEHRADUN, UTTARAKHAND, PIN– 248001 IN A LIMITED COMPANY INCORPORATED IN INDIA UNDER THE COMPANIES ACT 2013 Address for service in India/Attorney address: TSIP WORLDWIDE 6 76, Near: Harmilap Mandir, Janakpuri, Bareilly, Uttar Pradesh, PIN – 243122 Proposed to be Used D ELHI HOTELS, RESTAURANTS, SERVICES FOR PROVIDING FOOD AND  DRINKS, CAFES, CAFETERIAS, SNACK-BARS, FOOD  AND DRINK CATERING SERVICES. 4591","tm_class":"43","tm_phonetics":"BNT"},{"page_no":"484,journal no. 2048","trademark":"CONNOISSEUR","details":"5338595    21/02/2022 YAMINI KHEMKA R /O A-245, New Friends Colony, New Delhi-110065, INDIA Individual Address for service in India/Attorney address: KALYAN SONI 5 82, Vikas Vihar Colony, Tonk Used Since :01/04/2003 To be associated with: 2319067 DELHI SERVICES, SERVICES FOR PROVIDING FOODS AND DRINKS AN D PASTRIES CATERING SERVICES AS INCLUDED IN  CLASS 43 4592","tm_class":"43","tm_phonetics":"KNSR"},{"page_no":"486,journal no. 2048","trademark":"KIIK 69 SPORTS BAR","details":"5339232    22/02/2022 BASSIK HOSPITALITY SERVICES PRIVATE LIMITED S Y 58 TO 60, MAPHAR MK ETERNAL, 2ND FLOOR GUTTALA BEGUMPET, MADHAPUR, RANGA REDDY HYDERABAD  RANGAREDDI TG 500033 IN PRIVATE LIMITED COMPANY Address for service in India/Agents address: C. PRAKASH 1 A, Post Office Road, 1st floor, Krishnaswamy Nagar, Ramanathapuram, Coimbatore-641045. Proposed to be Used C HENNAI Providing of food and drinks in restaurants and bars , Snack-bar services, Bar and bistro services, Provision of temporary  accommodation, Providing temporary accommodation during music festival events, Cafe services. 4594","tm_class":"43","tm_phonetics":"KK 69 SPRTS BR"},{"page_no":"492,journal no. 2048","trademark":"BURRRITO","details":"5341298    23/02/2022 MASSIVE RESTAURANTS PRIVATE LIMITED P lot No 825, Udyog Vihar, Phase-5, Gurgaon, Haryana-122016 An Indian Company incorpoated under the Companies Act, 1956. Address for service in India/Agents address: ANAND AND ANAND. B -41,NIZAMUDDIN EAST, NEW DELHI - 110 013. Proposed to be Used D ELHI Restaurant and restaurant services; bar and bar serv ices; dining and take-out restaurant services; Self-service restaurant;  Fast-food restaurant services; catering services and services for providing food and drink; temporary accommodation. 4600","tm_class":"43","tm_phonetics":"BRRT"},{"page_no":"495,journal no. 2048","trademark":"WARDWIZARD","details":"5343072    24/02/2022 YATIN GUPTE 1 2/a, SURAMYA BUNGALOWS, RAIPURA ROAD, BHAYALI GAON, BEHIND LALGURU FARM, BHAYLI, VADODARA –  391410, (GUJARAT) INDIVIDUAL Address for service in India/Attorney address: YASH SURYAWALA N /7, 1st floor, Dhavalgiri Aprtment, B/h Dr. Swadiya\"s Hospital, Nr. Kuber Bhuvan, Kothi, Vadodara, Gujarat. Proposed to be Used A HMEDABAD Accommodation bureau services [hotels, boarding hous es], bar services, boarding for animals, boarding house bookings,  boarding house services, café services, cafeteria services, cake decorating, canteen services, day-nursery [crèche]  services, decorating of food, food and drink catering, food sculpting, holiday camp services [lodging], hookah lounge  services, hotel reservations, hotel services, information and advice in relation to the preparation of meals, motel services,  personal chef services, providing campground facilities, reception services for temporary accommodation [management  of arrivals and departures], rental of chairs, tables, table linen, glassware, rental of cooking apparatus, rental of drinking  water dispensers, rental of lighting apparatus*, rental of meeting rooms, rental of temporary accommodation, rental of  tents, rental of transportable buildings*, restaurant services, retirement home services, self-service restaurant services,  snack-bar services, temporary accommodation reservations, tourist home services, udon and soba restaurant services,  washoku restaurant services. 4603","tm_class":"43","tm_phonetics":"WRTWSRT"},{"page_no":"496,journal no. 2048","trademark":"STUFFIT","details":"5343320    24/02/2022 NALLA SHEKAR H .No 16 9 207/A/1 Kalyan Nagar, Kalyan Nagar, Godavarikhani, Karim Nagar, Telangana, India, 505209 Proprietor Address for service in India/Attorney address: SNEHA MANJOORAN F -97, 4th Floor, Anna Nagar (East), Chennai - 600102, Tamil Nadu.  Proposed to be Used C HENNAI Services for providing food and drink; temporary acc ommodation. 4604","tm_class":"43","tm_phonetics":"STFT"},{"page_no":"497,journal no. 2048","trademark":"HERFYS","details":"5344073    25/02/2022 MR. NAZEEB P S P ATTARUVELI, CHANDIROOR, EZHUPUNNA, CHERTHALA -688 537, ALAPPUZHA INDIVIDUAL Address for service in India/Attorney address: PRG ASSOCIATES 4 TH FLOOR,D.D VYAPAR BHAVAN KADAVANTHRA - 682020, ERNAKULAM, KERALA Proposed to be Used C HENNAI RESTAURANTS, SELF SERVICE RESTAURANTS, HOTELS, CATER ING SERVICES, OUT DOOR CATERING, FAST FOOD,  PROVIDING OF FOOD AND DRINK, TEMPORARY ACCOMADATION 4605","tm_class":"43","tm_phonetics":"HRFS"},{"page_no":"500,journal no. 2048","trademark":"MCITY HOT DOGS","details":"5344715    25/02/2022 ADITYAA MANOHAR MONDKAR 2 C/1301, Rustomjee Regency, J.S. Road, Near Rustomjee School, Mumbai, Maharashtra, India Owner & Applicant Address for service in India/Agents address: SWATI RAMKRISHNA NERURKAR A /803, TRISHLA TOWER, RAM MANDIR ROAD, VAZIRA NAKA, BORIVALI (WEST), MUMBAI-400092. Proposed to be Used M UMBAI Restaurants, Take-away food outlets, catering servic es, serving food & drink,, chain of restaurants, Home delivery of food,  self-serviced restaurants as included in class 43 4608","tm_class":"43","tm_phonetics":"MST HT TKS"},{"page_no":"501,journal no. 2048","trademark":"INDIA FALCONS RACING LIMITED","details":"5344824    25/02/2022 ROADWAY SOLUTIONS (I) PRIVATE LIMITED P LOT NO. 20, DHANJIBUOY SOCIETY, OFF. NIBM ROAD, BEHIND BIZZBAY MALL, KONDHWA (KD), PUNE 411048  MAHARASHTRA. A COMPANY INCORPORATED UNDER THE INDIAN COMPANIES ACT Address for service in India/Agents address: R.K. DEWAN & CO. P ODAR CHAMBERS, S.A. BRELVI ROAD, FORT, MUMBAI - 400 001. Proposed to be Used M UMBAI SERVICES FOR PROVIDING FOOD AND DRINK; HOTEL, MOTEL  AND RESTAURANT SERVICES; SELF- SERVICE  RESTAURANTS, SNACK BARS, CANTEEN SERVICES, CAFE AND CAFETERIA SERVICES; ICE-CREAM PARLOURS; BAR  SERVICES; CATERING SERVICES; PROVIDING TEMPORARY ACCOMMODATION AND MEETING ROOMS; LODGING  SERVICES; RENTAL OF TENTS AND TRANSPORTABLE BUILDINGS; RENTAL OF CHAIRS, TABLE, TABLE LINEN,  GLASSWARE; PROVIDING CAMPGROUND FACILITIES. 4609","tm_class":"43","tm_phonetics":"INX FLKNS RSNK LMTT"},{"page_no":"502,journal no. 2048","trademark":"CHAI DATING ZONE","details":"5345345    25/02/2022 CHAI DATING ZONE PRIVATE LIMITED N O.48/49, MUNNEKOLAL BANGALORE BANGALORE KA 560037 IN THE TRADE MARKS ACT- 1999 Address for service in India/Attorney address: NEWTON REGINALD N o 6, Dhanammal Street Spurtank Road Chetpet Chennai - 600031 Proposed to be Used C HENNAI Providing food and beverages; Food and beverage prep aration services; Serving of food and beverages; Preparation of  food and beverages; Provision of food and beverages; Serving food and beverages in milk bars; Serving food and drinks;  Serving food and beverages in dairy bars; Services for the preparation of food and beverages; Catering for the provision of  food and beverages; Food reviewing services [provision of information about food and drinks]; Catering of food and  drinks; Serving of food and drinks; Coffee and tea bars; Coffee and tea bar services; Serving of tea, coffee, cocoa,  carbonated drinks or fruit juice beverages; 4610","tm_class":"43","tm_phonetics":"SH TTNK SN"},{"page_no":"505,journal no. 2048","trademark":"UDO VADDO","details":"5346088    26/02/2022 CARINOSO INDIA PRIVATE LIMITED R isara House, Vasudev Dempo Marg, Tonca, Caranzalem, North Goa, Goa - 403002 Private Limited Company Address for service in India/Attorney address: VENKATESH AMEYA NAYAK SALATRY # 401 Citi Center, Patto Plaza, Panaji, Goa Proposed to be Used M UMBAI Services for providing food and drink; temporary acc ommodation. 4613","tm_class":"43","tm_phonetics":"UT FT"},{"page_no":"506,journal no. 2048","trademark":"BOOZA","details":"5347001    26/02/2022 SHOIAB MUSHTAQ PROPRIETOR OF BOOZA EATS A NANTNAG, ANANTNAG, ANANTNAG, JAMMU & KASHMIR-192101 THE TRADE MARK ACT-1999 Address for service in India/Attorney address: NEWTON REGINALD N o 6, Dhanammal Street Spurtank Road Chetpet Chennai - 600031 Used Since :25/09/2021 DELHI Food preparation services; Takeaway food services; P roviding food and drink; Serving food and drinks; Providing food  and beverages; Food preparation; Services for providing food; Serving food and drink for guests in restaurants; Providing  food and drink for guests in restaurants; Provision of food and drink, and temporary accommodation; Provision of food  and drink in restaurants; 4614","tm_class":"43","tm_phonetics":"BS"},{"page_no":"507,journal no. 2048","trademark":"JUNGLOPEDIA","details":"5347224    26/02/2022 KAUSHLENDRA PAL P LOT NO. 94/95 TRIPUTI VIHAR JAIPUR INDIVIDUAL Address for service in India/Attorney address: PRIYANKA TODWAL 6 /47, Vidhaydhar Nagar Jaipur Proposed to be Used A HMEDABAD Services provided by persons or establishments whose  aim is to prepare food and drink for consumption and services  provided to obtain bed and board in hotels, boarding houses or other establishments providing temporary  accommodation. Reservation services for travellers’ accommodation, particularly through travel agencies or brokers AND  Boarding for animals. 4615","tm_class":"43","tm_phonetics":"JNKLPX"},{"page_no":"508,journal no. 2048","trademark":"CRUZOES","details":"5349799    01/03/2022 SIDDHARTH MARWAH C -61, SECTOR-50, NOIDA 201301 Individual Address for service in India/Attorney address: MR. RACHIT KOHLI ADV., B LOCK C-2, H.NO. 1000 A, G.F. PALAM VIHAR, GURGAON, HARYANA 122001 Proposed to be Used D ELHI SERVICES FOR PROVIDING FOOD AND DRINKS INCLUDING RES TAURANTS, SELF-SERVICE RESTAURANTS, FAST  FOOD RESTAURANTS, TAKE-AWAY RESTAURANTS, DELIVERY RESTAURANTS, CAFETERIA, CATERING, LOUNGE,  CANTEEN SERVICES AND FOOD PREPARATION SERVICES, AS INCLUDED IN CLASS 43. 4616","tm_class":"43","tm_phonetics":"KRSS"},{"page_no":"512,journal no. 2048","trademark":"KHICHDI TALES","details":"5351860    02/03/2022 NOVO LABS TECHNOLOGY PRIVATE LIMITED 1 0, 5th A Block Koramangala BANGALORE Bangalore KA 560095 IN Private Limited Company Address for service in India/Attorney address: LS SHAH & ASSOCIATES v ile parle west Used Since :12/09/2021 CHENNAI Food and beverages preparation, food sculpting, cont ract food and beverages services, fast food restaurants, takeaway  food and beverages services. 4620","tm_class":"43","tm_phonetics":"KHKSHT TLS"},{"page_no":"517,journal no. 2048","trademark":"SHANGRI-LA","details":"3929609    29/08/2018 SHANGRI-LA INTERNATIONAL HOTEL MANAGEMENT LIMITED Trident Chambers, P.O. Box 146, Road Town, Tortola, British Virgin Islands A company organised and existing under the laws of British Virgin Islands. . Address for service in India/Agents address: ANAND AND ANAND. B-41,NIZAMUDDIN EAST, NEW DELHI - 110 013. Proposed to be Used DELHI Resort and spa services; florist and flower arranging services; provision of sauna, solarium and sun deck facilities; beauty  salon services, skin care beauty treatment services, hairdressing services, massage services, physical fitness services,  weight losing and/or gaining and/or controlling services; pedicure and manicure services, provision of information and  advisory relating to the use of skin, beauty treatment and cosmetic products, health care services; providing information  relating to beauty and hair salon services on-line from a computer database or via the Internet or extranets; providing  information relating to medical services on-line from a computer database or via the Internet or extranets; provision of  information, management, consultancy and advisory services for the aforesaid services. 4625","tm_class":"44","tm_phonetics":"SHNKR-L"},{"page_no":"519,journal no. 2048","trademark":"DENTAL STYLIST","details":"3954532    25/09/2018 DR. HEMAN VERMA 8, DAKSHIN MARG, DLF CITY, PHASE-II, GURGAON -122002 Proprietor of DENTAL STYLIST and rightful owner of Trade Mark DENTAL STYLIST Address for service in India/Attorney address: SANJAY KUMAR JHA 308-309, VARDHAMAN FORTUNE MALL, OPP. GUJRAWALA TOWN, G.T KARNAL ROAD, AZADPUR, NEW DELHI-110033 Used Since :01/09/2018 DELHI work of Medical care, Dental Care Hygienic and Beauty Care given by persons or establishments to human beings medical  analysis services relating to the treatment of persons (such as x-ray examinations and taking of blood samples) artificial  insemination services 4627","tm_class":"44","tm_phonetics":"TNTL STLST"},{"page_no":"520,journal no. 2048","trademark":"HEALTHLLAVE","details":"4140076    07/04/2019 HEALTHLLAVE GLOBAL SERVICES LLP G/F, E4/85, GALI NO. 5 SONIA VIHAR DELHI East Delhi DL 110094 INDIA Health Care & Health Service LLP Address for service in India/Attorney address: RAJASTHAN REGISTRATION CENTER 14-B, GOVIND MARG, ADARSH NAGAR, JAIPUR-302004 RAJASTHAN Proposed to be Used DELHI Class 44 is for Medical services, veterinary services, hygienic and beauty care for human beings or animals; agriculture,  horticulture and forestry services. Here the TM is for Health Services, Health Care Services. 4628","tm_class":"44","tm_phonetics":"HL0LF"},{"page_no":"521,journal no. 2048","trademark":"VIKALP REHAB. SERVICES","details":"4162413    30/04/2019 ABHINAV TYAGI P.T A-95, Sector-33, Noida – 201301, Uttar Pradesh Proprietor Address for service in India/Attorney address: POOJASHREE F-97, 4th Floor, Anna Nagar (East), Chennai - 600102, Tamil Nadu Proposed to be Used DELHI MEDICAL SERVICES; VETERINARY SERVICES; HYGIENIC AND BEAUTY CARE FOR HUMAN BEINGS OR ANIMALS;  AGRICULTURE, HORTICULTURE AND FORESTRY SERVICES.PHYSIOTHERAPY 4629","tm_class":"44","tm_phonetics":"FKLP RHB. SRFSS"},{"page_no":"522,journal no. 2048","trademark":"HEALTHPLEX","details":"4192379    30/05/2019 DR. DEBABRATA DAS Vivekananda Pally, Near Sonarpur Town Club, P.O & P.S: Sonarpur, Kolkata-700150, West Bengal, INDIA An Indian Citizen Address for service in India/Agents address: S.S. DATTA & ASSOCIATES S.S. DATTA & ASSOCIATES, 288/1,B.B. CHATTERJEE ROAD,GROUND FLOOR,KOLKATA 700 042,WEST BENGAL,INDIA. Proposed to be Used KOLKATA Medical Clinic services; Medical Diagnostic services; Hospital Services; Nursing Home Services; Pharmaceutical  consulting; Pharmacy dispensary services; Home Health Care services. THIS IS SUBJECT TO ASSOCIATION WITH REGISTERED/PENDING REGISTRATION NO.4192380. 4630","tm_class":"44","tm_phonetics":"HL0PLKS"},{"page_no":"524,journal no. 2048","trademark":"NAIL TALK","details":"4208136    14/06/2019 YAHVI DUGGAL 40/66, FIRST FLOOR, CHITTRANJAN PARK, NEW DELHI-110019 Individual Address for service in India/Agents address: NAVNEET KAUR E-178, LGF, Greater Kailash, Part-I, New Delhi-110048. Proposed to be Used DELHI PROVIDING ALL SERVICES RELATED AND INCIDENTAL TO NAIL SALONS, NAIL ART, NAIL GEL, NAIL CARE. 4632","tm_class":"44","tm_phonetics":"NL TLK"},{"page_no":"525,journal no. 2048","trademark":"THE LIFESTYLE CLINIC (TLC)","details":"4254293    02/08/2019 JATEEN UKRANI C-549, GF, SFS FLATS SHEIKH SARAI PHASE-1, DELHI-110017 SOLE PROPRIETOR Address for service in India/Attorney address: SATENDRA KUMAR, ADVOCATE 12,FF,TDI CENTER JASOLA NEW DELHI-25 Proposed to be Used DELHI CLINICAL, MEDICAL AND HOSPITAL SERVICES PSYCHIATRY, PSYCHOLOGY, MENTAL HEALTH, REHABILITATION,  NEUROLOGY, NEUROSURGERY, ORTHOPEDICS, DERMATOLOGY, SUPERSPECIALITY MEDICAL AND HELATH CARE  SERVICES 4633","tm_class":"44","tm_phonetics":"0 LFSTL KLNK (TLK)"},{"page_no":"526,journal no. 2048","trademark":"AFRO UNISEX SALON","details":"4274322    24/08/2019 RACHHPAL SINGH TRADING AS AFRO UNISEX SALON MAAAN COMPLEX, OPP. M.C. PARK, SIRHIND MANDI, DISTT. FATEHGARH SAHIB (PB.) PROPRIETORSHIP Address for service in India/Attorney address: MAHTTA & CO 43-B/3, UDHAM SINGH NAGAR, LUDHIANA. 141001 (PUNJAB) Used Since :01/05/2011 DELHI Beauty Care & Body Care Treatment Services, Health & Beauty Care Services provided by Saunas, Beauty Salons,  Sanatoriums, Hairdressing Salons; Hair Coloring Services & Massage Parlours, Beauty Therapy & Beauty Consultancy  Services; Make-up Services, & Spa Services. 4634","tm_class":"44","tm_phonetics":"AFR NSKS SLN"},{"page_no":"529,journal no. 2048","trademark":"CENTER","details":"4638570    03/09/2020 AHMAD ALI S/O. LATE ABDUS SALAM HOLDING # 185/631, JAMAL PURA LALBAGH, DARBHANGA, BIHAR-846004 An Individual and Citizen of India Address for service in India/Attorney address: DTM ADVISORS LLP C-80, Village Gokal Pur, East of Loni Road (Near Govt. School) Shahdara, Delhi-110094 Mob: 09650410410, 09212743839 Ph: 011- 22816711, 22815016 Proposed to be Used KOLKATA HOSPITAL & MEDICAL CLINIC, MEDICAL SERVICES; SURGICAL, CLINICAL, NURSING, PHARMACY AND THERAPY  SERVICES; REHABILITATION AND PREVENTIVE HEALTH CARE; MEDICAL AND CLINICAL LABORATORY ACTIVITIES,  CLINICAL RESEARCH SERVICES AND DIAGNOSTICS SERVICES IN CLASS 44 REGISTRATION OF THIS TRADE MARK SHALL GIVE NO RIGHT TO THE EXCLUSIVE USE OF THE WORD DVANCED AND  ALL OTHER DESCRIPTIVE MATTERS. THIS IS SUBJECT TO AMENDING THE GOODS/SERVICES FOR SALE/CONDUCTING  IN THE STATES OF BIHAR. THIS IS SUBJECT TO ASSOCIATION WITH REGISTERED/PENDING REGISTRATION NO.4664766. 4637","tm_class":"44","tm_phonetics":"SNTR"},{"page_no":"531,journal no. 2048","trademark":"IYASYA","details":"4676862    28/09/2020 HELAROS VENTURES LLP B 804, B WING, HILL CREST, SARIPUT NAGAR, J V LINK ROAD, ANDHERI EAST MUMBAI - 400093 MSME Enterprise Address for service in India/Agents address: ASHWINI HARSHIT SHAH Office No.27, 2nd floor, Sindhi Colony No.1, Above Ketan Computers, Ram Nagar Road, Borivali(West), Mumbai-400092. Proposed to be Used MUMBAI Beauty and Salon Services, Spa Centers, Massages Centers, Sauna & Steam bath, Healthcare and Fitness Center. 4639","tm_class":"44","tm_phonetics":"IYSY"},{"page_no":"547,journal no. 2048","trademark":"SHORTBOOK","details":"4885391    01/03/2021 SAVEO HEALTHTECH PRIVATE LIMITED No. 18 & 19, 3rd Floor, Krishna Reddy Layout, Domlur, Bangalore, Karnataka – 560071, India Service Provider Address for service in India/Attorney address: SPICE ROUTE LEGAL No. 775, 3rd Floor, 100 ft Road Indiranagar 2nd Stage, Bangalore - 560038 Proposed to be Used CHENNAI Medical assistance; medical clinic services; medical analysis services for diagnostic and treatment purposes provided by  medical laboratories; medical screening; dietary and nutritional advice; pharmacy advice and preparation of prescriptions  by pharmacists; hospital services; telemedicine services; hygienic and beauty care for human beings or animals;  veterinary services. 4655","tm_class":"44","tm_phonetics":"SHRTBK"},{"page_no":"551,journal no. 2048","trademark":"ABUNDANCE","details":"4895136    09/03/2021 ABHAYA KUMAR SRISRIMAL 27, Mylai Ranganathan Street, T Nagar, Chennai -600017 Individual, Indian National Address for service in India/Attorney address: DEEPAK VAID TIS Legal 44/30, Dewan Rama Road, 2nd Floor, Purasaiwalkam, Chennai - 600084 Proposed to be Used CHENNAI agriculture, horticulture services, services relating to gardening, including plant nursery services, landscape design,  landscape gardening 4659","tm_class":"44","tm_phonetics":"ABNTNS"},{"page_no":"558,journal no. 2048","trademark":"NEELAMZ YOUNG MASTER","details":"5144865    23/09/2021 NEELAM OBEROI M/s NEELAMZ YOUNG MASTER 1/6B IDGAH PRAKASH NAGAR DEHRADUN-248001 UTTARAKHAND INDIA PROPRIETOR Address for service in India/Attorney address: VARUNVATSA 7/A Khurbura Dehradun-248001 Uttarakhand Used Since :01/04/2016 DELHI MEDICAL SERVICES, VETERINARY SERVICES, HYGIENIC AND BEAUTY CARE FOR HUMAN BEINGS OR ANIMALS,  AGRICULTURE, HORTICULTURE AND FORESTRY SERVICES, HAIR AND BEAUTY SALON, HAIR CUT, HAIR TREATMENT ,  SKIN CARE , HAIR SPA, COLOR SCALP TREATMENT Mark should be read as a whole. 4666","tm_class":"44","tm_phonetics":"NLMS YNK MSTR"},{"page_no":"559,journal no. 2048","trademark":"GOAPPTIV","details":"5178022    18/10/2021 GOAPPTIV PRIVATE LIMITED SB-16, HIGH STREET CORPORATE CENTER, KAPURBAWDI THANE WEST Mumbai City MH 400607 . Private Limited Company Used Since :27/03/2015 MUMBAI Health Care, Medical Assistance, Telemedicine Services 4667","tm_class":"44","tm_phonetics":"KPTF"},{"page_no":"570,journal no. 2048","trademark":"“DO-IT-TOGETHER” (DIT)","details":"5204500    10/11/2021 AIRBLACK TECHNOLOGIES PRIVATE LIMITED Unit Nos 3-012 & 3-014, 3rd Floor Emaar Palm Springs Plaza, Golf Course Road, Gurgaon, Haryana 122011 Private Limited Company Address for service in India/Attorney address: IRA LAW I-34, 4th Floor, Jangpura Extension, New Delhi - 110014 Used Since :28/06/2020 DELHI Information relating to beauty; Beauty consultants; Make-up consultation and application services; Make-up consultation  and application services; Advice relating to cosmetics; Cosmetics consultancy; Colour analysis [beauticians' services];  Hair care services; Hair styling; Beautician services; Nail care services; Beauty care; medical services; hygienic and  beauty care for human beings or animals; agriculture, horticulture and forestry services 4678","tm_class":"44","tm_phonetics":"“T-T-TJ0R” (TT)"},{"page_no":"574,journal no. 2048","trademark":"DR.P. ALIKUTTY'S KAP","details":"5212734    17/11/2021 ANVAR SADATH PACKADA Anvar Sadath Packada, Aged 48 Years, C/o Alikutty Packada, Khyru Nivas, Near A V College, Edarikode P.O, Kottakkal Panchayath,  Malappuram- 676 501 proprietor Address for service in India/Agents address: V.P. BIMALDAS,ADVOCATE ROOM NO.2, HOTEL WHITE LINES, KALLAI ROAD, CALICUT Proposed to be Used CHENNAI HOSPITALS, MEDICAL CLINICS, NURSING HOME, PHARMACY, PHIYSIOTHERAPY, DENTAL 4682","tm_class":"44","tm_phonetics":"TR.P. LKT'S KP"},{"page_no":"575,journal no. 2048","trademark":"MEDEVIVA","details":"5319095    08/02/2022 AXIEVA TECHNOLOGY PRIVATE LIMITED HOUSE NO-84B SHIVPURI NEAR GYANDEEP PUBLIC SCHOOL, KRISHNA NAGAR, East Delhi, DELHI 110051 BODY CORPORATE Proposed to be Used DELHI Medical services; Veterinary services, Hygienic care for human beings, Hygienic care for animals, Pharmacy  services,Pharmacy Advisory services, Pharmacy dispensary services, Human Hygiene and Beauty Care, Animal  Healthcare Services, Human Healthcare Services. 4683","tm_class":"44","tm_phonetics":"MTFF"},{"page_no":"579,journal no. 2048","trademark":"PATHQUEST","details":"5332760    17/02/2022 NKV PATH LABS PRIVATE LIMITED 1514P, Sec- 46, Gurugram, Haryana-122003 Company Address for service in India/Attorney address: ADASTRA IP PVT LTD 2054 SEC 8 FARIDABAD, HR, IND FARIDABAD Faridabad HR 121006 IN Proposed to be Used DELHI Medical testing services relating to the diagnosis and treatment of disease, Medical testing services, Medical laboratory  services for the analysis of samples taken from patient, Medical laboratory services for the analysis of blood samples  taken from patients 4687","tm_class":"44","tm_phonetics":"P0KST"},{"page_no":"580,journal no. 2048","trademark":"SUPER DERM","details":"5334620    18/02/2022 DR. PRATEEK NAGRANI F-19/51, Sector-8, Rohini, New Delhi - 110085 Individual Address for service in India/Attorney address: R.K.DEWAN & CO. R.K. DEWAN & CO. 1271 & 1272, 12th Floor, Aggarwal Cyber Plaza - II, Netaji Subhash Place, Pitampura, New Delhi - 110 034,  INDIA Proposed to be Used To be associated with: 5333480 DELHI Medical, Surgical and Cosmetic services related to Skin, Hair and Nails. 4688","tm_class":"44","tm_phonetics":"SPR TRM"},{"page_no":"581,journal no. 2048","trademark":"DERMALINKS","details":"5334621    18/02/2022 DR. PRATEEK NAGRANI F-19/51, Sector-8, Rohini, New Delhi - 110085 Individual Address for service in India/Attorney address: R.K.DEWAN & CO. R.K. DEWAN & CO. 1271 & 1272, 12th Floor, Aggarwal Cyber Plaza - II, Netaji Subhash Place, Pitampura, New Delhi - 110 034,  INDIA Proposed to be Used DELHI Medical, Surgical and Cosmetic services related to Skin, Hair and Nails. 4689","tm_class":"44","tm_phonetics":"TRMLNKS"},{"page_no":"585,journal no. 2048","trademark":"RIZO","details":"5337248    21/02/2022 FARMSOW PRIVATE LIMITED 5, BALAJI APARTMENT, NEAR MARINE DRIVE APT, STERLING PARK, MEMNAGAR, AHMEDABAD, GUJARAT, INDIA,  PIN-380052 Active Private Limited Company Address for service in India/Agents address: ANUGU VIJAYA BHASKAR REDDY Flat No.101, H.No. 12-44, Sri Lakshmi Nilayam, Lane No.1, Road No.1, P & T Colony, Boduppal, Hyderabad-, Telangana-500092. Proposed to be Used AHMEDABAD Agriculture, horticulture and forestry services; Afforestation services, Services for conservation of forests; Reforestation  services 4693","tm_class":"44","tm_phonetics":"RS"},{"page_no":"586,journal no. 2048","trademark":"NAMMA HOMEOPATHY","details":"5338607    21/02/2022 DR. MORE RAGHU PRASAD # 109, 4th Floor Cocount Avenue Road Kodandarampuram, Malleshwaram Kethan Residency, in front of Government School Bangalore  North Malleswaram Bengaluru Karnataka – 560003, India Individual Address for service in India/Attorney address: ADITI VERMA Ediplis Counsels, G1, Building No. 1542/A, 28th Cross, 28th Main, Banashankari 2nd Stage, Bangalore 560070, Karnataka Used Since :06/06/2019 To be associated with: 4315001 CHENNAI Homeopathy consultancy and treatment services; Hygienic and beauty care for human beings 4694","tm_class":"44","tm_phonetics":"NM HMP0"},{"page_no":"589,journal no. 2048","trademark":"TOPPILL","details":"5339306    22/02/2022 IMRAN HUSAIN S/o, Zaheer Husain, Fatehpur Khas Via Sirsi, Lalpur, Gangwari, Moradabad, Dingarpur, Uttar Pradesh, 244301 Individual Address for service in India/Agents address: MANSI AGARWAL C-64, Gandhi Nagar, Moradabad,Uttar Pradesh-244001 Proposed to be Used DELHI MEDICAL SERVICES, HEALTH COUNSELLING, HOSPITAL SERVICES, MEDICAL CLINIC SERVICES. 4697","tm_class":"44","tm_phonetics":"TPL"},{"page_no":"590,journal no. 2048","trademark":"AVOYA","details":"5341149    23/02/2022 SHEETAL VAIBHAV RAJMANE Office Unit 111, Golden Chembers, Veera Desai Industrial Road, Andheri West - 400053, Maharashtra Individual Address for service in India/Attorney address: NADAR VENNILA C-102, Calypso, Bloomfield, Amit Enterprises Housing,Nr. Gold Gym, NH-4, Mumbai-Bangalore Highway,Sinhagad Road, Ambegaon  (BK), Pune-411 046  Proposed to be Used MUMBAI Hospital services, Healthcare services 4698","tm_class":"44","tm_phonetics":"AFY"},{"page_no":"595,journal no. 2048","trademark":"ASMAKAM","details":"5343000    24/02/2022 RADHIKA K VARMA 9 shreyas, 6th cross abhaya reddy layout, kaggadasapura, C v Raman Nagar, Bangalore INDIVIDUAL Address for service in India/Attorney address: ABHISHEK MISHRA House No 405 Block 3-4 In Front of SP City Hospital Jagdishpur Ballia UP 277001 Proposed to be Used CHENNAI Medical services, veterinary services, hygienic and beauty care for human beings or animals; agriculture, horticulture and  forestry services. 4703","tm_class":"44","tm_phonetics":"ASMKM"},{"page_no":"596,journal no. 2048","trademark":"MINDDOC","details":"5343589    24/02/2022 DR. PRASHANT GOHIL C/402, DWARKESH HEAVENS - 1, NEAR PANCHSHLOK CROSS ROAD, NEW CHANDKHEDA, AHMEDABAD – 382424,  GUJARAT, INDIA. INDIVIDUAL Address for service in India/Attorney address: P.K.SUTHAR & ASSOCIATES P.K. SUTHAR AND ASSOCIATES, A-204, VINAYAK ELEGANCE, NEAR SHAYONA CITY UNDER PASS, CHANDLODIA,  AHMEDABAD - 382481, GUJARAT, INDIA. Used Since :20/02/2022 AHMEDABAD MEDICAL SERVICES; VETERINARY SERVICES; HYGIENIC AND BEAUTY CARE FOR HUMAN BEINGS INCLUDED IN  CLASS 44. 4704","tm_class":"44","tm_phonetics":"MNTK"},{"page_no":"597,journal no. 2048","trademark":"MYLO","details":"5344656    25/02/2022 MYLO HEALTHCARE PRIVATE LIMITED Plot No. NH-01, Sector-137, Noida, Gautam Buddha Nagar, UP 201301 IN A company incorporated Address for service in India/Attorney address: LEX FONS K-505, Ajnara Daffodil, Sector-137, Noida, Distt. Gautam Buddha Nagar, (Uttar Pradesh) 201305 Proposed to be Used DELHI Medical treatment services provided by clinics and hospitals; Medical services; Pharmacy Dispensary services; Providing  health information via a website; Provision of medical information from a website; Providing health care information by  telephone and the internet; Health and beauty care for human beings; Consultancy provided via the internet in the field of  body and beauty care; Physician services; Chiropractic, physiotherapy, acupuncture, osteopathy, sports medicine,  massage and paramedical services; Laboratory analysis services relating to the treatment of persons and Diagnosis of  diseases. 4705","tm_class":"44","tm_phonetics":"ML"},{"page_no":"598,journal no. 2048","trademark":"WHITE STAR","details":"5344763    25/02/2022 MS. ALPA VASISHAT SHARMA EW-4, SECOND FLOOR, MIANWALI NAGAR, PASCHIM VIHAR, WEST DELHI-110087 INDIVIDUAL Address for service in India/Attorney address: CNR PARTNERS AD/24-C, OUTER RING ROAD, PITAMPURA, DELHI-110034 Proposed to be Used DELHI DENTAL SERVICES, DENTAL HYGIENIST SERVICES, DENTAL CLINIC SERVICES, DENTAL IMPLANT SURGERY  SERVICES, DENTAL ROOT CANAL TREATMENT SERVICES. 4706","tm_class":"44","tm_phonetics":"WT STR"},{"page_no":"602,journal no. 2048","trademark":"DHOSA","details":"5346412    26/02/2022 DHOSA RETAIL NETWORK PRIVATE LIMITED VILL&PO -DHOSA,DIST-SOUTH 24 PARGANAS ,STATE-WEST BENGAL,PIN-743337 BODY INCORPORATE STARTUP Address for service in India/Attorney address: MONIKA JINDAL, ADVOCATE DELHI LAW FIRM, 120, TRIVENI APARTMENTS, WEST ENCLAVE, PITAMPURA, DELHI-110034 EMAIL :  DELHILAWFIRMMONIKA@GMAIL.COM Proposed to be Used KOLKATA Medical services, veterinary services, hygienic and beauty care for human beings or animals; agriculture, horticulture and  forestry services as included in class 44 4710","tm_class":"44","tm_phonetics":"0S"},{"page_no":"605,journal no. 2048","trademark":"RAJAPUSHPA","details":"5347113    25/02/2022 M/S. RAJAPUSHPA PROPERTIES PRIVATE LIMITED Rajapushpa Summit, Sy No. 115/1 And 130/P, 6th Floor, Financial District, Nanakramguda, Hyderabad – 500008,Telangana, India Body Incorporate Address for service in India/Agents address: S.BALAJANAKI SUITE NO 27 C & D, 3RD FLOOR, PANDU KLIX PLAZA, 168 THAMBU CHETTY STREET, CHENNAI-600 001. Used Since :20/11/2009 To be associated with: 2399807 CHENNAI Hospitals, Health Care Services, Spa, Beauty Salon, Service of Beauty Care, Hair Cutting, Body Massage, Medical  Diagnostic Services. 4713","tm_class":"44","tm_phonetics":"RJPKSHP"},{"page_no":"612,journal no. 2048","trademark":"BOAT","details":"5352046    02/03/2022 SHAMJI RAGHU DEVDA 201, FLOOR-GRD, PLOT-29, RUSTOM BUILDING, VEER NARIMAN ROAD, HUTATMA CHOWK, FORT, MUMBAI-400001 INDIVIDUAL Address for service in India/Attorney address: PURVI & ASSOCIATES 18-A, GALI NO.7, PRATAP NAGAR, MAYUR VIHAR PHASE-1, DELHI-110091 Proposed to be Used MUMBAI Beauty and hair care services, Beauty care, Medical and healthcare services, Hakim (Medical services), Medical testing  services, Medical care services, Human hygiene and beauty care, Medical counseling services, Medical treatment services,  Body skin care treatments, Beauty consultations, Beauty treatment services, Cosmetic laser treatment of skin, Cosmetic  skin tanning services for human beings, Laser skin tightening services, Laser skin rejuvenation services, Hair treatment,  Hair care services, Laser removal of hair, Hair tinting services, Hair replacement services, Hair extensions treatment  services, Advice relating to hair care, Health care services. 4720","tm_class":"44","tm_phonetics":"BT"},{"page_no":"614,journal no. 2048","trademark":"INDO LEGAL SERVICES","details":"3980261    23/10/2018 INDO LEGAL SERVICES LLP F F-51/421, First Floor Gali No. 3, Tikona Park Laxmi Nagar East Delhi -110092 Law Firm Address for service in India/Attorney address: ASHUTOSH GUPTA & ASSOCIATES 9 /283, SECTOR-3, RAJENDRA NAGAR SAHIBABAD, GHAZIABAD 201005, UP Used Since :01/04/2016 DELHI Legal services; security services for the physical p rotection of tangible property and individuals; personal and social  services rendered by others to meet the needs of individuals. THE TRADE MARK SHALL BE USED AS A WHOLE WITH NO EXCLUSIVE RIGHT ON THE WORDS Legal Services.. 4722","tm_class":"45","tm_phonetics":"INT LKL SRFSS"},{"page_no":"616,journal no. 2048","trademark":"THE SOLUTIONIST","details":"4249137    29/07/2019 RAJIV BALI E -56, 3rd Floor, Nariana Vihar, New Delhi-110028 Proprietor Address for service in India/Attorney address: ANIKET BHATTACHARYYA A -19, Ground floor, Jangpura Extension Proposed to be Used D ELHI Advisory Services relating to Intellectual Property protection; Advisory Services relating to Intellectual Property Licensing;  Advisory Services relating to patents; Advisory Services relating to copyright; Advisory Services relating to Intellectual  Property Rights; Arranging for provision of legal services; Company registration services; Compilation of legal  information; Consultancy relating to intellectual property management; Consultancy relating to trademark protection;  Conveyance services; Information Services relating to legal matters; Information services relating to consumer rights;  Legal Advice; Legal assistance in the drawing up of contracts; Legal Consultancy relating to Intellectual Property Rights;  Legal Consultancy Services; Litigation Consultancy; Mediation Services; Paralegal Services; Provision of legal  information. The Applicant wishes to claim rights in all colours. 4724","tm_class":"45","tm_phonetics":"0 SLXNST"},{"page_no":"618,journal no. 2048","trademark":"GRAVITTUS","details":"4589045    30/07/2020 USHA KAKADE 1 205, Kakade Capital, Shirole Road, Shivaji Nagar, Pune- 411 004, Maharashtra. Individual Address for service in India/Attorney address: KASHYAP POPAT KHANDAGALE C /o SunBrio IPR Pvt Ltd, 1202/28 2nd floor BHAGYODAY, Apte Road, Shivajinagar, Pune 411004, Maharashtra, India. Proposed to be Used M UMBAI Personal and social services rendered by others to m eet the needs of individuals THIS IS SUBJECT TO ASSOCIATION WITH REGISTERED/PENDING REGISTRATION NO..3902569.. 4726","tm_class":"45","tm_phonetics":"KRFTS"},{"page_no":"621,journal no. 2048","trademark":"THE HEARTWORK COLLECTIVE","details":"4672335    24/09/2020 MANMEET ARORA 7 01 Vrindavan, Mount Mary Road, Bandra (West), Mumbai- 400050 Sole Proprietor trading as The Heartwork Collective Address for service in India/Attorney address: ESHA AUNDHIYA 1 9 paritosh society ajwa road near ajwa post office vadodara 390019 gujarat Proposed to be Used M UMBAI Personal and social services rendered by others to m eet the needs of individuals. 4729","tm_class":"45","tm_phonetics":"0 HRTWRK KLKTF"},{"page_no":"632,journal no. 2048","trademark":"DOWN STERLING","details":"4902238    12/03/2021 SIVANARENDIRAN N O;157/12, STRAHANS ROAD, PATTALAM, OTTERI, CHENNAI - 600012 THE TRADEMARK ACT - 1999 Address for service in India/Attorney address: NEWTON REGINALD N o 6, Dhanammal Street Spurtank Road Chetpet Chennai - 600031 Proposed to be Used C HENNAI Legal services; Security services for the physical p rotection of tangible property and individuals; Personal and social  services rendered by others to meet the needs of individuals 4740","tm_class":"45","tm_phonetics":"TN STRLNK"},{"page_no":"634,journal no. 2048","trademark":"MAHESH FOUNDATION","details":"4914902    21/03/2021 RAHISH .B.N A ged 33 Years,S/O Narayana.B,K.G-66,Rashmi Nilaya,Kannagude Alape,Mangalore,Padil,Mangalore,Dakshina Kannada,Karnataka- 575007(Aadhar No:2740 9692 0578) Propertier Address for service in India/Attorney address: NAVANEETHA.D N andagokula,Hinghani House,Arambody -Post,Belthangady-tq,Dakshina Kannada,Karnataka.PIN-574237 Proposed to be Used C HENNAI SOCIAL AND CHARITABLE SERVICES,CHARITABLE AND PHILAN THROPIC SERVICES. 4742","tm_class":"45","tm_phonetics":"MHKSH FNTXN"},{"page_no":"644,journal no. 2048","trademark":"RKD LEGAL","details":"5339823    22/02/2022 MOHAN RAJKUMAR DEWAN 1 147/B, MOHAN VILLA, NEAR KEDARNATH TEMPLE, MODEL COLONY, SHIVAJINAGAR, PUNE 411016. AN INDIAN NATIONAL Address for service in India/Agents address: R.K. DEWAN & CO. P ODAR CHAMBERS, S.A. BRELVI ROAD, FORT, MUMBAI - 400 001. Proposed to be Used T o be associated with: 3705072 MUMBAI PROVIDING LEGAL SERVICES AND LEGAL ADVISORY SERVICES  VIRTUALLY; PROVIDING INTELLECTUAL PROPERTY  CONSULTANCY SERVICES VIRTUALLY, PROVIDING INFORMATION ABOUT INTELLECTUAL AND INDUSTRIAL  PROPERTY RIGHTS VIRTUALLY. 4752","tm_class":"45","tm_phonetics":"RKT LKL"},{"page_no":"645,journal no. 2048","trademark":"R K DEWAN CHRONICLES","details":"5339825    22/02/2022 MOHAN RAJKUMAR DEWAN 1 147/B, MOHAN VILLA, NEAR KEDARNATH TEMPLE, MODEL COLONY, SHIVAJINAGAR, PUNE 411016. AN INDIAN NATIONAL Address for service in India/Agents address: R.K. DEWAN & CO. P ODAR CHAMBERS, S.A. BRELVI ROAD, FORT, MUMBAI - 400 001. Proposed to be Used M UMBAI PROVIDING LEGAL SERVICES AND LEGAL ADVISORY SERVICES  VIRTUALLY; PROVIDING INTELLECTUAL PROPERTY  CONSULTANCY SERVICES VIRTUALLY, PROVIDING INFORMATION ABOUT INTELLECTUAL AND INDUSTRIAL  PROPERTY RIGHTS VIRTUALLY. 4753","tm_class":"45","tm_phonetics":"R K TWN KSHRNKLS"},{"page_no":"646,journal no. 2048","trademark":"NEWSNET","details":"5339829    22/02/2022 MOHAN RAJKUMAR DEWAN 1 147/B, MOHAN VILLA, NEAR KEDARNATH TEMPLE, MODEL COLONY, SHIVAJINAGAR, PUNE 411016. AN INDIAN NATIONAL Address for service in India/Agents address: R.K. DEWAN & CO. P ODAR CHAMBERS, S.A. BRELVI ROAD, FORT, MUMBAI - 400 001. Proposed to be Used M UMBAI PROVIDING LEGAL SERVICES AND LEGAL ADVISORY SERVICES  VIRTUALLY; PROVIDING INTELLECTUAL PROPERTY  CONSULTANCY SERVICES VIRTUALLY, PROVIDING INFORMATION ABOUT INTELLECTUAL AND INDUSTRIAL  PROPERTY RIGHTS VIRTUALLY. 4754","tm_class":"45","tm_phonetics":"NSNT"},{"page_no":"647,journal no. 2048","trademark":"RKD","details":"5339831    22/02/2022 MOHAN RAJKUMAR DEWAN 1 147/B, MOHAN VILLA, NEAR KEDARNATH TEMPLE, MODEL COLONY, SHIVAJINAGAR, PUNE 411016. AN INDIAN NATIONAL Address for service in India/Agents address: R.K. DEWAN & CO. P ODAR CHAMBERS, S.A. BRELVI ROAD, FORT, MUMBAI - 400 001. Proposed to be Used T o be associated with: 3705072 MUMBAI PROVIDING LEGAL SERVICES AND LEGAL ADVISORY SERVICES  VIRTUALLY; PROVIDING INTELLECTUAL PROPERTY  CONSULTANCY SERVICES VIRTUALLY, PROVIDING INFORMATION ABOUT INTELLECTUAL AND INDUSTRIAL  PROPERTY RIGHTS VIRTUALLY. 4755","tm_class":"45","tm_phonetics":"RKT"},{"page_no":"648,journal no. 2048","trademark":"WARDWIZARD","details":"5343074    24/02/2022 YATIN GUPTE 1 2/a, SURAMYA BUNGALOWS, RAIPURA ROAD, BHAYALI GAON, BEHIND LALGURU FARM, BHAYLI, VADODARA –  391410, (GUJARAT) INDIVIDUAL Address for service in India/Attorney address: YASH SURYAWALA N /7, 1st floor, Dhavalgiri Aprtment, B/h Dr. Swadiya\"s Hospital, Nr. Kuber Bhuvan, Kothi, Vadodara, Gujarat. Proposed to be Used A HMEDABAD Adoption agency services, alternative dispute resolu tion services, arbitration services, astrology consultancy, babysitting,  bereavement counselling / bereavement counseling, burial services, cartomancy services, chaperoning / escorting in  society [chaperoning], clothing rental, concierge services, conducting funeral ceremonies, conducting religious  ceremonies, copyright management, crematorium services, dating services, detective agency services, dog walking  services, embalming services, evening dress rental, fire-fighting, funerary undertaking, genealogical research, guard  services, horoscope casting, house sitting, inspection of factories for safety purposes, intellectual property consultancy,  kimono dressing assistance, leasing of internet domain names, legal administration of licences, legal advice in responding  to calls for tenders / legal advice in responding to requests for proposals [RFPs], legal advocacy services, legal  compliance auditing, legal consultancy relating to patent mapping, legal document preparation services, legal research,  legal services in relation to the negotiation of contracts for others, legal services in the field of immigration, legal watching  services, licensing [legal services] in the framework of software publishing, licensing of computer software [legal  services], licensing of intellectual property, lifeguard services, litigation services, lost property return, marriage agency  services, mediation, missing person investigations, monitoring intellectual property rights for legal advisory purposes,  monitoring of burglar and security alarms, night guard services, online social networking services, opening of security  locks, organization of political meetings, organization of religious meetings, personal background investigations, personal  bodyguarding, personal letter writing, personal wardrobe styling consultancy, pet sitting, physical security consultancy,  planning and arranging of wedding ceremonies, registration of domain names [legal services], regulatory compliance  auditing, releasing doves for special occasions, rental of fire alarms, rental of fire extinguishers, rental of safes, security  screening of baggage, spiritual consultancy, tarot card reading services for others, tracking of stolen property. 4756","tm_class":"45","tm_phonetics":"WRTWSRT"},{"page_no":"649,journal no. 2048","trademark":"NAUGHTY NITES","details":"5343567    24/02/2022 KARAN ARORA L -13, UGF RAJOURI GARDEN, NEW DELHI-110027 INDIVIDUAL Address for service in India/Attorney address: PURVI & ASSOCIATES 1 8-A, GALI NO.7, PRATAP NAGAR, MAYUR VIHAR PHASE-1, DELHI-110091 Proposed to be Used D ELHI Online social introduction services, Online social n etworking services accessible by means of downloadable mobile  applications, Internet-based social networking services, Internet-based social networking, introduction, and dating  services. 4757","tm_class":"45","tm_phonetics":"NT NTS"},{"page_no":"650,journal no. 2048","trademark":"RESHAMM","details":"5344912    25/02/2022 RESHM FASHION AND JEWELLERY PRIVATE LIMITED 2 0-D, DDA SFS FLATS, HIGHWAY APARTMENT GAZIPUR CROSSING, GAZIPUR DELHI 110092 INDIA PRIVATE LIMITED COMPANY Address for service in India/Attorney address: TANDON AND CO X -3 GREEN PARK MAIN NEW DELHI-110016 Proposed to be Used D ELHI CONSULTATION OF ASTROLOGY, VASTU, NUMEROLOGY, REIKI,  GEMOLOGY AND ALL OCCULT SCIENCE SERVICES  AND PRODUCTS INCIDENTAL THERETO ALL UNDER CLASS 45 4758","tm_class":"45","tm_phonetics":"RKSHM"},{"page_no":"652,journal no. 2048","trademark":"AAMEEN CHARITABLE FOUNDATION","details":"5346229    26/02/2022 ANEES MIYAJI S/O ASGAR MIYAJI 3 3,DHOLI BAWRI,UDAIPUR, RAJASTHAN-313001 SECTION 8 COMPANY Address for service in India/Attorney address: BRIJESH CHAUHAN, ADVOCATE I N FRONT OF RADAJI TEMPLE, MALI COLONY MAIN ROAD, TEKRI, UDAIPUR - 313 001 - RAJASTHAN. Used Since :09/11/2020 AHMEDABAD SOCIAL SERVICES RENDERED BY OTHERS TO MEET THE NEEDS  OF INDIVIDUALS. 4760","tm_class":"45","tm_phonetics":"AMN KSHRTBL FNTXN"},{"page_no":"666,journal no. 2048","trademark":"DANGEROUS WORLD","details":"Priority claimed from 08/08/2018; Application No. :  017940663 ;European Union   4074156    01/02/2019 Treads Galore, LLC 3  Allied Drive, Suite 303, Dedham, MA, United States of America, 02026 A limited liability company organized and existing under the laws of the state of Delaware, U.S.A Address for service in India/Agents address: S.S. RANA & CO. 3 17, LAWYERS CHAMBERS, HIGH COURT OF DELHI, NEW DELHI - 110 003. Proposed to be Used D ELHI Cl.9; Video game software for consoles, mobile devices and  personal computing devices; downloadable electronic game  programs; electronic game software; downloadable computer game programs; computer game software downloadable  from a global computer network; computer game software; interactive video game programs; video game software;  computer game programs; game software; interactive game programs. Cl.41; Entertainment, namely, providing on-line computer ga mes; entertainment in the nature of computer games,  namely, providing temporary use of non-downloadable computer games; entertainment, namely, providing non- downloadable computer games online; entertainment services, namely, providing temporary use of non-downloadable  interactive games; entertainment services, namely, providing temporary use of non-downloadable electronic games;  entertainment services, namely, providing a website featuring games; entertainment services, namely, providing online  video games; providing on-line computer games via a computer network; organization of electronic games competitions;  electronic games services provided by means of a global computer network; entertainment services, namely, providing  online electronic games for use on mobile phones, tablets and other electronic mobile devices; entertainment services,  namely, providing temporary use of non-downloadable single and multi-player electronic interactive games via the  internet, electronic communication networks or via a global computer network; multimedia publishing of software,  specifically of computer game software, electronic games and video game software. Cl.45; Online social networking services in the field of en tertainment and video games; social networking services in the  field of entertainment provided via a website and communications networks; social networking services provided via the  Internet or other computer or communications network; on-line social networking services, namely, facilitating social  introductions or interactions among individuals; providing a social networking website for entertainment purposes. 4774","tm_class":"99","tm_phonetics":"TNJRS WRLT"},{"page_no":"672,journal no. 2048","trademark":"ACCESS","details":"4694822    09/10/2020 BECKMAN COULTER, INC. 2 50 South Kraemer Blvd., Brea, California 92821-6232, United States of America A Delaware corporation Address for service in India/Attorney address: K & S PARTNERS C -915, Kailas Business Park, Hiranandani Link Road, Parksite, Vikhroli (West), Mumbai - 400079, India Used Since :31/12/1999 MUMBAI C l.1; Diagnostic kits including specimen receptors and rea gents for testing for physiological conditions. Cl.5; In vitro diagnostic test kits and in vivo treatment  products for the primary care physician office market, including,  but not limited to, human serum of urine pregnancy tests, test kits for occult blood in stool and human serum allergy  testing services; said test kits consisting primarily of reagents and developing solutions and said treatment products  consisting primarily of allergen extracts. Cl.9; Electronic analyzer for the laboratory analysis of b odily fluids. Cl.10; Electronic analyzer for the medical analysis of bodi ly fluids. 4780","tm_class":"99","tm_phonetics":"AKSS"},{"page_no":"673,journal no. 2048","trademark":"CHEST-RAI","details":"4701949    14/10/2020 L&T TECHNOLOGY SERVICES LIMITED L &T House, Ballard Estate, Mumbai - 400 001 A company incorporated under the law of India Address for service in India/Attorney address: LEXORBIS 7 09/710 Tolstoy House, 15-17 Tolstoy Marg, New Delhi-110001 Proposed to be Used M UMBAI Cl.9; Software; web application software; mobile applicati on software; image recognition software; computer programs  and software for image processing; artificial intelligence and machine learning software; artificial intelligence software for  analysis; computer software applications for use with artificial intelligence; machine learning software for healthcare;  machine learning software used in computer analysis programs; software for use in the evaluation and analysis of data  utilizing machine learning; machine learning software used in computer deep learning programs; computer software for  data and document capture, transmission, storage and indexing Cl.42; Computer programming; programming of computer softwa re for reading, transmitting and organizing data;  computer programming for the medical sector; design and development of computer software for use with medical  technology; software design and development services; image processing software development; design and  development of image processing software; design, development, maintenance and updating of computer software for  data processing; development of computer software application solutions; installation and customization of computer  applications software; providing temporary use of web-based software; updating of software 4781","tm_class":"99","tm_phonetics":"SHST-R"},{"page_no":"678,journal no. 2048","trademark":"SPOTLIGHT","details":"4895738    09/03/2021 ABP PRIVATE LIMITED trading as ;ABP PRIVATE LIMITED 6, PRAFULLA SARKAR STREET, KOLKATA - 700 001, WEST B ENGAL, INDIA SERVICE PROVIDER Address for service in India/Agents address: SOUMITRA DATTA,ADVOCATE 6  OLD POST OFFICE STREET, ROOM NO.35 & 50, KOLKATA-700001,WEST BENGAL,INDIA. Used Since :03/09/2020 KOLKATA THIS IS SUBJECT TO ASSOCIATION WITH REGISTERED/PENDI NG REGISTRATION NO. 4747945. Cl.16; Printed matter. Cl.35; Advertising / publicity; production of advertising f ilms; dissemination of advertising matter; online advertising on  a computer network; promotion of goods and services through sponsorship of sports events; sales promotion for others;  scriptwriting for advertising purposes; television advertising Cl.38; Cable television broadcasting; television broadcasti ng and satellite transmission. Cl.41; Entertainment services; television entertainment; pr oduction of shows; production of television programmes;  providing television programmes; organization of shows and news reporters services. 4786","tm_class":"99","tm_phonetics":"SPTLT"},{"page_no":"681,journal no. 2048","trademark":"COCOZ RISE & SHINE","details":"4900071    11/03/2021 ANJOO SHARMA M ahaLakshmi House, 6-3-883/2/3, Panjagutta, Hyderabad - 500082 E-Commerce Proprietor Proposed to be Used C HENNAI Cl.25; Clothing, Shoes & Headgear Cl.30; Sweets, Chocolates 4789","tm_class":"99","tm_phonetics":"KKS RS & KSHN"},{"page_no":"683,journal no. 2048","trademark":"FOAMBOL","details":"4916742    23/03/2021 FIROZ JALAL S /o, A Jalaludeen, PRA 145 A, Padayani Road, Maruthamkuzhy, Vattiyoourkavu, Trivandrum – 695013, Kerala, India A citizen of India Address for service in India/Attorney address: SUDESHNA BANERJEE K &S PARTNERS, 4121/B, 6th Cross, 19 \"A\" Main, HAL II Stage (Ext.), Bangalore-560038, Karnataka, India Proposed to be Used C HENNAI Cl.3; BATH PREPARATIONS; BATH AND SHOWER GELS; BATH SOAP B ARS; BATH SOAPS IN LIQUID, SOLID OR GEL  FORM; ANTIPERSPIRANT SOAP; BATH SALTS, NOT FOR MEDICAL PURPOSES; COSMETIC PREPARATIONS FOR  BATHS; SKIN CARE COSMETICS AND PREPARATIONS; COSMETIC PREPARATIONS FOR SKIN CARE; COSMETIC  PREPARATIONS FOR SKIN CARE; FACE WASH; DENTAL CARE PREPARATIONS; ORAL HYGIENE PREPARATIONS;  ORAL CARE PREPARATIONS [NON-MEDICATED]; NON-MEDICATED DENTAL RINSES; MOUTHWASHES, NOT FOR  MEDICAL PURPOSES; DENTAL BLEACHING GELS; BREATH FRESHENING STRIPS; BREATH FRESHENING SPRAYS;  HAIR GROOMING PREPARATIONS; HAIR SPRAY; HAIR WAVING PREPARATIONS; HAIR DYES; HAIR COLORANTS; HAIR  LOTIONS; HAIR STRAIGHTENING PREPARATIONS; HAIR CONDITIONER; DRY SHAMPOO AND CONDITIONER; HAIR  MASK; HYDROGEN PEROXIDE FOR COSMETIC PURPOSES; MOUSTACHE WAX; SHAVING PREPARATIONS; SHAVING  AND AFTERSHAVE PREPARATIONS; PREPARATIONS, INCLUDING CREAMS, GELS AND MOUSSES, FOR USE BEFORE,  DURING AND AFTER SHAVING; SHAVING SOAPS; AIR FRAGRANCING PREPARATIONS; ALOE VERA PREPARATIONS  FOR COSMETIC PURPOSES; ALUM STONES [ASTRINGENTS]; ASTRINGENTS FOR COSMETIC PURPOSES; VAGINAL  WASHES FOR PERSONAL SANITARY OR DEODORANT PURPOSES; FABRIC SOFTENER FOR LAUNDRY; COSMETICS;  COSMETICS FOR PERSONAL USE; COSMETICS PREPARATIONS; COLOGNES, PERFUMES AND COSMETICS; TALCUM  POWDERS; TALCUM POWDER FOR COSMETIC PURPOSES; BODY DEODORANTS; BODY MIST; ANTIPERSPIRANTS  [TOILETRIES]; AROMATICS [ESSENTIAL OILS]; AMBER [PERFUME]; MUSK [PERFUMERY]; ESSENTIAL OILS; MINT FOR  PERFUMERY; MINT ESSENCE [ESSENTIAL OIL]; BALMS OTHER THAN FOR MEDICAL PURPOSES; BASES FOR FLOWER  PERFUMES; BEARD DYES; BEAUTY MASKS; LAUNDRY AND BLEACHING PREPARATIONS; CLEANING PREPARATIONS;  LAUNDRY DETERGENTS; CLOTHS IMPREGNATED WITH A DETERGENT FOR CLEANING; COLORANTS FOR TOILET  PURPOSES; COLOUR-REMOVING PREPARATIONS; COSMETIC KITS; COSMETIC CREAMS; COSMETIC DYES; INCENSE;  LACQUER-REMOVING PREPARATIONS; LIP GLOSSES; LIPSTICK CASES; LIPSTICKS; LOTIONS FOR COSMETIC  PURPOSES; MAKE-UP; MAKE-UP PREPARATIONS; MASCARA; MASSAGE GELS OTHER THAN FOR MEDICAL  PURPOSES; ARTIFICIAL PUMICE STONES; PUMICE STONES FOR PERSONAL USE; PUMICE STONES FOR USE ON THE  BODY; SHAVING STONES [ASTRINGENTS]; SHAVING PREPARATIONS; TALCUM POWDER, FOR TOILET USE; VOLCANIC  ASH FOR CLEANING. Cl.5; HAND-SANITIZING PREPARATIONS; SANITIZING PREPARATION S FOR HOUSEHOLD AND HOSPITAL USE;  ANTIBACTERIAL ALCOHOL SKIN SANITIZER GEL; SPRAY SANITIZER FOR PERSONAL USE; ABSORBENT ARTICLES  FOR PERSONAL HYGIENE; ABSORBENT COTTON; ABSORBENT WADDING; ACNE TREATMENT PREPARATIONS;  ADHESIVE TAPES FOR MEDICAL PURPOSES; ADHESIVE BANDS FOR MEDICAL PURPOSES; AIR DEODORISING  PREPARATIONS; ALCOHOL FOR PHARMACEUTICAL PURPOSES; ALOE VERA PREPARATIONS FOR PHARMACEUTICAL  PURPOSES; ANTISEPTIC COTTON; ANTISEPTICS; BANDAGES FOR DRESSINGS; BATH PREPARATIONS FOR MEDICAL  PURPOSES; BATH SALTS FOR MEDICAL PURPOSES; CAMPHOR OIL FOR MEDICAL PURPOSES; CASTOR OIL FOR  MEDICAL PURPOSES; SOLUTIONS FOR CONTACT LENSES; COOLING SPRAYS FOR MEDICAL PURPOSES;  DEODORANTS FOR CLOTHING AND TEXTILES; DEPURATIVE; DETERGENTS FOR MEDICAL PURPOSES;  DISINFECTANTS FOR HYGIENE PURPOSES; DISINFECTANTS; EYE-WASHES; HAEMOSTATIC PENCILS; MENTHOL;  MOUTHWASHES FOR MEDICAL PURPOSES; MUD FOR BATHS; PHARMACEUTICAL PREPARATIONS FOR SKIN CARE;  PHARMACEUTICAL PREPARATIONS FOR TREATING DANDRUFF; THERAPEUTIC PREPARATIONS FOR THE BATH;  THYMOL FOR PHARMACEUTICAL PURPOSES; VAGINAL WASHES; MEDICATED ANTIPERSPIRANT SOAP. 4791","tm_class":"99","tm_phonetics":"FMBL"},{"page_no":"684,journal no. 2048","trademark":"TAPRI","details":"5087947    13/08/2021 VEENA 3 /2 & 4, DAMS ROAD, 2ND FLOOR, CHINTADRIPET, CHENNAI - 600002 Manufacturer Sole Proprietor Address for service in India/Attorney address: AISHWARYA V 1 82, Kutchery Road, 2nd Floor, Mylapore, Chennai (Above More Supermarket) Proposed to be Used C HENNAI Cl.14; Precious metals and their alloys and goods in precio us metal or coated therewith, not included in other classes ;  jewellery, precious stones; horological and other chronometric instruments Cl.20; furniture, mirrors, picture frames; goods (not inclu ded in other classes) of wood, cork, reed, cane, wicker, horn,  shell, amber, mother-of-pearl, meerschaum and substitutes for all these materials, or of plastics. Cl.25; clothing, footwear, headgear. 4792","tm_class":"99","tm_phonetics":"TPR"},{"page_no":"689,journal no. 2048","trademark":"LITTLE PEOPLE COMPANY","details":"5182942    21/10/2021 NEHA SONIKA N o.225 B, Laughing Water, Varthur Main Road, Ramagondanahalli, Whitefield, Bengaluru, Bengaluru (Bangalore) Urban, Karnataka,  560066 Sole Proprietorship Address for service in India/Attorney address: VAIBHAVI SHARMA B -9, L.G.F., Kailash Colony, New Delhi-110048 Used Since :08/03/2021 CHENNAI C l.24; Bed linen, bed blankets, quilts, towels, diaper chan ging cloths for babies, swaddle cloth, wash cloth, face towels Cl.25; Dresses, rompers, tops, tee shirts, sweatshirts, jum psuits, playsuits, shirts, cardigans, sweaters, jackets, vests,  underwear, nightwear, pyjamas, knickers, shorts, leggings, tights, joggers, jeans, trousers, bonnets, caps, hats, socks,  shoes, booties. 4797","tm_class":"99","tm_phonetics":"LTL PPL KMPN"},{"page_no":"690,journal no. 2048","trademark":"ZWITCH","details":"5183170    22/10/2021 OPEN FINANCIAL TECHNOLOGIES PRIVATE LIMITED 3 RD FLOOR, TOWER 2, RGA TECH PARK, SARJAPUR MAIN ROAD, CARMELARAM, BENGALURU A company incorporated under the laws of India Address for service in India/Attorney address: SAMVAD PARTNERS 1 1/6 RAILWAY COLONY, 3RD STREET, II FLOOR, NELSON MANICKAM ROAD, AMINJIKARAI, CHENNAI - 600029. Used Since :01/02/2021 CHENNAI C l.9; Computer Software; Computer Software used to enhance  the capabilities and features of other Software And Non  Downloadable Online Software; Computer software platform, recorded or downloadable; Computer software providing  downloadable electronic data files and databases relating to financial services; Computer software platform for embedded  finance solutions; Computer software used to enhance the capabilities and features of non-downloadable online software;  Computer software interface for businesses to incorporate financial products and services; Mobile application and mobile  software; Downloadable software via the Internet and Wireless Device Cl.36; Services relating to banking, financial transaction  and payment services, namely enabling banking, payments,  KYC, accounting, compliance, and other features through an embedded finance platform. Cl.42; Digital platform services; Software as a service (Sa aS) for the purposes of providing embedded financial services;  Platform as a service (PaaS) for businesses to incorporate financial products and services namely enabling banking,  payments, KYC, accounting, compliance, and other features through an embedded finance platform; PaaS for providing  B2B solutions relating to financial technology and data; Computer Programming for providing an Application  Programming Interface as a service; SaaS and PaaS for embedding financial services; PaaS for providing use of on-line  non downloadable software development kits and application programming interface; Application service provider  featuring API software for allowing retrieval, upload, access and management; Providing a website featuring non- downloadable software for use in financial transaction and payment services and database management. 4798","tm_class":"99","tm_phonetics":"SWTKSH"},{"page_no":"692,journal no. 2048","trademark":"PATIENTSLIKEME","details":"5187278    25/10/2021 Bajaj Finserv Health Limited 4 th Floor, Phoenix Fountain Head, Clover Park, Off Nagar Road, Viman Nagar, Pune – 411 014, India SERVICE PROVIDER Address for service in India/Agents address: MOHAN ASSOCIATES. C EEBROS BUILDING, D - 4, III FLOOR, NO. 11, CENETOPH ROAD, TEYNAMPET, CHENNAI - 600 018, TAMIL NADU Proposed to be Used M UMBAI Cl.36; INSURANCE, FINANCIAL AND MONETARY AFFAIRS; CREDIT CA RD SERVICES; ISSUANCE OF CREDIT CARDS;  FINANCIAL SERVICES RELATING TO CREDIT CARDS; PROVIDING CASH AND OTHER REBATES FOR CREDIT CARD USE  AS PART OF A CUSTOMER LOYALTY PROGRAM Cl.44; MEDICAL AND HEALTHCARE SERVICES 4800","tm_class":"99","tm_phonetics":"PTNTSLKM"},{"page_no":"698,journal no. 2048","trademark":"IT'S YOUR SKY","details":"5206191    12/11/2021 SNV AVIATION PRIVATE LIMITED F -302, Ashok Gardens 180 T.J. Road, Sewri, Mumbai 400015, Maharashtra, India A company incorporated under the Companies Act, 2013 Address for service in India/Attorney address: PRERAK HORA 1 05, A/2, Ganga Vihar, Podar Road, Santacruz West, Mumbai 400054 Proposed to be Used M UMBAI Cl.9; Scientific, research, navigation, surveying, photogr aphic, audiovisual, signalling, detecting, testing, inspecting, life- saving and teaching apparatus and instruments; apparatus and instruments for recording, transmitting, reproducing or  processing sound, images or data; recorded and downloadable media, computer software, mobile applications Cl.16; Paper and cardboard; printed matter; printed publica tions; bookbinding material; photographs; stationery and  office requisites, except furniture; instructional and teaching materials; plastic sheets, films and bags for wrapping and  packaging; booklets; books; drawing books; boxes of paper or cardboard; calendars; catalogues; coasters of paper;  document holders; face towels of paper; tablecloths of paper; greeting cards; magazines; manuals; handbooks;  newsletters; pamphlets; pens; pencils; tickets; hygienic paper Cl.25; Clothing; headwear Cl.28; Games, toy models, playing cards Cl.35; Business management services, namely, aircraft manag ement for others; purchasing and procurement services  pertaining to aircraft, aircraft engines, and aircraft parts; on-line wholesale and retail store services featuring aircraft,  aircraft engines and aircraft parts; retail services by direct solicitation by sales agents in the field of aircraft, aircraft  engines and aircraft parts; sales promotion services; promoting the sale of aircraft and aircraft parts of others; providing  sales leads for the aircraft, aircraft engines, and aircraft parts industry; promoting the goods and services of others by  means of a loyalty program, discount program and incentive awards program; online retail store services featuring gift  cards and private club membership; promoting the goods and services of others by means of providing an on-line  shopping mall with links to the retail web sites of others Cl.36; Aircraft brokerage; aircraft financing services; for mation, brokerage and management of interests in aircraft,  aircraft engines, and aircraft parts; financial, monetary and banking services; insurance services; real estate affairs Cl.37; Repair and maintenance of aircraft, vehicles, aircra ft-related facilities, baggage-related facilities, and air travel  related facilities; refueling of aircraft and land vehicles; ground support services in the field of air transportation Cl.39; Air transportation services; air transportation of freight and passengers; providing an online computer database in  the field of air transportation; transport brokerage; rental and leasing of aircraft, aircraft engines, and aircraft parts;  packaging and storage of goods; travel arrangement; rental services related to transport, storage and travel Cl.41; Providing education and training to children, conduc ting educational programs for children; Providing education  and training to women, conducting educational programs for women; Educational services; Educational training,  coaching, vocational, assessments by means of physical classes, e-learning modules, virtual classes, satellite classes,  live online classes or any other such mode or combination of various such modes in various subjects, faculties, streams  by using various available technologies on desktops, laptops, mobiles, tablets, gaming consoles, virtual reality,  augmented reality or any other such newer technological inventions; entertainment; sporting and cultural activities Cl.42; Scientific and technological services and research a nd design relating thereto; quality control and authentication  services; design and development of computer hardware and software; platform as a service [PaaS]; software as a service [SaaS] Cl.43; Food and drink catering; providing food and beverage  services; food and beverage lounge facilities; providing  hotel reservation and coordination services for others by means of a global computer network; travel agency services Cl.45; Social, community and charitable services 4806","tm_class":"99","tm_phonetics":"IT'S YR SK"},{"page_no":"703,journal no. 2048","trademark":"LARKPHONE","details":"5325916    11/02/2022 HUBEI JI SU KAN DIAN TECHNOLOGY CO., LTD. Z one F, Building No,8, Huazhong Shuguang Software Area, No.1 Guangshan Road, Wuhan City, Hubei Province, China A company incorporated under the laws of China Address for service in India/Attorney address: K & S PARTNERS 5 15 - B, PLATINUM TOWER, 5TH FLOOR, SOHNA ROAD, SECTOR - 47, GURGAON - 122002, NATIONAL CAPITAL REGION,  INDIA Proposed to be Used D ELHI Cl.9; Scientific, research, navigation, surveying, photogr aphic, cinematographic, audiovisual, optical, weighing,  measuring, signalling, detecting, testing, inspecting, life-saving and teaching apparatus and instruments; Apparatus and  instruments for conducting, switching, transforming, accumulating, regulating or controlling the distribution or use of  electricity; Apparatus and instruments for recording, transmitting, reproducing or processing sound, images or data;  Recorded and downloadable media, computer software, blank digital or analogue recording and storage media;  Mechanisms for coin-operated apparatus; Cash registers, calculating devices; Computers and computer peripheral  devices; Diving suits, divers’ masks, ear plugs for divers, nose clips for divers and swimmers, gloves for divers, breathing  apparatus for underwater swimming; Fire-extinguishing apparatus; computer operating software; computer browsing  software; computer software for providing access to the Internet; computer hardware; desktop computers; tablet  computers; mobile phones; personal handheld devices; application software; application software for smart phone; data  processing apparatus; downloadable computer software applications; downloadable smartphone application (software);  air analysis apparatus; amplifiers; animated cartoons; answering machines; anti-theft warning apparatus; application  software for use in increasing business productivity; audiovisual teaching apparatus; battery chargers; biometric identity  cards; cabinets for loudspeakers; cameras [photography]; cinematographic cameras; electrical adapters; electronic book  readers; electronic pocket translators; eyewear; headphones; intercommunication apparatus; loudspeakers; measuring  apparatus; microphones; mobile telephones / cell phones / cellular phones; projection apparatus; protective cases for  smartphones; remote control apparatus; scanners [data processing equipment]; selfie sticks [hand-held monopods]; slide  projectors; smart glasses; smartphones; smartwatches; sound alarms; telephone apparatus; television apparatus;  videoconferencing apparatus, equipment and software; covers for smartphones and mobile phones; electronic interactive  whiteboards; facsimile machines; monitors [computer programs]; navigational instruments; scanners [data processing  equipment]; video recorders; video projectors; sound recording carriers; communication software for connecting  computer network users; computer software for database management; computer software for business purposes;  computer software for cloud computing;computer software for data, desktop and application streaming; business  intelligence software; game software; game engine software; computer software to manage, connect, and operate internet  of things (IOT) electronic devices; computer software development tools; software development kits (SDK). Cl.35; Advertising; Business management, organization and a dministration; Office functions; Retail store services  featuring computer software provided via the Internet and other computer and electronic communication networks; retail  store services featuring computer software for use on handheld mobile digital electronic devices and other consumer  electronics; on-line advertising on computer networks; preparing advertisements for others; dissemination of advertising  matter; advertising through all public communication means; sales promotion for others; compilation and collection of  data, information and statistics for business purposes database management; updating and maintenance of data in  computer databases; data management, storage and retrieval services; electronic storage of files and documents for  others; search engine optimization for sales promotion; personnel management consultancy; commercial information  agency services; providing business information via a website; advice and information concerning computer-aided  business productivity; providing information relating to business productivity via web sites. Cl.42; Scientific and technological services and research a nd design relating thereto; Industrial analysis, industrial  research and industrial design services; Quality control and authentication services; Design and development of computer  hardware and software; computer design services; application service provider (ASP) services, namely, hosting computer  software applications of others; technical support services; troubleshooting; providing a website featuring information  relating to computer software; design and development of computer hardware and software; provision of software  applications through a website; platform as a service (PaaS); application service provider (ASP) services; provision of  Internet search engines; software as a services (SaaS); cloud computing; providing technical information  and advice in the  field of computer hardware, computer software, cloud computing and computer networks; computer and software  consultancy services; telecommunications technology consultancy; information technology [IT] consultancy; internet  security consultancy; hosting on-line web facilities for others for sharing on-line content; hosting platforms on the  Internet; electronic data storage; hosting a website for the electronic storage of digital photographs and videos; hosting  digital content on the Internet; hosting multimedia entertainment content; hosting of multimedia and interactive  applications; web site hosting services; provision of software applications for use in increasing business productivity  through a website. 4811","tm_class":"99","tm_phonetics":"LRKFN"},{"page_no":"704,journal no. 2048","trademark":"LARKBOX","details":"5325918    11/02/2022 HUBEI JI SU KAN DIAN TECHNOLOGY CO., LTD. Z one F, Building No,8, Huazhong Shuguang Software Area, No.1 Guangshan Road, Wuhan City, Hubei Province, China A company incorporated under the laws of China Address for service in India/Attorney address: K & S PARTNERS 5 15 - B, PLATINUM TOWER, 5TH FLOOR, SOHNA ROAD, SECTOR - 47, GURGAON - 122002, NATIONAL CAPITAL REGION,  INDIA Proposed to be Used D ELHI Cl.9; Scientific, research, navigation, surveying, photogr aphic, cinematographic, audiovisual, optical, weighing,  measuring, signalling, detecting, testing, inspecting, life-saving and teaching apparatus and instruments; Apparatus and  instruments for conducting, switching, transforming, accumulating, regulating or controlling the distribution or use of  electricity; Apparatus and instruments for recording, transmitting, reproducing or processing sound, images or data;  Recorded and downloadable media, computer software, blank digital or analogue recording and storage media;  Mechanisms for coin-operated apparatus; Cash registers, calculating devices; Computers and computer peripheral  devices; Diving suits, divers’ masks, ear plugs for divers, nose clips for divers and swimmers, gloves for divers, breathing  apparatus for underwater swimming; Fire-extinguishing apparatus; computer operating software; computer browsing  software; computer software for providing access to the Internet; computer hardware; desktop computers; tablet  computers; mobile phones; personal handheld devices; application software; application software for smart phone; data  processing apparatus; downloadable computer software applications; downloadable smartphone application (software);  air analysis apparatus; amplifiers; animated cartoons; answering machines; anti-theft warning apparatus; application  software for use in increasing business productivity; audiovisual teaching apparatus; battery chargers; biometric identity  cards; cabinets for loudspeakers; cameras [photography]; cinematographic cameras; electrical adapters; electronic book  readers; electronic pocket translators; eyewear; headphones; intercommunication apparatus; loudspeakers; measuring  apparatus; microphones; mobile telephones / cell phones / cellular phones; projection apparatus; protective cases for  smartphones; remote control apparatus; scanners [data processing equipment]; selfie sticks [hand-held monopods]; slide  projectors; smart glasses; smartphones; smartwatches; sound alarms; telephone apparatus; television apparatus;  videoconferencing apparatus, equipment and software; covers for smartphones and mobile phones; electronic interactive  whiteboards; facsimile machines; monitors [computer programs]; navigational instruments; scanners [data processing  equipment]; video recorders; video projectors; sound recording carriers; communication software for connecting  computer network users; computer software for database management; computer software for business purposes;  computer software for cloud computing;computer software for data, desktop and application streaming; business  intelligence software; game software; game engine software; computer software to manage, connect, and operate internet  of things (IOT) electronic devices; computer software development tools; software development kits (SDK). Cl.35; Advertising; Business management, organization and a dministration; Office functions; Retail store services  featuring computer software provided via the Internet and other computer and electronic communication networks; retail  store services featuring computer software for use on handheld mobile digital electronic devices and other consumer  electronics; on-line advertising on computer networks; preparing advertisements for others; dissemination of advertising  matter; advertising through all public communication means; sales promotion for others; compilation and collection of  data, information and statistics for business purposes database management; updating and maintenance of data in  computer databases; data management, storage and retrieval services; electronic storage of files and documents for  others; search engine optimization for sales promotion; personnel management consultancy; commercial information  agency services; providing business information via a website; advice and information concerning computer-aided  business productivity; providing information relating to business productivity via web sites. Cl.42; Scientific and technological services and research a nd design relating thereto; Industrial analysis, industrial  research and industrial design services; Quality control and authentication services; Design and development of computer  hardware and software; computer design services; application service provider (ASP) services, namely, hosting computer  software applications of others; technical support services; troubleshooting; providing a website featuring information  relating to computer software; design and development of computer hardware and software; provision of software  applications through a website; platform as a service (PaaS); application service provider (ASP) services; provision of  Internet search engines; software as a services (SaaS); cloud computing; providing technical information and advice in the  field of computer hardware, computer software, cloud computing and computer networks; computer and software  consultancy services; telecommunications technology consultancy; information technology [IT] consultancy; internet  security consultancy; hosting on-line web facilities for others for sharing on-line content; hosting platforms on the  Internet; electronic data storage; hosting a website for the electronic storage of digital photographs and videos; hosting  digital content on the Internet; hosting multimedia entertainment content; hosting of multimedia and interactive  applications; web site hosting services; provision of software applications for use in increasing business productivity  through a website. 4812","tm_class":"99","tm_phonetics":"LRKBKS"},{"page_no":"705,journal no. 2048","trademark":"LARKCAST","details":"5325919    11/02/2022 HUBEI JI SU KAN DIAN TECHNOLOGY CO., LTD. Z one F, Building No,8, Huazhong Shuguang Software Area, No.1 Guangshan Road, Wuhan City, Hubei Province, China A company incorporated under the laws of China Address for service in India/Attorney address: K & S PARTNERS 5 15 - B, PLATINUM TOWER, 5TH FLOOR, SOHNA ROAD, SECTOR - 47, GURGAON - 122002, NATIONAL CAPITAL REGION,  INDIA Proposed to be Used D ELHI Cl.9; Scientific, research, navigation, surveying, photogr aphic, cinematographic, audiovisual, optical, weighing,  measuring, signalling, detecting, testing, inspecting, life-saving and teaching apparatus and instruments; Apparatus and  instruments for conducting, switching, transforming, accumulating, regulating or controlling the distribution or use of  electricity; Apparatus and instruments for recording, transmitting, reproducing or processing sound, images or data;  Recorded and downloadable media, computer software, blank digital or analogue recording and storage media;  Mechanisms for coin-operated apparatus; Cash registers, calculating devices; Computers and computer peripheral  devices; Diving suits, divers’ masks, ear plugs for divers, nose clips for divers and swimmers, gloves for divers, breathing  apparatus for underwater swimming; Fire-extinguishing apparatus; computer operating software; computer browsing  software; computer software for providing access to the Internet; computer hardware; desktop computers; tablet  computers; mobile phones; personal handheld devices; application software; application software for smart phone; data  processing apparatus; downloadable computer software applications; downloadable smartphone application (software);  air analysis apparatus; amplifiers; animated cartoons; answering machines; anti-theft warning apparatus; application  software for use in increasing business productivity; audiovisual teaching apparatus; battery chargers; biometric identity  cards; cabinets for loudspeakers; cameras [photography]; cinematographic cameras; electrical adapters; electronic book  readers; electronic pocket translators; eyewear; headphones; intercommunication apparatus; loudspeakers; measuring  apparatus; microphones; mobile telephones / cell phones / cellular phones; projection apparatus; protective cases for  smartphones; remote control apparatus; scanners [data processing equipment]; selfie sticks [hand-held monopods]; slide  projectors; smart glasses; smartphones; smartwatches; sound alarms; telephone apparatus; television apparatus;  videoconferencing apparatus, equipment and software; covers for smartphones and mobile phones; electronic interactive  whiteboards; facsimile machines; monitors [computer programs]; navigational instruments; scanners [data processing  equipment]; video recorders; video projectors; sound recording carriers; communication software for connecting  computer network users; computer software for database management; computer software for business purposes;  computer software for cloud computing;computer software for data, desktop and application streaming; business  intelligence software; game software; game engine software; computer software to manage, connect, and operate internet  of things (IOT) electronic devices; computer software development tools; software development kits (SDK). Cl.35; Advertising; Business management, organization and a dministration; Office functions; Retail store services  featuring computer software provided via the Internet and other computer and electronic communication networks; retail  store services featuring computer software for use on handheld mobile digital electronic devices and other consumer  electronics; on-line advertising on computer networks; preparing advertisements for others; dissemination of advertising  matter; advertising through all public communication means; sales promotion for others; compilation and collection of  data, information and statistics for business purposes database management; updating and maintenance of data in  computer databases; data management, storage and retrieval services; electronic storage of files and documents for  others; search engine optimization for sales promotion; personnel management consultancy; commercial information  agency services; providing business information via a website; advice and information concerning computer-aided  business productivity; providing information relating to business productivity via web sites. Cl.42; Scientific and technological services and research a nd design relating thereto; Industrial analysis, industrial  research and industrial design services; Quality control and authentication services; Design and development of computer  hardware and software; computer design services; application service provider (ASP) services, namely, hosting computer  software applications of others; technical support services; troubleshooting; providing a website featuring information  relating to computer software; design and development of computer hardware and software; provision of software  applications through a website; platform as a service (PaaS); application service provider (ASP) services; provision of  Internet search engines; software as a services (SaaS); cloud computing; providing technical information and advice in the  field of computer hardware, computer software, cloud computing and computer networks; computer and software  consultancy services; telecommunications technology consultancy; information technology [IT] consultancy; internet  security consultancy; hosting on-line web facilities for others for sharing on-line content; hosting platforms on the  Internet; electronic data storage; hosting a website for the electronic storage of digital photographs and videos; hosting  digital content on the Internet; hosting multimedia entertainment content; hosting of multimedia and interactive  applications; web site hosting services; provision of software applications for use in increasing business productivity  through a website. 4813","tm_class":"99","tm_phonetics":"LRKKST"},{"page_no":"706,journal no. 2048","trademark":"THE STOREOTYPE","details":"5328079    14/02/2022 CRAZYMINDS SOFTWARE SOLUTIONS PRIVATE LIMITED F NO A2/603, DHAWALGIRI, SNO 123/A/1, RAMBAUG COL, MIT COLL PD RD, KOTHRUD, PUNE, MAHARASHTRA, INDIA,  411029 BODY INCORPORATE Address for service in India/Attorney address: ANU ALIAS N o. 251/62 Aishwarya Towers, 9th Main, 43rd Cross, 5th Block, Jayanagar, Bangalore- 560041 Proposed to be Used M UMBAI Cl.35; ADVERTISING, BUSINESS MANAGEMENT, BUSINESS ADMINISTR ATION, OFFICE FUNCTIONS, ONLINE RETAIL  BUSINESS Cl.40; PRINTING SERVICES, PRINTING OF PHOTOS, PRINTING OF I MAGES ON OBJECTS, T-SHIRT PRINTING,  CUSTOMIZED PRINTING ON GOODS, T-SHIRTS, MUGS, GLASS FRAMES, PILLOWS, MOBILE COVERS, SIPPER BOTTLES,  WOODEN FRAMES, KEY CHAINS, GARMENTS AND OTHER PRODUCTS. 4814","tm_class":"99","tm_phonetics":"0 STRTP"},{"page_no":"707,journal no. 2048","trademark":"APARTMENTS BY MARRIOTT BONVOY","details":"5329467    15/02/2022 MARRIOTT WORLDWIDE CORPORATION 1 0400 Fernwood Road, Bethesda, Maryland 20817, United States of America A Maryland Corporation Address for service in India/Attorney address: INVENTURE IP C  1/8 Sector 36 NOIDA 201301 UP Proposed to be Used T o be associated with: 3982219 DELHI C l.35; Franchise services, namely, offering business manage ment assistance in the establishment and operation of  hotels, restaurants, bars, spas, recreational and fitness facilities, retail stores, condominiums and apartment buildings;  business management services, namely, management and operation of hotels, restaurants, bars, recreational and fitness  facilities, retail stores, condominiums and apartment buildings for others; retail store services, namely, gift shop, souvenir,  and convenience store services; business management consultation services; providing facilities for the use of office  equipment and machinery; business administration services; business meeting planning services; providing facilities for  business meetings; providing business convention and business conference facilities; management, rental and leasing of  office and retail space; real estate marketing services in the field of temporary accommodations; providing an interactive  website that promotes real estate properties, namely, residential housing, apartments, rooms in homes, sublets, vacation  homes, cabins and villas Cl.36; Real estate services, namely, services relating to t he development, leasing, rental, management and operation of  apartments, flats, condominiums and serviced apartments, and facilities and amenities relating thereto; providing an  online database of rental properties; real estate listing, rental, leasing, and management services for residential housing,  apartments, rooms in homes, sublets, vacation homes, cabins and villas. Cl.43; Hotel services; restaurant, catering, bar and cockta il lounge services; provision of general purpose facilities for  meetings, conferences and exhibitions; provision of banquet and social function facilities for special occasions; and  reservation services for hotel accommodations for others; providing temporary accommodations; providing online  reservation, booking and search services for temporary accommodations; providing an online interactive website  featuring temporary accommodations 4815","tm_class":"99","tm_phonetics":"APRTMNTS B MRT BNF"},{"page_no":"708,journal no. 2048","trademark":"NEC OPEN NETWORKS","details":"5329506    15/02/2022 NEC CORPORATION 7 -1, SHIBA 5-CHOME, MINATO-KU, TOKYO, JAPAN a corporation existing under the laws of Japan Address for service in India/Attorney address: DEPENNING & DEPENNING 1 20, VELACHERY MAIN ROAD, GUINDY, CHENNAI - 600 032. Proposed to be Used T o be associated with: 615085, 888024, 1242383, 4672315 CHENNAI C l.9; Computer hardware and computer software; computer ne tworking hardware; radio apparatus and instruments;  radio transmitters and receivers; telecommunication base stations. Cl.37; Installation, maintenance and repair of computer har dware; installation, maintenance and repair of hardware for  computer networks; installation, maintenance and repair of radio systems and networks. Cl.38; Telecommunication services; mobile radio communicati on services. Cl.42; Computer programming; cloud computing; computer engi neering; software engineering; design and development  of computer systems; design and development of computer software and programs; configuration of computer software,  computer systems and networks; testing of computers and computer software; installation, updating, maintenance and  rental of computer software; providing computer software; providing temporary use of non-downloadable software;  software as a service; providing technical information about computers, computer software and computer networks;  providing information about the design and development of computer software, systems and networks; consulting in the  field of information technology and telecommunications technology; troubleshooting of computer software problems  [technical support]; design and development of telecommunications networks; design and development of computer  networks; monitoring of computer systems by remote access; monitoring of network systems; integration of computer  systems and computer networks. 4816","tm_class":"99","tm_phonetics":"NK PN NTWRKS"},{"page_no":"710,journal no. 2048","trademark":"TITAN","details":"5330493    16/02/2022 TITAN COMPANY LIMITED I NTEGRITY, NO.193, VEERASANDRA, ELECTRONICS CITY P.O., OFF HOSUR MAIN ROAD, BANGALORE – 560100,  KARNATAKA, INDIA An Indian Company incorporated under the Companies Act, 1956. Address for service in India/Attorney address: SUDESHNA BANERJEE K &S PARTNERS, 4121/B, 6th Cross, 19 \"A\" Main, HAL II Stage (Ext.), Bangalore-560038, Karnataka, India Proposed to be Used C HENNAI Cl.9; DOWNLOADABLE VIRTUAL GOODS, NAMELY, COMPUTER PROGRAM S FEATURING WATCHES, HOROLOGICAL  AND CHRONOMETRIC INSTRUMENTS, SMART WATCHES, WEARABLE DIGITAL ELECTRONIC DEVICES, SPECTACLES,  LENSES, SUNGLASSES, WALLETS, BAGS AND BELTS FOR USE ONLINE AND IN ONLINE VIRTUAL WORLDS; DIGITAL  MEDIA, NAMELY, DIGITAL COLLECTIBLES, DIGITAL TOKENS, NON-FUNGIBLE TOKENS (NFTs), AND DIGITAL ART;  FUNGIBLE AND NON-FUNGIBLE TOKEN-BASED GOODS, NAMELY, WATCHES, HOROLOGICAL AND CHRONOMETRIC  INSTRUMENTS, SMART WATCHES, WEARABLE DIGITAL ELECTRONIC DEVICES, SPECTACLES, LENSES, SUNGLASSES,  WALLETS, BAGS AND BELTS FOR USE ONLINE AND IN ONLINE VIRTUAL WORLDS; DOWNLOADABLE IMAGE FILES  CONTAINING IMAGES AND ARTWORK AUTHENTICATED BY NON-FUNGIBLE TOKENS (NFTS); NON-FUNGIBLE TOKENS  (NFTS) AND OTHER APPLICATION TOKENS; NON-FUNGIBLE TOKENS USED WITH BLOCKCHAIN TECHNOLOGY TO  REPRESENT A COLLECTIBLE ITEM. Cl.35; RETAIL STORE SERVICES FEATURING VIRTUAL GOODS AND ME RCHANDISE, NAMELY, WATCHES,  HOROLOGICAL AND CHRONOMETRIC INSTRUMENTS, SMART WATCHES, WEARABLE DIGITAL ELECTRONIC DEVICES,  SPECTACLES, LENSES, SUNGLASSES, WALLETS, BAGS AND BELTS FOR USE IN ONLINE AND ONLINE VIRTUAL  WORLDS; ON-LINE RETAIL STORE SERVICES FEATURING PHYSICAL AND VIRTUAL MERCHANDISE FOR USE BY  MEMBERS OF AN ONLINE COMMUNITY IN CONNECTION WITH A DESIGNATED WEBSITE FEATURING FICTIONAL  CHARACTERS. Cl.41; ENTERTAINMENT SERVICES, NAMELY, PROVIDING ON-LINE, N ON-DOWNLOADABLE VIRTUAL WATCHES,  HOROLOGICAL AND CHRONOMETRIC INSTRUMENTS, SMART WATCHES, WEARABLE DIGITAL ELECTRONIC DEVICES,  SPECTACLES, LENSES, SUNGLASSES, WALLETS, BAGS AND BELTS FOR USE IN VIRTUAL ENVIRONMENTS CREATED  FOR ENTERTAINMENT PURPOSES. Cl.42; PROVIDING ON-LINE NON-DOWNLOADABLE VIRTUAL GOODS, NA MELY WATCHES, HOROLOGICAL AND  CHRONOMETRIC INSTRUMENTS, SMART WATCHES, WEARABLE DIGITAL ELECTRONIC DEVICES, SPECTACLES,  LENSES, SUNGLASSES, WALLETS, BAGS AND BELTS, DIGITAL ART, PHOTOGRAPHS, VIDEOS, OR AUDIO  RECORDINGS; PROVIDING ONLINE DIGITAL ARTWORK AND IMAGES; NON-FUNGIBLE TOKENS (NFTS) OR OTHER  DIGITAL TOKENS BASED ON BLOCKCHAIN TECHNOLOGY. 4818","tm_class":"99","tm_phonetics":"TTN"},{"page_no":"711,journal no. 2048","trademark":"FASTRACK","details":"5330498    16/02/2022 TITAN COMPANY LIMITED I NTEGRITY, NO.193, VEERASANDRA, ELECTRONICS CITY P.O., OFF HOSUR MAIN ROAD, BANGALORE – 560100,  KARNATAKA, INDIA An Indian Company incorporated under the Companies Act, 1956. Address for service in India/Attorney address: SUDESHNA BANERJEE K &S PARTNERS, 4121/B, 6th Cross, 19 \"A\" Main, HAL II Stage (Ext.), Bangalore-560038, Karnataka, India Proposed to be Used C HENNAI Cl.9; DOWNLOADABLE VIRTUAL GOODS, NAMELY, COMPUTER PROGRAM S FEATURING WATCHES, HOROLOGICAL  AND CHRONOMETRIC INSTRUMENTS, SMART WATCHES, WEARABLE DIGITAL ELECTRONIC DEVICES; HEADPHONES;  EARPHONES; SPEAKERS, EYEGLASSES, SPECTACLE, SUNGLASSES, PERFUMES; EAU DE PERFUME; COLOGNES;  DEODORANTS; BODY DEODORANTS; BODY SPRAYS; BAGS, BELTS, CAPS, HATS, BAGS, SPORTS BAGS, BACKPACKS,  LEATHER ARTICLES, CLOTHING, FOOTWEAR, SHOES, FASHION JEWELLERY, FASHION ACCESSORIES FOR USE  ONLINE AND IN ONLINE VIRTUAL WORLDS; DIGITAL MEDIA, NAMELY, DIGITAL COLLECTIBLES, DIGITAL TOKENS, NON- FUNGIBLE TOKENS (NFTs), AND DIGITAL ART; FUNGIBLE AND NON-FUNGIBLE TOKEN-BASED GOODS, NAMELY,  WATCHES, HOROLOGICAL AND CHRONOMETRIC INSTRUMENTS, SMART WATCHES, WEARABLE DIGITAL ELECTRONIC  DEVICES; HEADPHONES; EARPHONES; SPEAKERS, EYEGLASSES, SPECTACLE, SUNGLASSES, PERFUMES; EAU DE  PERFUME; COLOGNES; DEODORANTS; BODY DEODORANTS; BODY SPRAYS; BAGS, BELTS, CAPS, HATS, BAGS,  SPORTS BAGS, BACKPACKS, LEATHER ARTICLES, CLOTHING, FOOTWEAR, SHOES, FASHION JEWELLERY, FASHION  ACCESSORIES FOR USE ONLINE AND IN ONLINE VIRTUAL WORLDS; DOWNLOADABLE IMAGE FILES CONTAINING  IMAGES AND ARTWORK AUTHENTICATED BY NON-FUNGIBLE TOKENS (NFTS); NON-FUNGIBLE TOKENS (NFTS) AND  OTHER APPLICATION TOKENS; NON-FUNGIBLE TOKENS USED WITH BLOCKCHAIN TECHNOLOGY TO REPRESENT A  COLLECTIBLE ITEM. Cl.35; RETAIL STORE SERVICES FEATURING VIRTUAL GOODS AND ME RCHANDISE, NAMELY, WATCHES,  HOROLOGICAL AND CHRONOMETRIC INSTRUMENTS, SMART WATCHES, WEARABLE DIGITAL ELECTRONIC DEVICES;  HEADPHONES; EARPHONES; SPEAKERS, EYEGLASSES, SPECTACLE, SUNGLASSES, PERFUMES; EAU DE PERFUME;  COLOGNES; DEODORANTS; BODY DEODORANTS; BODY SPRAYS; BAGS, BELTS, CAPS, HATS, BAGS, SPORTS BAGS,  BACKPACKS, LEATHER ARTICLES, CLOTHING, FOOTWEAR, SHOES, FASHION JEWELLERY, FASHION ACCESSORIES  FOR USE IN ONLINE AND ONLINE VIRTUAL WORLDS; ON-LINE RETAIL STORE SERVICES FEATURING PHYSICAL AND  VIRTUAL MERCHANDISE FOR USE BY MEMBERS OF AN ONLINE COMMUNITY IN CONNECTION WITH A DESIGNATED  WEBSITE FEATURING FICTIONAL CHARACTERS. Cl.41; ENTERTAINMENT SERVICES, NAMELY, PROVIDING ON-LINE, N ON-DOWNLOADABLE VIRTUAL WATCHES,  HOROLOGICAL AND CHRONOMETRIC INSTRUMENTS, SMART WATCHES, WEARABLE DIGITAL ELECTRONIC DEVICES;  HEADPHONES; EARPHONES; SPEAKERS, EYEGLASSES, SPECTACLE, SUNGLASSES, PERFUMES; EAU DE PERFUME;  COLOGNES; DEODORANTS; BODY DEODORANTS; BODY SPRAYS; BAGS, BELTS, CAPS, HATS, BAGS, SPORTS BAGS,  BACKPACKS, LEATHER ARTICLES, CLOTHING, FOOTWEAR, SHOES, FASHION JEWELLERY, FASHION ACCESSORIES  FOR USE IN VIRTUAL ENVIRONMENTS CREATED FOR ENTERTAINMENT PURPOSES. Cl.42; PROVIDING ON-LINE NON-DOWNLOADABLE VIRTUAL GOODS, NA MELYWATCHES, HOROLOGICAL AND  CHRONOMETRIC INSTRUMENTS, SMART WATCHES, WEARABLE DIGITAL ELECTRONIC DEVICES; HEADPHONES;  EARPHONES; SPEAKERS, EYEGLASSES, SPECTACLE, SUNGLASSES, PERFUMES; EAU DE PERFUME; COLOGNES;  DEODORANTS; BODY DEODORANTS; BODY SPRAYS; BAGS, BELTS, CAPS, HATS, BAGS, SPORTS BAGS, BACKPACKS,  LEATHER ARTICLES, CLOTHING, FOOTWEAR, SHOES, FASHION JEWELLERY, FASHION ACCESSORIES, DIGITAL ART,  PHOTOGRAPHS, VIDEOS, OR AUDIO RECORDINGS; PROVIDING ONLINE DIGITAL ARTWORK AND IMAGES; NON- FUNGIBLE TOKENS (NFTS) OR OTHER DIGITAL TOKENS BASED ON BLOCKCHAIN TECHNOLOGY. 4819","tm_class":"99","tm_phonetics":"FSTRK"},{"page_no":"712,journal no. 2048","trademark":"TANEIRA","details":"5330562    16/02/2022 TITAN COMPANY LIMITED I NTEGRITY, NO.193, VEERASANDRA, ELECTRONICS CITY P.O., OFF HOSUR MAIN ROAD, BANGALORE – 560100,  KARNATAKA, INDIA An Indian Company incorporated under the Companies Act, 1956. Address for service in India/Attorney address: SUDESHNA BANERJEE K &S PARTNERS, 4121/B, 6th Cross, 19 \"A\" Main, HAL II Stage (Ext.), Bangalore-560038, Karnataka, India Proposed to be Used C HENNAI Cl.9; DOWNLOADABLE VIRTUAL GOODS, NAMELY, COMPUTER PROGRAM S FEATURING CLOTHING, FOOTWEAR,  HEADWEAR, CLOTHING ACCESSORIES FOR USE ONLINE AND IN ONLINE VIRTUAL WORLDS; DIGITAL MEDIA, NAMELY,  DIGITAL COLLECTIBLES, DIGITAL TOKENS, NON-FUNGIBLE TOKENS (NFTs), AND DIGITAL ART; FUNGIBLE AND NON- FUNGIBLE TOKEN-BASED GOODS, NAMELY, CLOTHING, FOOTWEAR, HEADWEAR, CLOTHING ACCESSORIES FOR USE  ONLINE AND IN ONLINE VIRTUAL WORLDS; DOWNLOADABLE IMAGE FILES CONTAINING IMAGES AND ARTWORK  AUTHENTICATED BY NON-FUNGIBLE TOKENS (NFTS); NON-FUNGIBLE TOKENS (NFTS) AND OTHER APPLICATION  TOKENS; NON-FUNGIBLE TOKENS USED WITH BLOCKCHAIN TECHNOLOGY TO REPRESENT A COLLECTIBLE ITEM. Cl.35; RETAIL STORE SERVICES FEATURING VIRTUAL GOODS AND ME RCHANDISE, NAMELY, CLOTHING,  FOOTWEAR, HEADWEAR, CLOTHING ACCESSORIES FOR USE IN ONLINE AND ONLINE VIRTUAL WORLDS; ON-LINE  RETAIL STORE SERVICES FEATURING PHYSICAL AND VIRTUAL MERCHANDISE FOR USE BY MEMBERS OF AN ONLINE  COMMUNITY IN CONNECTION WITH A DESIGNATED WEBSITE FEATURING FICTIONAL CHARACTERS. 4820","tm_class":"99","tm_phonetics":"TNR"},{"page_no":"713,journal no. 2048","trademark":"TITAN EYE+","details":"5330563    16/02/2022 TITAN COMPANY LIMITED I NTEGRITY, NO.193, VEERASANDRA, ELECTRONICS CITY P.O., OFF HOSUR MAIN ROAD, BANGALORE – 560100,  KARNATAKA, INDIA An Indian Company incorporated under the Companies Act, 1956. Address for service in India/Attorney address: SUDESHNA BANERJEE K &S PARTNERS, 4121/B, 6th Cross, 19 \"A\" Main, HAL II Stage (Ext.), Bangalore-560038, Karnataka, India Proposed to be Used T o be associated with: 1486186, 1486191, 1486201, 1631635, 2745705, 2745706 , 2874024, 2874026 CHENNAI C l.9; DOWNLOADABLE VIRTUAL GOODS, NAMELY, COMPUTER PROGRAM S FEATURING EYEGLASSES, SPECTACLE,  SUNGLASSES, OPTICAL ACCESSORIES, OPTICAL APPARATUS, OPTICAL INSTRUMENTS AND OPTICAL FITTINGS FOR  USE ONLINE AND IN ONLINE VIRTUAL WORLDS; DIGITAL MEDIA, NAMELY, DIGITAL COLLECTIBLES, DIGITAL TOKENS,  NON-FUNGIBLE TOKENS (NFTs), AND DIGITAL ART; FUNGIBLE AND NON-FUNGIBLE TOKEN-BASED GOODS, NAMELY,  EYEGLASSES, SPECTACLE, SUNGLASSES, OPTICAL ACCESSORIES, OPTICAL APPARATUS, OPTICAL INSTRUMENTS  AND OPTICAL FITTINGS FOR USE ONLINE AND IN ONLINE VIRTUAL WORLDS; DOWNLOADABLE IMAGE FILES  CONTAINING IMAGES AND ARTWORK AUTHENTICATED BY NON-FUNGIBLE TOKENS (NFTS); NON-FUNGIBLE TOKENS  (NFTS) AND OTHER APPLICATION TOKENS; NON-FUNGIBLE TOKENS USED WITH BLOCKCHAIN TECHNOLOGY TO  REPRESENT A COLLECTIBLE ITEM. Cl.35; RETAIL STORE SERVICES FEATURING VIRTUAL GOODS AND ME RCHANDISE, NAMELY, EYEGLASSES,  SPECTACLE, SUNGLASSES, OPTICAL ACCESSORIES, OPTICAL APPARATUS, OPTICAL INSTRUMENTS AND OPTICAL  FITTINGS FOR USE IN ONLINE AND ONLINE VIRTUAL WORLDS; ON-LINE RETAIL STORE SERVICES FEATURING  PHYSICAL AND VIRTUAL MERCHANDISE FOR USE BY MEMBERS OF AN ONLINE COMMUNITY IN CONNECTION WITH A  DESIGNATED WEBSITE FEATURING FICTIONAL CHARACTERS. 4821","tm_class":"99","tm_phonetics":"TTN Y+"},{"page_no":"714,journal no. 2048","trademark":"TITAN EYEPLUS","details":"5330564    16/02/2022 TITAN COMPANY LIMITED I NTEGRITY, NO.193, VEERASANDRA, ELECTRONICS CITY P.O., OFF HOSUR MAIN ROAD, BANGALORE – 560100,  KARNATAKA, INDIA An Indian Company incorporated under the Companies Act, 1956. Address for service in India/Attorney address: SUDESHNA BANERJEE K &S PARTNERS, 4121/B, 6th Cross, 19 \"A\" Main, HAL II Stage (Ext.), Bangalore-560038, Karnataka, India Proposed to be Used T o be associated with: 1486186, 1486191, 1486201, 1631635, 2745705, 2745706 , 2874024, 2874026 CHENNAI C l.9; DOWNLOADABLE VIRTUAL GOODS, NAMELY, COMPUTER PROGRAM S FEATURING EYEGLASSES, SPECTACLE,  SUNGLASSES, OPTICAL ACCESSORIES, OPTICAL APPARATUS, OPTICAL INSTRUMENTS AND OPTICAL FITTINGS FOR  USE ONLINE AND IN ONLINE VIRTUAL WORLDS; DIGITAL MEDIA, NAMELY, DIGITAL COLLECTIBLES, DIGITAL TOKENS,  NON-FUNGIBLE TOKENS (NFTs), AND DIGITAL ART; FUNGIBLE AND NON-FUNGIBLE TOKEN-BASED GOODS, NAMELY,  EYEGLASSES, SPECTACLE, SUNGLASSES, OPTICAL ACCESSORIES, OPTICAL APPARATUS, OPTICAL INSTRUMENTS  AND OPTICAL FITTINGS FOR USE ONLINE AND IN ONLINE VIRTUAL WORLDS; DOWNLOADABLE IMAGE FILES  CONTAINING IMAGES AND ARTWORK AUTHENTICATED BY NON-FUNGIBLE TOKENS (NFTS); NON-FUNGIBLE TOKENS  (NFTS) AND OTHER APPLICATION TOKENS; NON-FUNGIBLE TOKENS USED WITH BLOCKCHAIN TECHNOLOGY TO  REPRESENT A COLLECTIBLE ITEM. Cl.35; RETAIL STORE SERVICES FEATURING VIRTUAL GOODS AND ME RCHANDISE, NAMELY, EYEGLASSES,  SPECTACLE, SUNGLASSES, OPTICAL ACCESSORIES, OPTICAL APPARATUS, OPTICAL INSTRUMENTS AND OPTICAL  FITTINGS FOR USE IN ONLINE AND ONLINE VIRTUAL WORLDS; ON-LINE RETAIL STORE SERVICES FEATURING  PHYSICAL AND VIRTUAL MERCHANDISE FOR USE BY MEMBERS OF AN ONLINE COMMUNITY IN CONNECTION WITH A  DESIGNATED WEBSITE FEATURING FICTIONAL CHARACTERS. 4822","tm_class":"99","tm_phonetics":"TTN YPLS"},{"page_no":"715,journal no. 2048","trademark":"XYLYS","details":"5330565    16/02/2022 TITAN COMPANY LIMITED I NTEGRITY, NO.193, VEERASANDRA, ELECTRONICS CITY P.O., OFF HOSUR MAIN ROAD, BANGALORE – 560100,  KARNATAKA, INDIA An Indian Company incorporated under the Companies Act, 1956. Address for service in India/Attorney address: SUDESHNA BANERJEE K &S PARTNERS, 4121/B, 6th Cross, 19 \"A\" Main, HAL II Stage (Ext.), Bangalore-560038, Karnataka, India Proposed to be Used C HENNAI Cl.9; DOWNLOADABLE VIRTUAL GOODS, NAMELY, COMPUTER PROGRAM S FEATURING WATCHES, HOROLOGICAL  AND CHRONOMETRIC INSTRUMENTS FOR USE ONLINE AND IN ONLINE VIRTUAL WORLDS; DIGITAL MEDIA, NAMELY,  DIGITAL COLLECTIBLES, DIGITAL TOKENS, NON-FUNGIBLE TOKENS (NFTs), AND DIGITAL ART; FUNGIBLE AND NON- FUNGIBLE TOKEN- BASED GOODS, NAMELY, WATCHES, HOROLOGICAL AND CHRONOMETRIC INSTRUMENTS FOR USE  ONLINE AND IN ONLINE VIRTUAL WORLDS; DOWNLOADABLE IMAGE FILES CONTAINING IMAGES AND ARTWORK  AUTHENTICATED BY NON-FUNGIBLE TOKENS (NFTS); NON-FUNGIBLE TOKENS (NFTS) AND OTHER APPLICATION  TOKENS; NON-FUNGIBLE TOKENS USED WITH BLOCKCHAIN TECHNOLOGY TO REPRESENT A COLLECTIBLE ITEM. Cl.35; RETAIL STORE SERVICES FEATURING VIRTUAL GOODS AND ME RCHANDISE, NAMELY, WATCHES,  HOROLOGICAL AND CHRONOMETRIC INSTRUMENTS FOR USE IN ONLINE AND ONLINE VIRTUAL WORLDS; ON-LINE  RETAIL STORE SERVICES FEATURING PHYSICAL AND VIRTUAL MERCHANDISE FOR USE BY MEMBERS OF AN ONLINE  COMMUNITY IN CONNECTION WITH A DESIGNATED WEBSITE FEATURING FICTIONAL CHARACTERS. 4823","tm_class":"99","tm_phonetics":"SLS"},{"page_no":"718,journal no. 2048","trademark":"KISANPAY","details":"5337479    21/02/2022 PURVANG PARESH MAKIM S h0p no 7,yashaswi chambers,sangli Agriculture goods proprietor Proposed to be Used M UMBAI Cl.9; Computer software for online payment; Computer softw are to allow users to perform electronic business  transactions via a global computer network; computer software for receiving, storing, editing, and transmitting purchase  information over a computer network; computer software to log commercial transactions; Mobile applications for online  transactions; Computer software for processing electronic payments and for transferring funds to and from others;  authentication software for controlling access to and communications with computers and computer networks;  magnetically encoded credit cards and payment cards; Cl.38; Communications and telecommunications services for e lectronic bill payment systems; leasing access time to  web-sites for electronic bill payment systems; Telecommunications services, namely the electronic transmission of data  and information, paging services, providing an online, interactive bulletin board for the transmission of messages among  computer user concerning trading, and the purchase and sale of items via a global computer network; data streaming;  transmission of videos; videotext services; 4826","tm_class":"99","tm_phonetics":"KSNP"},{"page_no":"722,journal no. 2048","trademark":"ECODURE","details":"5338378    21/02/2022 NUVOCO VISTAS CORPORATION LIMITED E quinox Business Park, Tower 3, East, Wing, 4th Floor, Lbs Marg, Kurla (West), Kurla – 400 070, Maharashtra, India An Indian Company incorpoated under the Companies Act, 1956. Address for service in India/Agents address: ANAND AND ANAND. B -41,NIZAMUDDIN EAST, NEW DELHI - 110 013. Proposed to be Used M UMBAI Cl.1; Chemical products for use in industry and science, i ncluding chemical products for use in the concrete and cement  industry; unprocessed artificial resins, unprocessed plastics; adhesives for use in industry. Cl.19; Non-metallic building materials including concrete,  cement and clinker; components and additives (included in  this class) for the above-mentioned goods, particularly additives for concrete; non-metallic rigid pipes for building;  asphalt, pitch and bitumen; transportable buildings not of metal; monuments not of metal. 4830","tm_class":"99","tm_phonetics":"EKTR"},{"page_no":"723,journal no. 2048","trademark":"FEEL THE PAUSE","details":"5338500    21/02/2022 TATA SIA AIRLINES LIMITED J eevan Bharti, Tower I, 10th Floor, 124 Connaught Circus, New Delhi – 110001 An Indian Company incorpoated under the Companies Act, 1956. Address for service in India/Agents address: ANAND AND ANAND. B -41,NIZAMUDDIN EAST, NEW DELHI - 110 013. Proposed to be Used D ELHI Cl.9; Scientific, research, navigation, surveying, photogr aphic, cinematographic, audiovisual, optical, weighing,  measuring, signalling, detecting, testing, inspecting, life-saving and teaching apparatus and instruments; apparatus and  instruments for conducting, switching, transforming, accumulating, regulating or controlling the distribution or use of  electricity; apparatus and instruments for recording, transmitting, reproducing or processing sound, images or data;  recorded and downloadable media, computer software, blank digital or analogue recording and storage media;  mechanisms for coin-operated apparatus; cash registers, calculating devices; computers and computer peripheral  devices; diving suits, divers' masks, ear plugs for divers, nose clips for divers and swimmers, gloves for divers, breathing  apparatus for underwater swimming; fire-extinguishing apparatus. Cl.12; Vehicles; apparatus for locomotion by land, air or w ater. Cl.39; Transport; packaging and storage of goods; travel ar rangement. Cl.41; Education; providing of training; entertainment; spo rting and cultural activities. Cl.44; Medical services; veterinary services; hygienic and  beauty care for human beings or animals; agriculture,  aquaculture, horticulture and forestry services. 4831","tm_class":"99","tm_phonetics":"FL 0 PS"},{"page_no":"725,journal no. 2048","trademark":"GLIDA","details":"5340563    22/02/2022 FORTUM CHARGE & DRIVE INDIA PRIVATE LIMITED 1 A, Vandana Building, 11, Tolstoy Marg, New Delhi - 110001, India A company incorporated under the Companies Act, 2013 Address for service in India/Attorney address: LEXORBIS 7 09/710 Tolstoy House, 15-17 Tolstoy Marg, New Delhi-110001 Proposed to be Used D ELHI Cl.9; Charging stations for electric vehicles; downloadabl e mobile application software for electric vehicle charging. Cl.37; Installation, maintenance, and repair services namel y installation, maintenance and repair of electric vehicle  charging equipment; charging station services for electric vehicles; leasing of charging equipment. Cl.38; Internet-based telecommunication services to enable  users to reserve, activate and pay for charging station  sessions to recharge electric vehicles; electronic transmission of measured data; electronic, electric and digital  transmission and distribution of data, signals and messages via data networks; electronic bulletin board services;  providing access to database for management of customer data; remote transmission of data by means of  telecommunications; providing access to databases. Cl.39; Storage of electricity; supply of electricity. Cl.42; Software as a service; platform as a service; design  and development of electric vehicle charging station  infrastructure. 4833","tm_class":"99","tm_phonetics":"KLT"},{"page_no":"726,journal no. 2048","trademark":"UNFURL","details":"5340564    22/02/2022 FORTUM CHARGE & DRIVE INDIA PRIVATE LIMITED 1 A, Vandana Building, 11, Tolstoy Marg, New Delhi - 110001, India A company incorporated under the Companies Act, 2013 Address for service in India/Attorney address: LEXORBIS 7 09/710 Tolstoy House, 15-17 Tolstoy Marg, New Delhi-110001 Proposed to be Used D ELHI Cl.9; Charging stations for electric vehicles; downloadabl e mobile application software for electric vehicle charging. Cl.37; Installation, maintenance, and repair services namel y installation, maintenance and repair of electric vehicle  charging equipment; charging station services for electric vehicles; leasing of charging equipment. Cl.38; Internet-based telecommunication services to enable  users to reserve, activate and pay for charging station  sessions to recharge electric vehicles; electronic transmission of measured data; electronic, electric and digital  transmission and distribution of data, signals and messages via data networks; electronic bulletin board services;  providing access to database for management of customer data; remote transmission of data by means of  telecommunications; providing access to databases. Cl.39; Storage of electricity; supply of electricity. Cl.42; Software as a service; platform as a service; design  and development of electric vehicle charging station  infrastructure. 4834","tm_class":"99","tm_phonetics":"UNFRL"},{"page_no":"727,journal no. 2048","trademark":"PRATIC","details":"5341108    23/02/2022 Bricard 1  rue Paul Henri Spaak, 77400 SAINT-THIBAULT-DES-VIGNES CEDEX, FRANCE A French Corporation Address for service in India/Attorney address: D.P. AHUJA & CO S TAR TOWER, OFFICE NO. 510, SECTOR-30, GURGAON 122001, DELHI (NCR), INDIA Used Since :19/09/2007 DELHI C l.6; Ironmongery; locks (other than electric) of metal; a rmour-platings of metal, steel security doors of metal, knobs of  metal, door handles of metal Cl.9; Electric locks, electric devices of closing and lock ing for doors, windows and access; electrical access control  apparatus; electronic access control systems for interlocking doors, windows and entrances Cl.20; Door fittings not of metal, locks (other than electr ic) not of metal, knobs not of metal, door handles not of metal 4835","tm_class":"99","tm_phonetics":"PRTK"},{"page_no":"731,journal no. 2048","trademark":"CHUTZPAH","details":"5344535    25/02/2022 Saregama India Limited 3 3 Jessore Road, Dumdum, Kolkata – 700 028, West Bengal, India An Indian Company Address for service in India/Attorney address: L.S. DAVAR & CO. G LOBSYN CRYSTALS,TOWER 1,2ND FLOOR,BLOCK EP,PLOT NO.11 & 12,SALT LAKE,SECTOR V,KOLKATA 700 091,WEST  BENGAL,INDIA Proposed to be Used K OLKATA Cl.9; Scientific, research, navigation, surveying, photogr aphic, cinematographic, audiovisual, optical, weighing,  measuring, signalling, detecting, testing, inspecting, life-saving and teaching apparatus and instruments; apparatus and  instruments for conducting, switching, transforming, accumulating, regulating or controlling the distribution or use of  electricity; apparatus and instruments for recording, transmitting, reproducing or processing sound, images or data;  recorded and downloadable media, computer software, blank digital or analogue recording and storage media;  mechanisms for coin-operated apparatus; cash registers, calculating devices; computers and computer peripheral  devices; magnetic data carriers, recording discs; compact discs, DVDs and other digital recording media; data processing  equipment including mobile covers, laptop skins, etc. Cl.25; Clothing, footwear, headwear. Cl.41; Education; providing of training; entertainment; spo rting and cultural activities. 4839","tm_class":"99","tm_phonetics":"SHTSP"},{"page_no":"732,journal no. 2048","trademark":"ALL-INCLUSIVE BY MARRIOTT BONVOY","details":"5344631    25/02/2022 MARRIOTT WORLDWIDE CORPORATION 1 0400 Fernwood Road, Bethesda, Maryland 20817, United States of America A Maryland Corporation Address for service in India/Attorney address: INVENTURE IP C  1/8 Sector 36 NOIDA 201301 UP Proposed to be Used T o be associated with: 3577394, 3982219, 4029627 DELHI C l.39; Transport of passengers and of goods; packaging and  storage of goods; ground transportation services, namely,  bicycle rental, car rental, and ground transportation of passengers by car, limousine, van or bus; cruise services; cruise  ship services; travel agency services, namely, arranging, making reservations for and taking bookings for transportation  of passengers and goods, cruises and cruise ship services, excursions, tours, holidays and travel; organizing and  operating excursions, tours, holidays and cruises; travel guide and travel information services; event planning and  management services, namely, arranging, organizing, scheduling and designing vacations; provision of information and  advice relating to all the aforesaid services. Cl.41; Educational services, namely, arranging and conducti ng seminars, workshops, classes, conferences, and  symposiums in the fields of leadership development, human resources, customer service, customer and employee  satisfaction and loyalty, employee recruitment, and employee orientation, training, and development, cooking, art, foreign  languages, etiquette, arts and crafts, nature, and conservation; providing entertainment, sporting and cultural activities;  arranging for tickets and reservations for shows and other entertainment events; health and fitness club services, namely,  providing services, facilities, instruction and equipment in the fields of fitness and physical exercise; providing  recreational facilities, instruction and equipment for swimming pools, bicycling, golf, water sports, horseback riding,  skiing and beach access; golf club, golf course and golf instruction services; providing tennis facilities, rental of tennis  courts and tennis instruction; providing amusement arcade services; wedding reception planning services; event planning  and management services, namely arranging, organizing, scheduling and designing special events for social  entertainment purposes; arranging conferences and organizing exhibitions for cultural and educational purposes; casino  services; gaming services; cabaret services; nightclub services; providing hotel guests with educational and  entertainment information about local attractions and points of interest within the vicinity of hotel properties and  distributing materials in connection therewith; art exhibitions. Cl.43; Hotel services; restaurant, catering, bar and cockta il lounge services; resort lodging services; provision of  general-purpose facilities for meetings, conferences and exhibitions; provision of banquet and social function facilities for  special occasions; and reservations services for hotel accommodations for others. Cl.44; Spa services, namely, providing facial, hair, skin a nd body treatments, manicure and pedicure services, massage  services, body waxing services, and beauty salon services. Cl.45; Planning and arranging of wedding ceremonies; securi ty services for the protection of property and individuals;  personal and social services rendered to meet the needs of individuals; personalized and customized services in relation  with social events; concierge services; concierge information services; concierge services for others by making requested  personal arrangements; social escorting; clothing rental services; caretaker services for property and or individuals;  house sitting, baby-sitting services; provision of information, advisory and consultancy services relating to all the  aforesaid services. 4840","tm_class":"99","tm_phonetics":"AL-NKLSF B MRT BNF"}]